{
  "ar": "الحجر",
  "en": "The Rock",
  "_a": "Al-Hijr",
  "_l": "Meccan",
  "_v": [
    {
      "ar": "الٓر ۚ تِلْكَ ءَايَـٰتُ ٱلْكِتَـٰبِ وَقُرْءَانٍ مُّبِينٍ",
      "en": "Alif, Lam, Ra. These are the signs of the Book and a manifest Quran.",
      "_n": 1
    },
    {
      "ar": "رُّبَمَا يَوَدُّ ٱلَّذِينَ كَفَرُوا۟ لَوْ كَانُوا۟ مُسْلِمِينَ",
      "en": "Much will the faithless wish that they had been Muslims.",
      "_n": 2
    },
    {
      "ar": "ذَرْهُمْ يَأْكُلُوا۟ وَيَتَمَتَّعُوا۟ وَيُلْهِهِمُ ٱلْأَمَلُ ۖ فَسَوْفَ يَعْلَمُونَ",
      "en": "Leave them to eat and enjoy and to be diverted by longings. Soon they will know.",
      "_n": 3
    },
    {
      "ar": "وَمَآ أَهْلَكْنَا مِن قَرْيَةٍ إِلَّا وَلَهَا كِتَابٌ مَّعْلُومٌ",
      "en": "We did not destroy any town but that it had a known term.",
      "_n": 4
    },
    {
      "ar": "مَّا تَسْبِقُ مِنْ أُمَّةٍ أَجَلَهَا وَمَا يَسْتَـْٔخِرُونَ",
      "en": "No nation can advance its time nor can it defer it.",
      "_n": 5
    },
    {
      "ar": "وَقَالُوا۟ يَـٰٓأَيُّهَا ٱلَّذِى نُزِّلَ عَلَيْهِ ٱلذِّكْرُ إِنَّكَ لَمَجْنُونٌ",
      "en": "They said, ‘O you, to whom the Reminder has been sent down, you are indeed crazy.",
      "_n": 6
    },
    {
      "ar": "لَّوْ مَا تَأْتِينَا بِٱلْمَلَـٰٓئِكَةِ إِن كُنتَ مِنَ ٱلصَّـٰدِقِينَ",
      "en": "Why do you not bring us the angels should you be truthful?!’",
      "_n": 7
    },
    {
      "ar": "مَا نُنَزِّلُ ٱلْمَلَـٰٓئِكَةَ إِلَّا بِٱلْحَقِّ وَمَا كَانُوٓا۟ إِذًا مُّنظَرِينَ",
      "en": "We do not send down the angels except with due reason, and then they will not be granted any respite.",
      "_n": 8
    },
    {
      "ar": "إِنَّا نَحْنُ نَزَّلْنَا ٱلذِّكْرَ وَإِنَّا لَهُۥ لَحَـٰفِظُونَ",
      "en": "Indeed We have sent down the Reminder, and indeed We will preserve it.",
      "_n": 9
    },
    {
      "ar": "وَلَقَدْ أَرْسَلْنَا مِن قَبْلِكَ فِى شِيَعِ ٱلْأَوَّلِينَ",
      "en": "Certainly We sent [apostles] before you to former communities,",
      "_n": 10
    },
    {
      "ar": "وَمَا يَأْتِيهِم مِّن رَّسُولٍ إِلَّا كَانُوا۟ بِهِۦ يَسْتَهْزِءُونَ",
      "en": "and there did not come to them any apostle but that they used to deride him.",
      "_n": 11
    },
    {
      "ar": "كَذَٰلِكَ نَسْلُكُهُۥ فِى قُلُوبِ ٱلْمُجْرِمِينَ",
      "en": "That is how We let it pass through the hearts of the guilty:",
      "_n": 12
    },
    {
      "ar": "لَا يُؤْمِنُونَ بِهِۦ ۖ وَقَدْ خَلَتْ سُنَّةُ ٱلْأَوَّلِينَ",
      "en": "they do not believe in it, and the precedent of the ancients has already passed.",
      "_n": 13
    },
    {
      "ar": "وَلَوْ فَتَحْنَا عَلَيْهِم بَابًا مِّنَ ٱلسَّمَآءِ فَظَلُّوا۟ فِيهِ يَعْرُجُونَ",
      "en": "Were We to open for them a gate of the sky, so that they could go on ascending through it,",
      "_n": 14
    },
    {
      "ar": "لَقَالُوٓا۟ إِنَّمَا سُكِّرَتْ أَبْصَـٰرُنَا بَلْ نَحْنُ قَوْمٌ مَّسْحُورُونَ",
      "en": "they would surely say, ‘Indeed a spell has been cast on our eyes; indeed, we are a bewitched lot.’",
      "_n": 15
    },
    {
      "ar": "وَلَقَدْ جَعَلْنَا فِى ٱلسَّمَآءِ بُرُوجًا وَزَيَّنَّـٰهَا لِلنَّـٰظِرِينَ",
      "en": "Certainly We have appointed houses in the sky and adorned them for the onlookers,",
      "_n": 16
    },
    {
      "ar": "وَحَفِظْنَـٰهَا مِن كُلِّ شَيْطَـٰنٍ رَّجِيمٍ",
      "en": "and We have guarded them from every outcast Satan,",
      "_n": 17
    },
    {
      "ar": "إِلَّا مَنِ ٱسْتَرَقَ ٱلسَّمْعَ فَأَتْبَعَهُۥ شِهَابٌ مُّبِينٌ",
      "en": "except someone who may eavesdrop, whereat there pursues him a manifest flame.",
      "_n": 18
    },
    {
      "ar": "وَٱلْأَرْضَ مَدَدْنَـٰهَا وَأَلْقَيْنَا فِيهَا رَوَٰسِىَ وَأَنۢبَتْنَا فِيهَا مِن كُلِّ شَىْءٍ مَّوْزُونٍ",
      "en": "And We spread out the earth, and cast in it firm mountains, and We grew in it every kind of balanced thing,",
      "_n": 19
    },
    {
      "ar": "وَجَعَلْنَا لَكُمْ فِيهَا مَعَـٰيِشَ وَمَن لَّسْتُمْ لَهُۥ بِرَٰزِقِينَ",
      "en": "and made in it [various] means of livelihood for you and for those whom you do not provide for.",
      "_n": 20
    },
    {
      "ar": "وَإِن مِّن شَىْءٍ إِلَّا عِندَنَا خَزَآئِنُهُۥ وَمَا نُنَزِّلُهُۥٓ إِلَّا بِقَدَرٍ مَّعْلُومٍ",
      "en": "There is not a thing but that its sources are with Us, and We do not send it down except in a known measure.",
      "_n": 21
    },
    {
      "ar": "وَأَرْسَلْنَا ٱلرِّيَـٰحَ لَوَٰقِحَ فَأَنزَلْنَا مِنَ ٱلسَّمَآءِ مَآءً فَأَسْقَيْنَـٰكُمُوهُ وَمَآ أَنتُمْ لَهُۥ بِخَـٰزِنِينَ",
      "en": "And We send the fertilizing winds and send down water from the sky providing it for you to drink and you are not maintainers of its resources.",
      "_n": 22
    },
    {
      "ar": "وَإِنَّا لَنَحْنُ نُحْىِۦ وَنُمِيتُ وَنَحْنُ ٱلْوَٰرِثُونَ",
      "en": "Indeed it is We who give life and bring death and We are the inheritors.",
      "_n": 23
    },
    {
      "ar": "وَلَقَدْ عَلِمْنَا ٱلْمُسْتَقْدِمِينَ مِنكُمْ وَلَقَدْ عَلِمْنَا ٱلْمُسْتَـْٔخِرِينَ",
      "en": "Certainly We know the predecessors among you and certainly We know the successors,",
      "_n": 24
    },
    {
      "ar": "وَإِنَّ رَبَّكَ هُوَ يَحْشُرُهُمْ ۚ إِنَّهُۥ حَكِيمٌ عَلِيمٌ",
      "en": "and indeed it is your Lord who will resurrect them. Indeed, He is all-wise, all-knowing.",
      "_n": 25
    },
    {
      "ar": "وَلَقَدْ خَلَقْنَا ٱلْإِنسَـٰنَ مِن صَلْصَـٰلٍ مِّنْ حَمَإٍ مَّسْنُونٍ",
      "en": "Certainly We created man out of a dry clay [drawn] from an aging mud,",
      "_n": 26
    },
    {
      "ar": "وَٱلْجَآنَّ خَلَقْنَـٰهُ مِن قَبْلُ مِن نَّارِ ٱلسَّمُومِ",
      "en": "and We created the jinn earlier, out of a piercing fire.",
      "_n": 27
    },
    {
      "ar": "وَإِذْ قَالَ رَبُّكَ لِلْمَلَـٰٓئِكَةِ إِنِّى خَـٰلِقٌۢ بَشَرًا مِّن صَلْصَـٰلٍ مِّنْ حَمَإٍ مَّسْنُونٍ",
      "en": "When your Lord said to the angels, ‘Indeed I am going to create a human out of a dry clay [drawn] from an aging mud.",
      "_n": 28
    },
    {
      "ar": "فَإِذَا سَوَّيْتُهُۥ وَنَفَخْتُ فِيهِ مِن رُّوحِى فَقَعُوا۟ لَهُۥ سَـٰجِدِينَ",
      "en": "So when I have proportioned him and breathed into him of My spirit, then fall down in prostration before him.’",
      "_n": 29
    },
    {
      "ar": "فَسَجَدَ ٱلْمَلَـٰٓئِكَةُ كُلُّهُمْ أَجْمَعُونَ",
      "en": "Thereat the angels prostrated, all of them together,",
      "_n": 30
    },
    {
      "ar": "إِلَّآ إِبْلِيسَ أَبَىٰٓ أَن يَكُونَ مَعَ ٱلسَّـٰجِدِينَ",
      "en": "but not Iblis: he refused to be among those who prostrated.",
      "_n": 31
    },
    {
      "ar": "قَالَ يَـٰٓإِبْلِيسُ مَا لَكَ أَلَّا تَكُونَ مَعَ ٱلسَّـٰجِدِينَ",
      "en": "He said, ‘O Iblis! What kept you from being among those who have prostrated?’",
      "_n": 32
    },
    {
      "ar": "قَالَ لَمْ أَكُن لِّأَسْجُدَ لِبَشَرٍ خَلَقْتَهُۥ مِن صَلْصَـٰلٍ مِّنْ حَمَإٍ مَّسْنُونٍ",
      "en": "Said he, ‘I will not prostrate before a human whom You have created out of a dry clay [drawn] from an aging mud.’",
      "_n": 33
    },
    {
      "ar": "قَالَ فَٱخْرُجْ مِنْهَا فَإِنَّكَ رَجِيمٌ",
      "en": "He said, ‘Begone hence, for you are indeed an outcast,",
      "_n": 34
    },
    {
      "ar": "وَإِنَّ عَلَيْكَ ٱللَّعْنَةَ إِلَىٰ يَوْمِ ٱلدِّينِ",
      "en": "and indeed the curse shall lie on you until the Day of Retribution.’",
      "_n": 35
    },
    {
      "ar": "قَالَ رَبِّ فَأَنظِرْنِىٓ إِلَىٰ يَوْمِ يُبْعَثُونَ",
      "en": "He said, ‘My Lord! Respite me till the day they will be resurrected.’",
      "_n": 36
    },
    {
      "ar": "قَالَ فَإِنَّكَ مِنَ ٱلْمُنظَرِينَ",
      "en": "Said He, ‘You are indeed among the reprieved",
      "_n": 37
    },
    {
      "ar": "إِلَىٰ يَوْمِ ٱلْوَقْتِ ٱلْمَعْلُومِ",
      "en": "until the day of the known time.’",
      "_n": 38
    },
    {
      "ar": "قَالَ رَبِّ بِمَآ أَغْوَيْتَنِى لَأُزَيِّنَنَّ لَهُمْ فِى ٱلْأَرْضِ وَلَأُغْوِيَنَّهُمْ أَجْمَعِينَ",
      "en": "He said, ‘My Lord! As You have consigned me to perversity, I will surely glamorize [evil] for them on the earth, and I will surely pervert them, all",
      "_n": 39
    },
    {
      "ar": "إِلَّا عِبَادَكَ مِنْهُمُ ٱلْمُخْلَصِينَ",
      "en": "except Your dedicated servants among them.’",
      "_n": 40
    },
    {
      "ar": "قَالَ هَـٰذَا صِرَٰطٌ عَلَىَّ مُسْتَقِيمٌ",
      "en": "He said, ‘This is the path [leading] straight to Me.",
      "_n": 41
    },
    {
      "ar": "إِنَّ عِبَادِى لَيْسَ لَكَ عَلَيْهِمْ سُلْطَـٰنٌ إِلَّا مَنِ ٱتَّبَعَكَ مِنَ ٱلْغَاوِينَ",
      "en": "Indeed, as for My servants you do not have any authority over them, except the perverse who follow you,",
      "_n": 42
    },
    {
      "ar": "وَإِنَّ جَهَنَّمَ لَمَوْعِدُهُمْ أَجْمَعِينَ",
      "en": "and indeed hell is the tryst of them all.",
      "_n": 43
    },
    {
      "ar": "لَهَا سَبْعَةُ أَبْوَٰبٍ لِّكُلِّ بَابٍ مِّنْهُمْ جُزْءٌ مَّقْسُومٌ",
      "en": "It has seven gates, and to each gate belongs a separate portion of them.’",
      "_n": 44
    },
    {
      "ar": "إِنَّ ٱلْمُتَّقِينَ فِى جَنَّـٰتٍ وَعُيُونٍ",
      "en": "Indeed the Godwary will be amid gardens and springs.",
      "_n": 45
    },
    {
      "ar": "ٱدْخُلُوهَا بِسَلَـٰمٍ ءَامِنِينَ",
      "en": "‘‘Enter it in peace and safety!’’",
      "_n": 46
    },
    {
      "ar": "وَنَزَعْنَا مَا فِى صُدُورِهِم مِّنْ غِلٍّ إِخْوَٰنًا عَلَىٰ سُرُرٍ مُّتَقَـٰبِلِينَ",
      "en": "We will remove whatever rancour there is in their breasts; [intimate like] brothers, [they will be reclining] on couches, facing one another.",
      "_n": 47
    },
    {
      "ar": "لَا يَمَسُّهُمْ فِيهَا نَصَبٌ وَمَا هُم مِّنْهَا بِمُخْرَجِينَ",
      "en": "Therein neither weariness shall touch them, nor will they [ever] be expelled from it.",
      "_n": 48
    },
    {
      "ar": "نَبِّئْ عِبَادِىٓ أَنِّىٓ أَنَا ٱلْغَفُورُ ٱلرَّحِيمُ",
      "en": "Inform my servants that I am indeed the All-forgiving, the All-merciful,",
      "_n": 49
    },
    {
      "ar": "وَأَنَّ عَذَابِى هُوَ ٱلْعَذَابُ ٱلْأَلِيمُ",
      "en": "and that My punishment is a painful punishment.",
      "_n": 50
    },
    {
      "ar": "وَنَبِّئْهُمْ عَن ضَيْفِ إِبْرَٰهِيمَ",
      "en": "And inform them about the guests of Abraham,",
      "_n": 51
    },
    {
      "ar": "إِذْ دَخَلُوا۟ عَلَيْهِ فَقَالُوا۟ سَلَـٰمًا قَالَ إِنَّا مِنكُمْ وَجِلُونَ",
      "en": "when they entered into his presence and said, ‘Peace!’ He said, ‘We are indeed afraid of you.’",
      "_n": 52
    },
    {
      "ar": "قَالُوا۟ لَا تَوْجَلْ إِنَّا نُبَشِّرُكَ بِغُلَـٰمٍ عَلِيمٍ",
      "en": "They said, ‘Do not be afraid. Indeed we give you the good news of a wise son.’",
      "_n": 53
    },
    {
      "ar": "قَالَ أَبَشَّرْتُمُونِى عَلَىٰٓ أَن مَّسَّنِىَ ٱلْكِبَرُ فَبِمَ تُبَشِّرُونَ",
      "en": "He said, ‘Do you give me good news though old age has befallen me? What is the good news that you bring me?’",
      "_n": 54
    },
    {
      "ar": "قَالُوا۟ بَشَّرْنَـٰكَ بِٱلْحَقِّ فَلَا تَكُن مِّنَ ٱلْقَـٰنِطِينَ",
      "en": "They said, ‘We bring you good news in truth; so do not be despondent.’",
      "_n": 55
    },
    {
      "ar": "قَالَ وَمَن يَقْنَطُ مِن رَّحْمَةِ رَبِّهِۦٓ إِلَّا ٱلضَّآلُّونَ",
      "en": "He said, ‘Who despairs of his Lord’s mercy except the astray?!’",
      "_n": 56
    },
    {
      "ar": "قَالَ فَمَا خَطْبُكُمْ أَيُّهَا ٱلْمُرْسَلُونَ",
      "en": "He said, ‘O messengers, what is now your errand?’",
      "_n": 57
    },
    {
      "ar": "قَالُوٓا۟ إِنَّآ أُرْسِلْنَآ إِلَىٰ قَوْمٍ مُّجْرِمِينَ",
      "en": "They said, ‘We have been sent toward a guilty people,",
      "_n": 58
    },
    {
      "ar": "إِلَّآ ءَالَ لُوطٍ إِنَّا لَمُنَجُّوهُمْ أَجْمَعِينَ",
      "en": "[who shall perish] except the family of Lot. We will indeed deliver all of them,",
      "_n": 59
    },
    {
      "ar": "إِلَّا ٱمْرَأَتَهُۥ قَدَّرْنَآ ۙ إِنَّهَا لَمِنَ ٱلْغَـٰبِرِينَ",
      "en": "except his wife, [who], We have ordained, will indeed be among those who remain behind.’",
      "_n": 60
    },
    {
      "ar": "فَلَمَّا جَآءَ ءَالَ لُوطٍ ٱلْمُرْسَلُونَ",
      "en": "So when the messengers came to Lot’s family,",
      "_n": 61
    },
    {
      "ar": "قَالَ إِنَّكُمْ قَوْمٌ مُّنكَرُونَ",
      "en": "he said, ‘You are indeed strangers [to me].’",
      "_n": 62
    },
    {
      "ar": "قَالُوا۟ بَلْ جِئْنَـٰكَ بِمَا كَانُوا۟ فِيهِ يَمْتَرُونَ",
      "en": "They said, ‘Indeed, we bring you what they used to doubt.",
      "_n": 63
    },
    {
      "ar": "وَأَتَيْنَـٰكَ بِٱلْحَقِّ وَإِنَّا لَصَـٰدِقُونَ",
      "en": "We bring you the truth, and indeed, we speak truly.",
      "_n": 64
    },
    {
      "ar": "فَأَسْرِ بِأَهْلِكَ بِقِطْعٍ مِّنَ ٱلَّيْلِ وَٱتَّبِعْ أَدْبَـٰرَهُمْ وَلَا يَلْتَفِتْ مِنكُمْ أَحَدٌ وَٱمْضُوا۟ حَيْثُ تُؤْمَرُونَ",
      "en": "Take your family in a watch of the night; and follow in their rear, and none of you should turn round, and proceed as you are bidden.’",
      "_n": 65
    },
    {
      "ar": "وَقَضَيْنَآ إِلَيْهِ ذَٰلِكَ ٱلْأَمْرَ أَنَّ دَابِرَ هَـٰٓؤُلَآءِ مَقْطُوعٌ مُّصْبِحِينَ",
      "en": "We apprised him of the matter that these will be rooted out by dawn.",
      "_n": 66
    },
    {
      "ar": "وَجَآءَ أَهْلُ ٱلْمَدِينَةِ يَسْتَبْشِرُونَ",
      "en": "The people of the city came, rejoicing.",
      "_n": 67
    },
    {
      "ar": "قَالَ إِنَّ هَـٰٓؤُلَآءِ ضَيْفِى فَلَا تَفْضَحُونِ",
      "en": "He said, ‘These are indeed my guests. Do not bring dishonour on me.",
      "_n": 68
    },
    {
      "ar": "وَٱتَّقُوا۟ ٱللَّهَ وَلَا تُخْزُونِ",
      "en": "Be wary of Allah and do not humiliate me.’",
      "_n": 69
    },
    {
      "ar": "قَالُوٓا۟ أَوَلَمْ نَنْهَكَ عَنِ ٱلْعَـٰلَمِينَ",
      "en": "They said, ‘Did we not forbid you from [defending ] strangers?’",
      "_n": 70
    },
    {
      "ar": "قَالَ هَـٰٓؤُلَآءِ بَنَاتِىٓ إِن كُنتُمْ فَـٰعِلِينَ",
      "en": "He said, ‘These are my daughters, [marry them] if you should do anything.’",
      "_n": 71
    },
    {
      "ar": "لَعَمْرُكَ إِنَّهُمْ لَفِى سَكْرَتِهِمْ يَعْمَهُونَ",
      "en": "By your life, they were bewildered in their drunkenness.",
      "_n": 72
    },
    {
      "ar": "فَأَخَذَتْهُمُ ٱلصَّيْحَةُ مُشْرِقِينَ",
      "en": "So the Cry seized them at sunrise,",
      "_n": 73
    },
    {
      "ar": "فَجَعَلْنَا عَـٰلِيَهَا سَافِلَهَا وَأَمْطَرْنَا عَلَيْهِمْ حِجَارَةً مِّن سِجِّيلٍ",
      "en": "and We made its topmost part its nethermost, and rained on them stones of shale.",
      "_n": 74
    },
    {
      "ar": "إِنَّ فِى ذَٰلِكَ لَـَٔايَـٰتٍ لِّلْمُتَوَسِّمِينَ",
      "en": "There are indeed signs in that for the percipient.",
      "_n": 75
    },
    {
      "ar": "وَإِنَّهَا لَبِسَبِيلٍ مُّقِيمٍ",
      "en": "Indeed it is on a standing road,",
      "_n": 76
    },
    {
      "ar": "إِنَّ فِى ذَٰلِكَ لَـَٔايَةً لِّلْمُؤْمِنِينَ",
      "en": "and there is indeed a sign in that for the faithful.",
      "_n": 77
    },
    {
      "ar": "وَإِن كَانَ أَصْحَـٰبُ ٱلْأَيْكَةِ لَظَـٰلِمِينَ",
      "en": "Indeed the inhabitants of Aykah were [also] wrongdoers.",
      "_n": 78
    },
    {
      "ar": "فَٱنتَقَمْنَا مِنْهُمْ وَإِنَّهُمَا لَبِإِمَامٍ مُّبِينٍ",
      "en": "So We took vengeance on them, and indeed the two of them are on an open highway.",
      "_n": 79
    },
    {
      "ar": "وَلَقَدْ كَذَّبَ أَصْحَـٰبُ ٱلْحِجْرِ ٱلْمُرْسَلِينَ",
      "en": "Certainly the inhabitants of Hijr denied the apostles.",
      "_n": 80
    },
    {
      "ar": "وَءَاتَيْنَـٰهُمْ ءَايَـٰتِنَا فَكَانُوا۟ عَنْهَا مُعْرِضِينَ",
      "en": "We had given them Our signs but they disregarded them.",
      "_n": 81
    },
    {
      "ar": "وَكَانُوا۟ يَنْحِتُونَ مِنَ ٱلْجِبَالِ بُيُوتًا ءَامِنِينَ",
      "en": "They used to hew out dwellings from mountains feeling secure.",
      "_n": 82
    },
    {
      "ar": "فَأَخَذَتْهُمُ ٱلصَّيْحَةُ مُصْبِحِينَ",
      "en": "So the Cry seized them at dawn,",
      "_n": 83
    },
    {
      "ar": "فَمَآ أَغْنَىٰ عَنْهُم مَّا كَانُوا۟ يَكْسِبُونَ",
      "en": "and what they used to earn did not avail them.",
      "_n": 84
    },
    {
      "ar": "وَمَا خَلَقْنَا ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ وَمَا بَيْنَهُمَآ إِلَّا بِٱلْحَقِّ ۗ وَإِنَّ ٱلسَّاعَةَ لَـَٔاتِيَةٌ ۖ فَٱصْفَحِ ٱلصَّفْحَ ٱلْجَمِيلَ",
      "en": "We did not create the heavens and the earth and whatever is between them except with consummate wisdom, and indeed the Hour is bound to come. So forbear with a graceful forbearance.",
      "_n": 85
    },
    {
      "ar": "إِنَّ رَبَّكَ هُوَ ٱلْخَلَّـٰقُ ٱلْعَلِيمُ",
      "en": "Indeed your Lord is the All-creator, the All-knowing.",
      "_n": 86
    },
    {
      "ar": "وَلَقَدْ ءَاتَيْنَـٰكَ سَبْعًا مِّنَ ٱلْمَثَانِى وَٱلْقُرْءَانَ ٱلْعَظِيمَ",
      "en": "Certainly We have given you [the surah of] the seven oft-repeated verses and the great Quran.",
      "_n": 87
    },
    {
      "ar": "لَا تَمُدَّنَّ عَيْنَيْكَ إِلَىٰ مَا مَتَّعْنَا بِهِۦٓ أَزْوَٰجًا مِّنْهُمْ وَلَا تَحْزَنْ عَلَيْهِمْ وَٱخْفِضْ جَنَاحَكَ لِلْمُؤْمِنِينَ",
      "en": "Do not extend your glance toward what We have provided to certain groups of them, and do not grieve for them, and lower your wing to the faithful,",
      "_n": 88
    },
    {
      "ar": "وَقُلْ إِنِّىٓ أَنَا ٱلنَّذِيرُ ٱلْمُبِينُ",
      "en": "and say, ‘I am indeed a manifest warner [of punishment from God],’",
      "_n": 89
    },
    {
      "ar": "كَمَآ أَنزَلْنَا عَلَى ٱلْمُقْتَسِمِينَ",
      "en": "like that We sent down upon those who split into bands,",
      "_n": 90
    },
    {
      "ar": "ٱلَّذِينَ جَعَلُوا۟ ٱلْقُرْءَانَ عِضِينَ",
      "en": "who represented the Quran as magic.",
      "_n": 91
    },
    {
      "ar": "فَوَرَبِّكَ لَنَسْـَٔلَنَّهُمْ أَجْمَعِينَ",
      "en": "By your Lord, We will question them all",
      "_n": 92
    },
    {
      "ar": "عَمَّا كَانُوا۟ يَعْمَلُونَ",
      "en": "concerning what they used to do.",
      "_n": 93
    },
    {
      "ar": "فَٱصْدَعْ بِمَا تُؤْمَرُ وَأَعْرِضْ عَنِ ٱلْمُشْرِكِينَ",
      "en": "So proclaim what you have been commanded, and turn away from the polytheists.",
      "_n": 94
    },
    {
      "ar": "إِنَّا كَفَيْنَـٰكَ ٱلْمُسْتَهْزِءِينَ",
      "en": "Indeed We will suffice you against the deriders",
      "_n": 95
    },
    {
      "ar": "ٱلَّذِينَ يَجْعَلُونَ مَعَ ٱللَّهِ إِلَـٰهًا ءَاخَرَ ۚ فَسَوْفَ يَعْلَمُونَ",
      "en": "—those who set up another deity besides Allah. Soon they will know!",
      "_n": 96
    },
    {
      "ar": "وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُونَ",
      "en": "Certainly We know that you become upset because of what they say.",
      "_n": 97
    },
    {
      "ar": "فَسَبِّحْ بِحَمْدِ رَبِّكَ وَكُن مِّنَ ٱلسَّـٰجِدِينَ",
      "en": "So celebrate the praise of your Lord and be among those who prostrate,",
      "_n": 98
    },
    {
      "ar": "وَٱعْبُدْ رَبَّكَ حَتَّىٰ يَأْتِيَكَ ٱلْيَقِينُ",
      "en": "and worship your Lord until certainty comes to you.",
      "_n": 99
    }
  ],
  "_n": 15,
  "_c": 99
}