{
  "ar": "طه",
  "en": "Taa-Haa",
  "_a": "Taa-Haa",
  "_l": "Meccan",
  "_v": [
    {
      "ar": "طه",
      "en": "Ta Ha!",
      "_n": 1
    },
    {
      "ar": "مَآ أَنزَلْنَا عَلَيْكَ ٱلْقُرْءَانَ لِتَشْقَىٰٓ",
      "en": "We did not send down to you the Quran that you should be miserable,",
      "_n": 2
    },
    {
      "ar": "إِلَّا تَذْكِرَةً لِّمَن يَخْشَىٰ",
      "en": "but only as an admonition to him who fears [his Lord].",
      "_n": 3
    },
    {
      "ar": "تَنزِيلًا مِّمَّنْ خَلَقَ ٱلْأَرْضَ وَٱلسَّمَـٰوَٰتِ ٱلْعُلَى",
      "en": "A sending down [of the Revelation] from Him who created the earth and the lofty heavens",
      "_n": 4
    },
    {
      "ar": "ٱلرَّحْمَـٰنُ عَلَى ٱلْعَرْشِ ٱسْتَوَىٰ",
      "en": "—the All-beneficent, settled on the Throne.",
      "_n": 5
    },
    {
      "ar": "لَهُۥ مَا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ وَمَا بَيْنَهُمَا وَمَا تَحْتَ ٱلثَّرَىٰ",
      "en": "To Him belongs whatever is in the heavens and whatever is on the earth, and whatever is between them, and whatever is under the ground.",
      "_n": 6
    },
    {
      "ar": "وَإِن تَجْهَرْ بِٱلْقَوْلِ فَإِنَّهُۥ يَعْلَمُ ٱلسِّرَّ وَأَخْفَى",
      "en": "Whether you speak loudly [or in secret tones,] He indeed knows the secret and what is still more hidden.",
      "_n": 7
    },
    {
      "ar": "ٱللَّهُ لَآ إِلَـٰهَ إِلَّا هُوَ ۖ لَهُ ٱلْأَسْمَآءُ ٱلْحُسْنَىٰ",
      "en": "Allah—there is no god except Him—to Him belong the Best Names.",
      "_n": 8
    },
    {
      "ar": "وَهَلْ أَتَىٰكَ حَدِيثُ مُوسَىٰٓ",
      "en": "Did the story of Moses come to you,",
      "_n": 9
    },
    {
      "ar": "إِذْ رَءَا نَارًا فَقَالَ لِأَهْلِهِ ٱمْكُثُوٓا۟ إِنِّىٓ ءَانَسْتُ نَارًا لَّعَلِّىٓ ءَاتِيكُم مِّنْهَا بِقَبَسٍ أَوْ أَجِدُ عَلَى ٱلنَّارِ هُدًى",
      "en": "when he sighted a fire, and said to his family, ‘Wait! Indeed, I descry a fire! Maybe I will bring you a brand from it, or find some guidance at the fire.’",
      "_n": 10
    },
    {
      "ar": "فَلَمَّآ أَتَىٰهَا نُودِىَ يَـٰمُوسَىٰٓ",
      "en": "So when he came to it, he was called, ‘O Moses!",
      "_n": 11
    },
    {
      "ar": "إِنِّىٓ أَنَا۠ رَبُّكَ فَٱخْلَعْ نَعْلَيْكَ ۖ إِنَّكَ بِٱلْوَادِ ٱلْمُقَدَّسِ طُوًى",
      "en": "Indeed I am your Lord! So take off your sandals. You are indeed in the sacred valley of Tuwa.",
      "_n": 12
    },
    {
      "ar": "وَأَنَا ٱخْتَرْتُكَ فَٱسْتَمِعْ لِمَا يُوحَىٰٓ",
      "en": "I have chosen you; so listen to what is revealed.",
      "_n": 13
    },
    {
      "ar": "إِنَّنِىٓ أَنَا ٱللَّهُ لَآ إِلَـٰهَ إِلَّآ أَنَا۠ فَٱعْبُدْنِى وَأَقِمِ ٱلصَّلَوٰةَ لِذِكْرِىٓ",
      "en": "Indeed I am Allah—there is no god except Me. So worship Me, and maintain the prayer for My remembrance.",
      "_n": 14
    },
    {
      "ar": "إِنَّ ٱلسَّاعَةَ ءَاتِيَةٌ أَكَادُ أُخْفِيهَا لِتُجْزَىٰ كُلُّ نَفْسٍۭ بِمَا تَسْعَىٰ",
      "en": "Indeed the Hour is bound to come: I will have it hidden, so that every soul may be rewarded for its endeavour.",
      "_n": 15
    },
    {
      "ar": "فَلَا يَصُدَّنَّكَ عَنْهَا مَن لَّا يُؤْمِنُ بِهَا وَٱتَّبَعَ هَوَىٰهُ فَتَرْدَىٰ",
      "en": "So do not let yourself be distracted from it by those who do not believe in it and who follow their desires, or you will perish.’",
      "_n": 16
    },
    {
      "ar": "وَمَا تِلْكَ بِيَمِينِكَ يَـٰمُوسَىٰ",
      "en": "‘Moses, what is that in your right hand?’",
      "_n": 17
    },
    {
      "ar": "قَالَ هِىَ عَصَاىَ أَتَوَكَّؤُا۟ عَلَيْهَا وَأَهُشُّ بِهَا عَلَىٰ غَنَمِى وَلِىَ فِيهَا مَـَٔارِبُ أُخْرَىٰ",
      "en": "He said, ‘It is my staff. I lean on it, and with it I beat down leaves for my sheep; and I have other uses for it.’",
      "_n": 18
    },
    {
      "ar": "قَالَ أَلْقِهَا يَـٰمُوسَىٰ",
      "en": "He said, ‘Moses, throw it down.’",
      "_n": 19
    },
    {
      "ar": "فَأَلْقَىٰهَا فَإِذَا هِىَ حَيَّةٌ تَسْعَىٰ",
      "en": "So he threw it down, and behold, it was a snake, moving swiftly.",
      "_n": 20
    },
    {
      "ar": "قَالَ خُذْهَا وَلَا تَخَفْ ۖ سَنُعِيدُهَا سِيرَتَهَا ٱلْأُولَىٰ",
      "en": "He said, ‘Take hold of it, and do not fear. We will restore it to its former state.",
      "_n": 21
    },
    {
      "ar": "وَٱضْمُمْ يَدَكَ إِلَىٰ جَنَاحِكَ تَخْرُجْ بَيْضَآءَ مِنْ غَيْرِ سُوٓءٍ ءَايَةً أُخْرَىٰ",
      "en": "Now clasp your hand to your armpit: it will emerge white, without any harm—[this is yet] another sign,",
      "_n": 22
    },
    {
      "ar": "لِنُرِيَكَ مِنْ ءَايَـٰتِنَا ٱلْكُبْرَى",
      "en": "that We may show you some of Our great signs.",
      "_n": 23
    },
    {
      "ar": "ٱذْهَبْ إِلَىٰ فِرْعَوْنَ إِنَّهُۥ طَغَىٰ",
      "en": "Go to Pharaoh. He has indeed rebelled.’",
      "_n": 24
    },
    {
      "ar": "قَالَ رَبِّ ٱشْرَحْ لِى صَدْرِى",
      "en": "He said, ‘My Lord! Open my breast for me.",
      "_n": 25
    },
    {
      "ar": "وَيَسِّرْ لِىٓ أَمْرِى",
      "en": "Make my task easy for me.",
      "_n": 26
    },
    {
      "ar": "وَٱحْلُلْ عُقْدَةً مِّن لِّسَانِى",
      "en": "Remove the hitch from my tongue,",
      "_n": 27
    },
    {
      "ar": "يَفْقَهُوا۟ قَوْلِى",
      "en": "[so that] they may understand my speech.",
      "_n": 28
    },
    {
      "ar": "وَٱجْعَل لِّى وَزِيرًا مِّنْ أَهْلِى",
      "en": "Appoint for me a minister from my family,",
      "_n": 29
    },
    {
      "ar": "هَـٰرُونَ أَخِى",
      "en": "Aaron, my brother.",
      "_n": 30
    },
    {
      "ar": "ٱشْدُدْ بِهِۦٓ أَزْرِى",
      "en": "Strengthen my back through him,",
      "_n": 31
    },
    {
      "ar": "وَأَشْرِكْهُ فِىٓ أَمْرِى",
      "en": "and make him my associate in my task,",
      "_n": 32
    },
    {
      "ar": "كَىْ نُسَبِّحَكَ كَثِيرًا",
      "en": "so that we may glorify You greatly,",
      "_n": 33
    },
    {
      "ar": "وَنَذْكُرَكَ كَثِيرًا",
      "en": "and remember You greatly.",
      "_n": 34
    },
    {
      "ar": "إِنَّكَ كُنتَ بِنَا بَصِيرًا",
      "en": "Indeed You see us best.’",
      "_n": 35
    },
    {
      "ar": "قَالَ قَدْ أُوتِيتَ سُؤْلَكَ يَـٰمُوسَىٰ",
      "en": "He said, ‘Moses, your request has been granted!",
      "_n": 36
    },
    {
      "ar": "وَلَقَدْ مَنَنَّا عَلَيْكَ مَرَّةً أُخْرَىٰٓ",
      "en": "Certainly, We have done you a favour another time,",
      "_n": 37
    },
    {
      "ar": "إِذْ أَوْحَيْنَآ إِلَىٰٓ أُمِّكَ مَا يُوحَىٰٓ",
      "en": "when We revealed to your mother whatever was to be revealed:",
      "_n": 38
    },
    {
      "ar": "أَنِ ٱقْذِفِيهِ فِى ٱلتَّابُوتِ فَٱقْذِفِيهِ فِى ٱلْيَمِّ فَلْيُلْقِهِ ٱلْيَمُّ بِٱلسَّاحِلِ يَأْخُذْهُ عَدُوٌّ لِّى وَعَدُوٌّ لَّهُۥ ۚ وَأَلْقَيْتُ عَلَيْكَ مَحَبَّةً مِّنِّى وَلِتُصْنَعَ عَلَىٰ عَيْنِىٓ",
      "en": "“Put him in the casket, and cast it into the river. Then the river will cast it on the bank, and he shall be picked up by an enemy of Mine and an enemy of his.” And I made you endearing, and that you might be reared under My [watchful] eyes.",
      "_n": 39
    },
    {
      "ar": "إِذْ تَمْشِىٓ أُخْتُكَ فَتَقُولُ هَلْ أَدُلُّكُمْ عَلَىٰ مَن يَكْفُلُهُۥ ۖ فَرَجَعْنَـٰكَ إِلَىٰٓ أُمِّكَ كَىْ تَقَرَّ عَيْنُهَا وَلَا تَحْزَنَ ۚ وَقَتَلْتَ نَفْسًا فَنَجَّيْنَـٰكَ مِنَ ٱلْغَمِّ وَفَتَنَّـٰكَ فُتُونًا ۚ فَلَبِثْتَ سِنِينَ فِىٓ أَهْلِ مَدْيَنَ ثُمَّ جِئْتَ عَلَىٰ قَدَرٍ يَـٰمُوسَىٰ",
      "en": "When your sister walked up [to Pharaoh’s palace] saying, “Shall I show you someone who will take care of him?” Then We restored you to your mother, that she might not grieve and be comforted. Then you slew a soul, whereupon We delivered you from anguish, and We tried you with various ordeals. Then you stayed for several years among the people of Midian. Then you turned up as ordained, O Moses!",
      "_n": 40
    },
    {
      "ar": "وَٱصْطَنَعْتُكَ لِنَفْسِى",
      "en": "And I chose you for Myself.’",
      "_n": 41
    },
    {
      "ar": "ٱذْهَبْ أَنتَ وَأَخُوكَ بِـَٔايَـٰتِى وَلَا تَنِيَا فِى ذِكْرِى",
      "en": "‘Go ahead, you and your brother, with My signs and do not flag in My remembrance.",
      "_n": 42
    },
    {
      "ar": "ٱذْهَبَآ إِلَىٰ فِرْعَوْنَ إِنَّهُۥ طَغَىٰ",
      "en": "Both of you go to Pharaoh, for he has indeed rebelled.",
      "_n": 43
    },
    {
      "ar": "فَقُولَا لَهُۥ قَوْلًا لَّيِّنًا لَّعَلَّهُۥ يَتَذَكَّرُ أَوْ يَخْشَىٰ",
      "en": "Speak to him in a soft manner; maybe he will take admonition or fear.’",
      "_n": 44
    },
    {
      "ar": "قَالَا رَبَّنَآ إِنَّنَا نَخَافُ أَن يَفْرُطَ عَلَيْنَآ أَوْ أَن يَطْغَىٰ",
      "en": "They said, ‘Our Lord! We are indeed afraid that he will forestall us or will exceed all bounds.’",
      "_n": 45
    },
    {
      "ar": "قَالَ لَا تَخَافَآ ۖ إِنَّنِى مَعَكُمَآ أَسْمَعُ وَأَرَىٰ",
      "en": "He said, ‘Do not be afraid, for I will be with the two of you, hearing and seeing [whatever happens].",
      "_n": 46
    },
    {
      "ar": "فَأْتِيَاهُ فَقُولَآ إِنَّا رَسُولَا رَبِّكَ فَأَرْسِلْ مَعَنَا بَنِىٓ إِسْرَٰٓءِيلَ وَلَا تُعَذِّبْهُمْ ۖ قَدْ جِئْنَـٰكَ بِـَٔايَةٍ مِّن رَّبِّكَ ۖ وَٱلسَّلَـٰمُ عَلَىٰ مَنِ ٱتَّبَعَ ٱلْهُدَىٰٓ",
      "en": "So approach him and say, ‘‘We are the apostles of your Lord. Let the Children of Israel go with us, and do not torture them! We certainly bring you a sign from your Lord, and may peace be upon him who follows guidance!",
      "_n": 47
    },
    {
      "ar": "إِنَّا قَدْ أُوحِىَ إِلَيْنَآ أَنَّ ٱلْعَذَابَ عَلَىٰ مَن كَذَّبَ وَتَوَلَّىٰ",
      "en": "Indeed it has been revealed to us that punishment shall befall those who impugn us and turn their backs [on us].’’ ’",
      "_n": 48
    },
    {
      "ar": "قَالَ فَمَن رَّبُّكُمَا يَـٰمُوسَىٰ",
      "en": "He said, ‘Who is your Lord, Moses?’",
      "_n": 49
    },
    {
      "ar": "قَالَ رَبُّنَا ٱلَّذِىٓ أَعْطَىٰ كُلَّ شَىْءٍ خَلْقَهُۥ ثُمَّ هَدَىٰ",
      "en": "He said, ‘Our Lord is He who gave everything its creation and then guided it.’",
      "_n": 50
    },
    {
      "ar": "قَالَ فَمَا بَالُ ٱلْقُرُونِ ٱلْأُولَىٰ",
      "en": "He said, ‘What about the former generations?’",
      "_n": 51
    },
    {
      "ar": "قَالَ عِلْمُهَا عِندَ رَبِّى فِى كِتَـٰبٍ ۖ لَّا يَضِلُّ رَبِّى وَلَا يَنسَى",
      "en": "He said, ‘Their knowledge is with my Lord, in a Book. My Lord neither makes any error nor forgets.’",
      "_n": 52
    },
    {
      "ar": "ٱلَّذِى جَعَلَ لَكُمُ ٱلْأَرْضَ مَهْدًا وَسَلَكَ لَكُمْ فِيهَا سُبُلًا وَأَنزَلَ مِنَ ٱلسَّمَآءِ مَآءً فَأَخْرَجْنَا بِهِۦٓ أَزْوَٰجًا مِّن نَّبَاتٍ شَتَّىٰ",
      "en": "He, who made the earth for you a cradle, and in it threaded for you ways, and sent down water from the sky, and with it We brought forth various kinds of vegetation.",
      "_n": 53
    },
    {
      "ar": "كُلُوا۟ وَٱرْعَوْا۟ أَنْعَـٰمَكُمْ ۗ إِنَّ فِى ذَٰلِكَ لَـَٔايَـٰتٍ لِّأُو۟لِى ٱلنُّهَىٰ",
      "en": "‘Eat and pasture your cattle.’ There are indeed signs in that for those who have sense.",
      "_n": 54
    },
    {
      "ar": "مِنْهَا خَلَقْنَـٰكُمْ وَفِيهَا نُعِيدُكُمْ وَمِنْهَا نُخْرِجُكُمْ تَارَةً أُخْرَىٰ",
      "en": "From it did We create you, into it shall We return you, and from it shall We bring you forth another time.",
      "_n": 55
    },
    {
      "ar": "وَلَقَدْ أَرَيْنَـٰهُ ءَايَـٰتِنَا كُلَّهَا فَكَذَّبَ وَأَبَىٰ",
      "en": "Certainly We showed him all Our signs. But he denied [them] and refused [to believe them].",
      "_n": 56
    },
    {
      "ar": "قَالَ أَجِئْتَنَا لِتُخْرِجَنَا مِنْ أَرْضِنَا بِسِحْرِكَ يَـٰمُوسَىٰ",
      "en": "He said, ‘Moses, have you come to us to expel us from our land with your magic?",
      "_n": 57
    },
    {
      "ar": "فَلَنَأْتِيَنَّكَ بِسِحْرٍ مِّثْلِهِۦ فَٱجْعَلْ بَيْنَنَا وَبَيْنَكَ مَوْعِدًا لَّا نُخْلِفُهُۥ نَحْنُ وَلَآ أَنتَ مَكَانًا سُوًى",
      "en": "Yet we [too] will bring you a magic like it! So fix a tryst between us and you, which neither we shall fail nor you, at a middle place.’",
      "_n": 58
    },
    {
      "ar": "قَالَ مَوْعِدُكُمْ يَوْمُ ٱلزِّينَةِ وَأَن يُحْشَرَ ٱلنَّاسُ ضُحًى",
      "en": "He said, ‘Your tryst shall be the Day of Adornment, and let the people be assembled in early forenoon.’",
      "_n": 59
    },
    {
      "ar": "فَتَوَلَّىٰ فِرْعَوْنُ فَجَمَعَ كَيْدَهُۥ ثُمَّ أَتَىٰ",
      "en": "Then Pharaoh withdrew [to consult privately], summoned up his guile, and then arrived [at the scene of the contest].",
      "_n": 60
    },
    {
      "ar": "قَالَ لَهُم مُّوسَىٰ وَيْلَكُمْ لَا تَفْتَرُوا۟ عَلَى ٱللَّهِ كَذِبًا فَيُسْحِتَكُم بِعَذَابٍ ۖ وَقَدْ خَابَ مَنِ ٱفْتَرَىٰ",
      "en": "Moses said to them, ‘Woe to you! Do not fabricate lies against Allah, or He will obliterate you with a punishment. Whoever fabricates lies certainly fails.’",
      "_n": 61
    },
    {
      "ar": "فَتَنَـٰزَعُوٓا۟ أَمْرَهُم بَيْنَهُمْ وَأَسَرُّوا۟ ٱلنَّجْوَىٰ",
      "en": "So they disputed their matter among themselves, and kept their confidential talks secret.",
      "_n": 62
    },
    {
      "ar": "قَالُوٓا۟ إِنْ هَـٰذَٰنِ لَسَـٰحِرَٰنِ يُرِيدَانِ أَن يُخْرِجَاكُم مِّنْ أَرْضِكُم بِسِحْرِهِمَا وَيَذْهَبَا بِطَرِيقَتِكُمُ ٱلْمُثْلَىٰ",
      "en": "They said, ‘These two are indeed magicians who intend to expel you from your land with their magic, and to abolish your excellent tradition!",
      "_n": 63
    },
    {
      "ar": "فَأَجْمِعُوا۟ كَيْدَكُمْ ثُمَّ ٱئْتُوا۟ صَفًّا ۚ وَقَدْ أَفْلَحَ ٱلْيَوْمَ مَنِ ٱسْتَعْلَىٰ",
      "en": "So summon up your ingenuity, then come in ranks. Today he who has the upper hand will be felicitous!’",
      "_n": 64
    },
    {
      "ar": "قَالُوا۟ يَـٰمُوسَىٰٓ إِمَّآ أَن تُلْقِىَ وَإِمَّآ أَن نَّكُونَ أَوَّلَ مَنْ أَلْقَىٰ",
      "en": "They said, ‘O Moses! Will you throw first, or shall we?’",
      "_n": 65
    },
    {
      "ar": "قَالَ بَلْ أَلْقُوا۟ ۖ فَإِذَا حِبَالُهُمْ وَعِصِيُّهُمْ يُخَيَّلُ إِلَيْهِ مِن سِحْرِهِمْ أَنَّهَا تَسْعَىٰ",
      "en": "He said, ‘No, you throw first.’ Thereupon, behold, their ropes and staffs appeared to him by their magic to wriggle swiftly.",
      "_n": 66
    },
    {
      "ar": "فَأَوْجَسَ فِى نَفْسِهِۦ خِيفَةً مُّوسَىٰ",
      "en": "Then Moses felt a fear within his heart.",
      "_n": 67
    },
    {
      "ar": "قُلْنَا لَا تَخَفْ إِنَّكَ أَنتَ ٱلْأَعْلَىٰ",
      "en": "We said, ‘Do not be afraid. Indeed, you will have the upper hand.",
      "_n": 68
    },
    {
      "ar": "وَأَلْقِ مَا فِى يَمِينِكَ تَلْقَفْ مَا صَنَعُوٓا۟ ۖ إِنَّمَا صَنَعُوا۟ كَيْدُ سَـٰحِرٍ ۖ وَلَا يُفْلِحُ ٱلسَّاحِرُ حَيْثُ أَتَىٰ",
      "en": "Throw down what is in your right hand, and it will swallow what they have conjured. What they have conjured is only a magician’s trick, and the magician does not fare well wherever he may show up.’",
      "_n": 69
    },
    {
      "ar": "فَأُلْقِىَ ٱلسَّحَرَةُ سُجَّدًا قَالُوٓا۟ ءَامَنَّا بِرَبِّ هَـٰرُونَ وَمُوسَىٰ",
      "en": "Thereat the magicians fell down prostrating. They said, ‘We have believed in the Lord of Aaron and Moses!’",
      "_n": 70
    },
    {
      "ar": "قَالَ ءَامَنتُمْ لَهُۥ قَبْلَ أَنْ ءَاذَنَ لَكُمْ ۖ إِنَّهُۥ لَكَبِيرُكُمُ ٱلَّذِى عَلَّمَكُمُ ٱلسِّحْرَ ۖ فَلَأُقَطِّعَنَّ أَيْدِيَكُمْ وَأَرْجُلَكُم مِّنْ خِلَـٰفٍ وَلَأُصَلِّبَنَّكُمْ فِى جُذُوعِ ٱلنَّخْلِ وَلَتَعْلَمُنَّ أَيُّنَآ أَشَدُّ عَذَابًا وَأَبْقَىٰ",
      "en": "He said, ‘Did you believe in him before I should permit you? He is indeed your chief who has taught you magic! Surely, I will cut off your hands and feet from opposite sides, and I will crucify you on the trunks of palm trees, and you will know which of us can inflict a severer and more lasting punishment.’",
      "_n": 71
    },
    {
      "ar": "قَالُوا۟ لَن نُّؤْثِرَكَ عَلَىٰ مَا جَآءَنَا مِنَ ٱلْبَيِّنَـٰتِ وَٱلَّذِى فَطَرَنَا ۖ فَٱقْضِ مَآ أَنتَ قَاضٍ ۖ إِنَّمَا تَقْضِى هَـٰذِهِ ٱلْحَيَوٰةَ ٱلدُّنْيَآ",
      "en": "They said, ‘We will never prefer you to the clear proofs which have come to us, and to Him who originated us. Decide whatever you want to decide. You can only decide about the life of this world.",
      "_n": 72
    },
    {
      "ar": "إِنَّآ ءَامَنَّا بِرَبِّنَا لِيَغْفِرَ لَنَا خَطَـٰيَـٰنَا وَمَآ أَكْرَهْتَنَا عَلَيْهِ مِنَ ٱلسِّحْرِ ۗ وَٱللَّهُ خَيْرٌ وَأَبْقَىٰٓ",
      "en": "We have indeed believed in our Lord that He may forgive us our offences and the magic you compelled us to perform. Allah is better and more lasting.’",
      "_n": 73
    },
    {
      "ar": "إِنَّهُۥ مَن يَأْتِ رَبَّهُۥ مُجْرِمًا فَإِنَّ لَهُۥ جَهَنَّمَ لَا يَمُوتُ فِيهَا وَلَا يَحْيَىٰ",
      "en": "Whoever comes to his Lord laden with guilt, for him shall be hell, where he will neither live nor die.",
      "_n": 74
    },
    {
      "ar": "وَمَن يَأْتِهِۦ مُؤْمِنًا قَدْ عَمِلَ ٱلصَّـٰلِحَـٰتِ فَأُو۟لَـٰٓئِكَ لَهُمُ ٱلدَّرَجَـٰتُ ٱلْعُلَىٰ",
      "en": "But whoever comes to Him with faith and he has done righteous deeds, for such shall be the highest ranks",
      "_n": 75
    },
    {
      "ar": "جَنَّـٰتُ عَدْنٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَا ۚ وَذَٰلِكَ جَزَآءُ مَن تَزَكَّىٰ",
      "en": "—the Gardens of Eden, with streams running in them, to abide in them [forever], and that is the reward of him who keeps pure.",
      "_n": 76
    },
    {
      "ar": "وَلَقَدْ أَوْحَيْنَآ إِلَىٰ مُوسَىٰٓ أَنْ أَسْرِ بِعِبَادِى فَٱضْرِبْ لَهُمْ طَرِيقًا فِى ٱلْبَحْرِ يَبَسًا لَّا تَخَـٰفُ دَرَكًا وَلَا تَخْشَىٰ",
      "en": "We revealed to Moses, [saying], ‘Set out with My servants at night, and strike out for them a dry path through the sea. Do not be afraid of being overtaken, and have no fear [of getting drowned].",
      "_n": 77
    },
    {
      "ar": "فَأَتْبَعَهُمْ فِرْعَوْنُ بِجُنُودِهِۦ فَغَشِيَهُم مِّنَ ٱلْيَمِّ مَا غَشِيَهُمْ",
      "en": "Then Pharaoh pursued them with his troops, whereat they were engulfed by what engulfed them of the sea.",
      "_n": 78
    },
    {
      "ar": "وَأَضَلَّ فِرْعَوْنُ قَوْمَهُۥ وَمَا هَدَىٰ",
      "en": "Pharaoh led his people astray and did not guide them.",
      "_n": 79
    },
    {
      "ar": "يَـٰبَنِىٓ إِسْرَٰٓءِيلَ قَدْ أَنجَيْنَـٰكُم مِّنْ عَدُوِّكُمْ وَوَٰعَدْنَـٰكُمْ جَانِبَ ٱلطُّورِ ٱلْأَيْمَنَ وَنَزَّلْنَا عَلَيْكُمُ ٱلْمَنَّ وَٱلسَّلْوَىٰ",
      "en": "O Children of Israel! We delivered you from your enemy, and We appointed with you a tryst on the right side of the Mount and We sent down to you manna and quails:",
      "_n": 80
    },
    {
      "ar": "كُلُوا۟ مِن طَيِّبَـٰتِ مَا رَزَقْنَـٰكُمْ وَلَا تَطْغَوْا۟ فِيهِ فَيَحِلَّ عَلَيْكُمْ غَضَبِى ۖ وَمَن يَحْلِلْ عَلَيْهِ غَضَبِى فَقَدْ هَوَىٰ",
      "en": "‘Eat of the good things We have provided you, but do not overstep the bounds therein, lest My wrath should descend on you, and he on whom My wrath descends certainly perishes.",
      "_n": 81
    },
    {
      "ar": "وَإِنِّى لَغَفَّارٌ لِّمَن تَابَ وَءَامَنَ وَعَمِلَ صَـٰلِحًا ثُمَّ ٱهْتَدَىٰ",
      "en": "Indeed I forgive those who repent, become faithful, act righteously, and follow guidance.’",
      "_n": 82
    },
    {
      "ar": "وَمَآ أَعْجَلَكَ عَن قَوْمِكَ يَـٰمُوسَىٰ",
      "en": "[God said,] ‘O Moses, what has prompted you to hasten ahead of your people?’",
      "_n": 83
    },
    {
      "ar": "قَالَ هُمْ أُو۟لَآءِ عَلَىٰٓ أَثَرِى وَعَجِلْتُ إِلَيْكَ رَبِّ لِتَرْضَىٰ",
      "en": "He said, ‘They are close upon my heels, and I hurried on to You, my Lord, that You may be pleased.’",
      "_n": 84
    },
    {
      "ar": "قَالَ فَإِنَّا قَدْ فَتَنَّا قَوْمَكَ مِنۢ بَعْدِكَ وَأَضَلَّهُمُ ٱلسَّامِرِىُّ",
      "en": "He said, ‘Indeed We tried your people in your absence, and the Samiri has led them astray.’",
      "_n": 85
    },
    {
      "ar": "فَرَجَعَ مُوسَىٰٓ إِلَىٰ قَوْمِهِۦ غَضْبَـٰنَ أَسِفًا ۚ قَالَ يَـٰقَوْمِ أَلَمْ يَعِدْكُمْ رَبُّكُمْ وَعْدًا حَسَنًا ۚ أَفَطَالَ عَلَيْكُمُ ٱلْعَهْدُ أَمْ أَرَدتُّمْ أَن يَحِلَّ عَلَيْكُمْ غَضَبٌ مِّن رَّبِّكُمْ فَأَخْلَفْتُم مَّوْعِدِى",
      "en": "Thereupon Moses returned to his people, indignant and grieved. He said, ‘O my people! Did your Lord not give you a true promise? Did the period [of my absence] seem too long to you? Or did you desire that your Lord’s wrath should descend on you and so you failed your tryst with me?’",
      "_n": 86
    },
    {
      "ar": "قَالُوا۟ مَآ أَخْلَفْنَا مَوْعِدَكَ بِمَلْكِنَا وَلَـٰكِنَّا حُمِّلْنَآ أَوْزَارًا مِّن زِينَةِ ٱلْقَوْمِ فَقَذَفْنَـٰهَا فَكَذَٰلِكَ أَلْقَى ٱلسَّامِرِىُّ",
      "en": "They said, ‘We did not fail our tryst with you of our own accord, but we were laden with the weight of those people’s ornaments, and we cast them [into the fire] and so did the Samiri.’",
      "_n": 87
    },
    {
      "ar": "فَأَخْرَجَ لَهُمْ عِجْلًا جَسَدًا لَّهُۥ خُوَارٌ فَقَالُوا۟ هَـٰذَآ إِلَـٰهُكُمْ وَإِلَـٰهُ مُوسَىٰ فَنَسِىَ",
      "en": "Then he produced for them a calf—a [lifeless] body with a low—and they said, This is your god and the god of Moses, so he forgot!",
      "_n": 88
    },
    {
      "ar": "أَفَلَا يَرَوْنَ أَلَّا يَرْجِعُ إِلَيْهِمْ قَوْلًا وَلَا يَمْلِكُ لَهُمْ ضَرًّا وَلَا نَفْعًا",
      "en": "Did they not see that it did not answer them, nor could it bring them any benefit or harm?",
      "_n": 89
    },
    {
      "ar": "وَلَقَدْ قَالَ لَهُمْ هَـٰرُونُ مِن قَبْلُ يَـٰقَوْمِ إِنَّمَا فُتِنتُم بِهِۦ ۖ وَإِنَّ رَبَّكُمُ ٱلرَّحْمَـٰنُ فَٱتَّبِعُونِى وَأَطِيعُوٓا۟ أَمْرِى",
      "en": "Aaron had certainly told them earlier, ‘O my people! You are only being tested by it. Indeed your Lord is the All-beneficent. So follow me and obey my command!’",
      "_n": 90
    },
    {
      "ar": "قَالُوا۟ لَن نَّبْرَحَ عَلَيْهِ عَـٰكِفِينَ حَتَّىٰ يَرْجِعَ إِلَيْنَا مُوسَىٰ",
      "en": "They had said, ‘We will keep on clinging to it until Moses returns to us.’",
      "_n": 91
    },
    {
      "ar": "قَالَ يَـٰهَـٰرُونُ مَا مَنَعَكَ إِذْ رَأَيْتَهُمْ ضَلُّوٓا۟",
      "en": "He said, ‘O Aaron! What kept you, when you saw them going astray,",
      "_n": 92
    },
    {
      "ar": "أَلَّا تَتَّبِعَنِ ۖ أَفَعَصَيْتَ أَمْرِى",
      "en": "from following me? Did you disobey my command?’",
      "_n": 93
    },
    {
      "ar": "قَالَ يَبْنَؤُمَّ لَا تَأْخُذْ بِلِحْيَتِى وَلَا بِرَأْسِىٓ ۖ إِنِّى خَشِيتُ أَن تَقُولَ فَرَّقْتَ بَيْنَ بَنِىٓ إِسْرَٰٓءِيلَ وَلَمْ تَرْقُبْ قَوْلِى",
      "en": "He said, ‘O son of my mother! Do not grab my beard or my head! I feared lest you should say, ‘‘You have caused a rift among the Children of Israel and did not heed my word [of advice].’’’",
      "_n": 94
    },
    {
      "ar": "قَالَ فَمَا خَطْبُكَ يَـٰسَـٰمِرِىُّ",
      "en": "He said, ‘What is your business, O Samiri?’",
      "_n": 95
    },
    {
      "ar": "قَالَ بَصُرْتُ بِمَا لَمْ يَبْصُرُوا۟ بِهِۦ فَقَبَضْتُ قَبْضَةً مِّنْ أَثَرِ ٱلرَّسُولِ فَنَبَذْتُهَا وَكَذَٰلِكَ سَوَّلَتْ لِى نَفْسِى",
      "en": "He said, ‘I saw what they did not see. I took a handful [of dust] from the messenger’s trail and threw it. That is how my soul prompted me.’",
      "_n": 96
    },
    {
      "ar": "قَالَ فَٱذْهَبْ فَإِنَّ لَكَ فِى ٱلْحَيَوٰةِ أَن تَقُولَ لَا مِسَاسَ ۖ وَإِنَّ لَكَ مَوْعِدًا لَّن تُخْلَفَهُۥ ۖ وَٱنظُرْ إِلَىٰٓ إِلَـٰهِكَ ٱلَّذِى ظَلْتَ عَلَيْهِ عَاكِفًا ۖ لَّنُحَرِّقَنَّهُۥ ثُمَّ لَنَنسِفَنَّهُۥ فِى ٱلْيَمِّ نَسْفًا",
      "en": "He said, ‘Begone! It shall be your [lot] throughout life to say, ‘‘Do not touch me!’’ Indeed, there is a tryst for you which you will not fail to keep! Now look at your god to whom you went on clinging. We will burn it down and then scatter it[s ashes] into the sea.",
      "_n": 97
    },
    {
      "ar": "إِنَّمَآ إِلَـٰهُكُمُ ٱللَّهُ ٱلَّذِى لَآ إِلَـٰهَ إِلَّا هُوَ ۚ وَسِعَ كُلَّ شَىْءٍ عِلْمًا",
      "en": "Indeed your God is Allah. There is no god except Him. He embraces all things in [His] knowledge.’",
      "_n": 98
    },
    {
      "ar": "كَذَٰلِكَ نَقُصُّ عَلَيْكَ مِنْ أَنۢبَآءِ مَا قَدْ سَبَقَ ۚ وَقَدْ ءَاتَيْنَـٰكَ مِن لَّدُنَّا ذِكْرًا",
      "en": "Thus do We relate to you some accounts of what is past. Certainly, We have given you a Reminder from Ourselves.",
      "_n": 99
    },
    {
      "ar": "مَّنْ أَعْرَضَ عَنْهُ فَإِنَّهُۥ يَحْمِلُ يَوْمَ ٱلْقِيَـٰمَةِ وِزْرًا",
      "en": "Whoever disregards it shall bear a burden [of punishment] on the Day of Resurrection,",
      "_n": 100
    },
    {
      "ar": "خَـٰلِدِينَ فِيهِ ۖ وَسَآءَ لَهُمْ يَوْمَ ٱلْقِيَـٰمَةِ حِمْلًا",
      "en": "remaining in it [forever]. Evil is their burden on the Day of Resurrection",
      "_n": 101
    },
    {
      "ar": "يَوْمَ يُنفَخُ فِى ٱلصُّورِ ۚ وَنَحْشُرُ ٱلْمُجْرِمِينَ يَوْمَئِذٍ زُرْقًا",
      "en": "—the day the Trumpet will be blown; on that day We shall muster the guilty with blind eyes.",
      "_n": 102
    },
    {
      "ar": "يَتَخَـٰفَتُونَ بَيْنَهُمْ إِن لَّبِثْتُمْ إِلَّا عَشْرًا",
      "en": "They will whisper to one another: ‘You have stayed only for ten [days].’",
      "_n": 103
    },
    {
      "ar": "نَّحْنُ أَعْلَمُ بِمَا يَقُولُونَ إِذْ يَقُولُ أَمْثَلُهُمْ طَرِيقَةً إِن لَّبِثْتُمْ إِلَّا يَوْمًا",
      "en": "We know best what they will say, when the smartest of them in approach will say, ‘You stayed only a day!’",
      "_n": 104
    },
    {
      "ar": "وَيَسْـَٔلُونَكَ عَنِ ٱلْجِبَالِ فَقُلْ يَنسِفُهَا رَبِّى نَسْفًا",
      "en": "They question you concerning the mountains. Say, ‘My Lord will scatter them [like dust].’",
      "_n": 105
    },
    {
      "ar": "فَيَذَرُهَا قَاعًا صَفْصَفًا",
      "en": "Then He will leave it a level plain.",
      "_n": 106
    },
    {
      "ar": "لَّا تَرَىٰ فِيهَا عِوَجًا وَلَآ أَمْتًا",
      "en": "You will not see any crookedness or unevenness in it.",
      "_n": 107
    },
    {
      "ar": "يَوْمَئِذٍ يَتَّبِعُونَ ٱلدَّاعِىَ لَا عِوَجَ لَهُۥ ۖ وَخَشَعَتِ ٱلْأَصْوَاتُ لِلرَّحْمَـٰنِ فَلَا تَسْمَعُ إِلَّا هَمْسًا",
      "en": "On that day they will follow the summoner without zigzagging. Their voices will be muted before the All-beneficent, and you will hear nothing but a murmur.",
      "_n": 108
    },
    {
      "ar": "يَوْمَئِذٍ لَّا تَنفَعُ ٱلشَّفَـٰعَةُ إِلَّا مَنْ أَذِنَ لَهُ ٱلرَّحْمَـٰنُ وَرَضِىَ لَهُۥ قَوْلًا",
      "en": "Intercession will not avail that day except from him whom the All-beneficent allows and approves of his word.",
      "_n": 109
    },
    {
      "ar": "يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِهِۦ عِلْمًا",
      "en": "He knows what is before them and behind them, though they do not comprehend Him in their knowledge.",
      "_n": 110
    },
    {
      "ar": "وَعَنَتِ ٱلْوُجُوهُ لِلْحَىِّ ٱلْقَيُّومِ ۖ وَقَدْ خَابَ مَنْ حَمَلَ ظُلْمًا",
      "en": "All faces shall be humbled before the Living One, the All-sustainer, and those who bear [the burden of] wrongdoing will fail.",
      "_n": 111
    },
    {
      "ar": "وَمَن يَعْمَلْ مِنَ ٱلصَّـٰلِحَـٰتِ وَهُوَ مُؤْمِنٌ فَلَا يَخَافُ ظُلْمًا وَلَا هَضْمًا",
      "en": "But whoever does righteous deeds, being faithful, will neither fear any injustice or disparagement.",
      "_n": 112
    },
    {
      "ar": "وَكَذَٰلِكَ أَنزَلْنَـٰهُ قُرْءَانًا عَرَبِيًّا وَصَرَّفْنَا فِيهِ مِنَ ٱلْوَعِيدِ لَعَلَّهُمْ يَتَّقُونَ أَوْ يُحْدِثُ لَهُمْ ذِكْرًا",
      "en": "Thus We have sent it down as an Arabic Quran and We have paraphrased the warnings in it variously so that they may be Godwary, or it may prompt them to remembrance.",
      "_n": 113
    },
    {
      "ar": "فَتَعَـٰلَى ٱللَّهُ ٱلْمَلِكُ ٱلْحَقُّ ۗ وَلَا تَعْجَلْ بِٱلْقُرْءَانِ مِن قَبْلِ أَن يُقْضَىٰٓ إِلَيْكَ وَحْيُهُۥ ۖ وَقُل رَّبِّ زِدْنِى عِلْمًا",
      "en": "So exalted is Allah, the True Sovereign. Do not hasten with the Quran before its revelation is completed for you, and say, ‘My Lord! Increase me in knowledge.’",
      "_n": 114
    },
    {
      "ar": "وَلَقَدْ عَهِدْنَآ إِلَىٰٓ ءَادَمَ مِن قَبْلُ فَنَسِىَ وَلَمْ نَجِدْ لَهُۥ عَزْمًا",
      "en": "Certainly We had enjoined Adam earlier; but he forgot, and We did not find any resoluteness in him.",
      "_n": 115
    },
    {
      "ar": "وَإِذْ قُلْنَا لِلْمَلَـٰٓئِكَةِ ٱسْجُدُوا۟ لِـَٔادَمَ فَسَجَدُوٓا۟ إِلَّآ إِبْلِيسَ أَبَىٰ",
      "en": "When We said to the angels, ‘Prostrate before Adam,’ they prostrated, but not Iblis: he refused.",
      "_n": 116
    },
    {
      "ar": "فَقُلْنَا يَـٰٓـَٔادَمُ إِنَّ هَـٰذَا عَدُوٌّ لَّكَ وَلِزَوْجِكَ فَلَا يُخْرِجَنَّكُمَا مِنَ ٱلْجَنَّةِ فَتَشْقَىٰٓ",
      "en": "We said, ‘O Adam! This is indeed an enemy of yours and your mate’s. So do not let him expel you from paradise, or you will be miserable.",
      "_n": 117
    },
    {
      "ar": "إِنَّ لَكَ أَلَّا تَجُوعَ فِيهَا وَلَا تَعْرَىٰ",
      "en": "You will neither be hungry in it nor naked.",
      "_n": 118
    },
    {
      "ar": "وَأَنَّكَ لَا تَظْمَؤُا۟ فِيهَا وَلَا تَضْحَىٰ",
      "en": "You will neither be thirsty in it, nor suffer from [the heat of] the sun.’",
      "_n": 119
    },
    {
      "ar": "فَوَسْوَسَ إِلَيْهِ ٱلشَّيْطَـٰنُ قَالَ يَـٰٓـَٔادَمُ هَلْ أَدُلُّكَ عَلَىٰ شَجَرَةِ ٱلْخُلْدِ وَمُلْكٍ لَّا يَبْلَىٰ",
      "en": "Then Satan tempted him. He said, ‘O Adam! Shall I show you the tree of immortality, and an imperishable kingdom?’",
      "_n": 120
    },
    {
      "ar": "فَأَكَلَا مِنْهَا فَبَدَتْ لَهُمَا سَوْءَٰتُهُمَا وَطَفِقَا يَخْصِفَانِ عَلَيْهِمَا مِن وَرَقِ ٱلْجَنَّةِ ۚ وَعَصَىٰٓ ءَادَمُ رَبَّهُۥ فَغَوَىٰ",
      "en": "So they both ate of it, and their nakedness became evident to them, and they began to stitch over themselves with the leaves of paradise. Adam disobeyed his Lord, and went amiss.",
      "_n": 121
    },
    {
      "ar": "ثُمَّ ٱجْتَبَـٰهُ رَبُّهُۥ فَتَابَ عَلَيْهِ وَهَدَىٰ",
      "en": "Then his Lord chose him, and turned to him clemently, and guided him.",
      "_n": 122
    },
    {
      "ar": "قَالَ ٱهْبِطَا مِنْهَا جَمِيعًۢا ۖ بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ ۖ فَإِمَّا يَأْتِيَنَّكُم مِّنِّى هُدًى فَمَنِ ٱتَّبَعَ هُدَاىَ فَلَا يَضِلُّ وَلَا يَشْقَىٰ",
      "en": "He said, ‘Get down both of you from it, all together, being enemies of one another! Yet, should any guidance come to you from Me, those who follow My guidance will not go astray, nor will they be miserable.",
      "_n": 123
    },
    {
      "ar": "وَمَنْ أَعْرَضَ عَن ذِكْرِى فَإِنَّ لَهُۥ مَعِيشَةً ضَنكًا وَنَحْشُرُهُۥ يَوْمَ ٱلْقِيَـٰمَةِ أَعْمَىٰ",
      "en": "But whoever disregards My remembrance, his shall be a wretched life, and We shall raise him blind on the Day of Resurrection.’",
      "_n": 124
    },
    {
      "ar": "قَالَ رَبِّ لِمَ حَشَرْتَنِىٓ أَعْمَىٰ وَقَدْ كُنتُ بَصِيرًا",
      "en": "He will say, ‘My Lord! Why have You raised me blind, though I used to see?’",
      "_n": 125
    },
    {
      "ar": "قَالَ كَذَٰلِكَ أَتَتْكَ ءَايَـٰتُنَا فَنَسِيتَهَا ۖ وَكَذَٰلِكَ ٱلْيَوْمَ تُنسَىٰ",
      "en": "He will say: ‘So it is. Our signs came to you, but you forgot them, and so you will be forgotten today.’",
      "_n": 126
    },
    {
      "ar": "وَكَذَٰلِكَ نَجْزِى مَنْ أَسْرَفَ وَلَمْ يُؤْمِنۢ بِـَٔايَـٰتِ رَبِّهِۦ ۚ وَلَعَذَابُ ٱلْـَٔاخِرَةِ أَشَدُّ وَأَبْقَىٰٓ",
      "en": "Thus do We requite those who transgress and do not believe in the signs of their Lord, and the punishment of the Hereafter is severer and more lasting.",
      "_n": 127
    },
    {
      "ar": "أَفَلَمْ يَهْدِ لَهُمْ كَمْ أَهْلَكْنَا قَبْلَهُم مِّنَ ٱلْقُرُونِ يَمْشُونَ فِى مَسَـٰكِنِهِمْ ۗ إِنَّ فِى ذَٰلِكَ لَـَٔايَـٰتٍ لِّأُو۟لِى ٱلنُّهَىٰ",
      "en": "Does it not dawn upon them how many generations We have destroyed before them, amid [the ruins of] whose dwellings they walk? There are indeed signs in this for those who have reason.",
      "_n": 128
    },
    {
      "ar": "وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِن رَّبِّكَ لَكَانَ لِزَامًا وَأَجَلٌ مُّسَمًّى",
      "en": "Were it not for a prior decree of your Lord and a specified time, [their doom] would have attended [their guilt].",
      "_n": 129
    },
    {
      "ar": "فَٱصْبِرْ عَلَىٰ مَا يَقُولُونَ وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ ٱلشَّمْسِ وَقَبْلَ غُرُوبِهَا ۖ وَمِنْ ءَانَآئِ ٱلَّيْلِ فَسَبِّحْ وَأَطْرَافَ ٱلنَّهَارِ لَعَلَّكَ تَرْضَىٰ",
      "en": "So be patient with what they say, and celebrate the praise of your Lord before the rising of the sun and before the sunset, and glorify Him in watches of the night and at the day’s ends, that you may be pleased.",
      "_n": 130
    },
    {
      "ar": "وَلَا تَمُدَّنَّ عَيْنَيْكَ إِلَىٰ مَا مَتَّعْنَا بِهِۦٓ أَزْوَٰجًا مِّنْهُمْ زَهْرَةَ ٱلْحَيَوٰةِ ٱلدُّنْيَا لِنَفْتِنَهُمْ فِيهِ ۚ وَرِزْقُ رَبِّكَ خَيْرٌ وَأَبْقَىٰ",
      "en": "Do not extend your glance toward what We have provided certain groups of them as a glitter of the life of this world, so that We may test them thereby. The provision of your Lord is better and more lasting.",
      "_n": 131
    },
    {
      "ar": "وَأْمُرْ أَهْلَكَ بِٱلصَّلَوٰةِ وَٱصْطَبِرْ عَلَيْهَا ۖ لَا نَسْـَٔلُكَ رِزْقًا ۖ نَّحْنُ نَرْزُقُكَ ۗ وَٱلْعَـٰقِبَةُ لِلتَّقْوَىٰ",
      "en": "And bid your family to prayer and be steadfast in maintaining it. We do not ask any provision of you: it is We who provide for you, and to Godwariness belongs the ultimate outcome [in the Hereafter].",
      "_n": 132
    },
    {
      "ar": "وَقَالُوا۟ لَوْلَا يَأْتِينَا بِـَٔايَةٍ مِّن رَّبِّهِۦٓ ۚ أَوَلَمْ تَأْتِهِم بَيِّنَةُ مَا فِى ٱلصُّحُفِ ٱلْأُولَىٰ",
      "en": "They say, ‘Why does he not bring us a sign from his Lord?’ Has there not come to them a clear proof in that which is in the former scriptures?",
      "_n": 133
    },
    {
      "ar": "وَلَوْ أَنَّآ أَهْلَكْنَـٰهُم بِعَذَابٍ مِّن قَبْلِهِۦ لَقَالُوا۟ رَبَّنَا لَوْلَآ أَرْسَلْتَ إِلَيْنَا رَسُولًا فَنَتَّبِعَ ءَايَـٰتِكَ مِن قَبْلِ أَن نَّذِلَّ وَنَخْزَىٰ",
      "en": "Had We destroyed them with a punishment before it, they would have surely said, ‘Our Lord! Why did You not send us an apostle so that we might have followed Your signs before we were abased and disgraced?’",
      "_n": 134
    },
    {
      "ar": "قُلْ كُلٌّ مُّتَرَبِّصٌ فَتَرَبَّصُوا۟ ۖ فَسَتَعْلَمُونَ مَنْ أَصْحَـٰبُ ٱلصِّرَٰطِ ٱلسَّوِىِّ وَمَنِ ٱهْتَدَىٰ",
      "en": "Say, ‘Everyone [of us] is waiting. So wait! Soon you will know who are the people of the right path, and who is [rightly] guided.’",
      "_n": 135
    }
  ],
  "_n": 20,
  "_c": 135
}