{
  "ar": "الأنبياء",
  "en": "The Prophets",
  "_a": "Al-Anbiyaa",
  "_l": "Meccan",
  "_v": [
    {
      "ar": "ٱقْتَرَبَ لِلنَّاسِ حِسَابُهُمْ وَهُمْ فِى غَفْلَةٍ مُّعْرِضُونَ",
      "en": "Mankind’s reckoning has drawn near to them, yet they are disregardful in [their] obliviousness.",
      "_n": 1
    },
    {
      "ar": "مَا يَأْتِيهِم مِّن ذِكْرٍ مِّن رَّبِّهِم مُّحْدَثٍ إِلَّا ٱسْتَمَعُوهُ وَهُمْ يَلْعَبُونَ",
      "en": "There does not come to them any new reminder from their Lord but they listen to it as they play around,",
      "_n": 2
    },
    {
      "ar": "لَاهِيَةً قُلُوبُهُمْ ۗ وَأَسَرُّوا۟ ٱلنَّجْوَى ٱلَّذِينَ ظَلَمُوا۟ هَلْ هَـٰذَآ إِلَّا بَشَرٌ مِّثْلُكُمْ ۖ أَفَتَأْتُونَ ٱلسِّحْرَ وَأَنتُمْ تُبْصِرُونَ",
      "en": "their hearts set on diversions. The wrongdoers secretly whisper together, [saying], ‘Is this [man] not a human being like yourselves? Will you give in to magic with open eyes?’",
      "_n": 3
    },
    {
      "ar": "قَالَ رَبِّى يَعْلَمُ ٱلْقَوْلَ فِى ٱلسَّمَآءِ وَٱلْأَرْضِ ۖ وَهُوَ ٱلسَّمِيعُ ٱلْعَلِيمُ",
      "en": "He said, ‘My Lord knows every word [spoken] in the sky and on the earth, and He is the All-hearing, the All-knowing.’",
      "_n": 4
    },
    {
      "ar": "بَلْ قَالُوٓا۟ أَضْغَـٰثُ أَحْلَـٰمٍۭ بَلِ ٱفْتَرَىٰهُ بَلْ هُوَ شَاعِرٌ فَلْيَأْتِنَا بِـَٔايَةٍ كَمَآ أُرْسِلَ ٱلْأَوَّلُونَ",
      "en": "But they said, ‘[They are] muddled dreams!’ ‘Indeed, he has fabricated it!’ ‘Indeed, he is a poet!’ ‘Let him bring us a sign, like those sent to the former generations.’",
      "_n": 5
    },
    {
      "ar": "مَآ ءَامَنَتْ قَبْلَهُم مِّن قَرْيَةٍ أَهْلَكْنَـٰهَآ ۖ أَفَهُمْ يُؤْمِنُونَ",
      "en": "No town that We destroyed before them believed. Will these then have faith [if they are sent signs]?",
      "_n": 6
    },
    {
      "ar": "وَمَآ أَرْسَلْنَا قَبْلَكَ إِلَّا رِجَالًا نُّوحِىٓ إِلَيْهِمْ ۖ فَسْـَٔلُوٓا۟ أَهْلَ ٱلذِّكْرِ إِن كُنتُمْ لَا تَعْلَمُونَ",
      "en": "We did not send [any apostles] before you except as men to whom We revealed. Ask the People of the Reminder if you do not know.",
      "_n": 7
    },
    {
      "ar": "وَمَا جَعَلْنَـٰهُمْ جَسَدًا لَّا يَأْكُلُونَ ٱلطَّعَامَ وَمَا كَانُوا۟ خَـٰلِدِينَ",
      "en": "We did not make them bodies that did not eat food, nor were they immortal.",
      "_n": 8
    },
    {
      "ar": "ثُمَّ صَدَقْنَـٰهُمُ ٱلْوَعْدَ فَأَنجَيْنَـٰهُمْ وَمَن نَّشَآءُ وَأَهْلَكْنَا ٱلْمُسْرِفِينَ",
      "en": "Then We fulfilled Our promise to them, and We delivered them and whomever We wished, and We destroyed the transgressors.",
      "_n": 9
    },
    {
      "ar": "لَقَدْ أَنزَلْنَآ إِلَيْكُمْ كِتَـٰبًا فِيهِ ذِكْرُكُمْ ۖ أَفَلَا تَعْقِلُونَ",
      "en": "Certainly We have sent down to you a Book in which there is an admonition for you. Do you not exercise your reason?",
      "_n": 10
    },
    {
      "ar": "وَكَمْ قَصَمْنَا مِن قَرْيَةٍ كَانَتْ ظَالِمَةً وَأَنشَأْنَا بَعْدَهَا قَوْمًا ءَاخَرِينَ",
      "en": "How many a town We have smashed that had been wrongdoing, and We brought forth another people after it.",
      "_n": 11
    },
    {
      "ar": "فَلَمَّآ أَحَسُّوا۟ بَأْسَنَآ إِذَا هُم مِّنْهَا يَرْكُضُونَ",
      "en": "So when they sighted Our punishment, behold, they ran away from it.",
      "_n": 12
    },
    {
      "ar": "لَا تَرْكُضُوا۟ وَٱرْجِعُوٓا۟ إِلَىٰ مَآ أُتْرِفْتُمْ فِيهِ وَمَسَـٰكِنِكُمْ لَعَلَّكُمْ تُسْـَٔلُونَ",
      "en": "‘Do not run away! Return to the opulence you were given to enjoy and to your dwellings so that you may be questioned!’",
      "_n": 13
    },
    {
      "ar": "قَالُوا۟ يَـٰوَيْلَنَآ إِنَّا كُنَّا ظَـٰلِمِينَ",
      "en": "They said, ‘Woe to us! We have indeed been wrongdoers!’",
      "_n": 14
    },
    {
      "ar": "فَمَا زَالَت تِّلْكَ دَعْوَىٰهُمْ حَتَّىٰ جَعَلْنَـٰهُمْ حَصِيدًا خَـٰمِدِينَ",
      "en": "That remained their cry until We turned them into a mown field, stilled [like burnt ashes].",
      "_n": 15
    },
    {
      "ar": "وَمَا خَلَقْنَا ٱلسَّمَآءَ وَٱلْأَرْضَ وَمَا بَيْنَهُمَا لَـٰعِبِينَ",
      "en": "We did not create the sky and the earth and whatever is between them for play.",
      "_n": 16
    },
    {
      "ar": "لَوْ أَرَدْنَآ أَن نَّتَّخِذَ لَهْوًا لَّٱتَّخَذْنَـٰهُ مِن لَّدُنَّآ إِن كُنَّا فَـٰعِلِينَ",
      "en": "Had We desired to take up some diversion We would have taken it up with Ourselves, were We to do [so].",
      "_n": 17
    },
    {
      "ar": "بَلْ نَقْذِفُ بِٱلْحَقِّ عَلَى ٱلْبَـٰطِلِ فَيَدْمَغُهُۥ فَإِذَا هُوَ زَاهِقٌ ۚ وَلَكُمُ ٱلْوَيْلُ مِمَّا تَصِفُونَ",
      "en": "Indeed, We hurl the truth against falsehood, and it crushes its head, and behold, falsehood vanishes! And woe to you for what you allege [about Allah].",
      "_n": 18
    },
    {
      "ar": "وَلَهُۥ مَن فِى ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۚ وَمَنْ عِندَهُۥ لَا يَسْتَكْبِرُونَ عَنْ عِبَادَتِهِۦ وَلَا يَسْتَحْسِرُونَ",
      "en": "To Him belongs whatever is in the heavens and the earth, and those who are near Him do not disdain to worship Him, nor do they become weary.",
      "_n": 19
    },
    {
      "ar": "يُسَبِّحُونَ ٱلَّيْلَ وَٱلنَّهَارَ لَا يَفْتُرُونَ",
      "en": "They glorify [Him] night and day, and they do not flag.",
      "_n": 20
    },
    {
      "ar": "أَمِ ٱتَّخَذُوٓا۟ ءَالِهَةً مِّنَ ٱلْأَرْضِ هُمْ يُنشِرُونَ",
      "en": "Have they taken gods from the earth who raise [the dead]?",
      "_n": 21
    },
    {
      "ar": "لَوْ كَانَ فِيهِمَآ ءَالِهَةٌ إِلَّا ٱللَّهُ لَفَسَدَتَا ۚ فَسُبْحَـٰنَ ٱللَّهِ رَبِّ ٱلْعَرْشِ عَمَّا يَصِفُونَ",
      "en": "Had there been any gods in them other than Allah, they would surely have fallen apart. Clear is Allah, the Lord of the Throne, of what they allege [concerning Him].",
      "_n": 22
    },
    {
      "ar": "لَا يُسْـَٔلُ عَمَّا يَفْعَلُ وَهُمْ يُسْـَٔلُونَ",
      "en": "He is not questioned concerning what He does, but they are questioned.",
      "_n": 23
    },
    {
      "ar": "أَمِ ٱتَّخَذُوا۟ مِن دُونِهِۦٓ ءَالِهَةً ۖ قُلْ هَاتُوا۟ بُرْهَـٰنَكُمْ ۖ هَـٰذَا ذِكْرُ مَن مَّعِىَ وَذِكْرُ مَن قَبْلِى ۗ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ ٱلْحَقَّ ۖ فَهُم مُّعْرِضُونَ",
      "en": "Have they taken gods besides Him? Say, ‘Produce your evidence! This is a precept of those who are with me, and a precept of those [who went] before me.’ But most of them do not know the truth, and so they are disregardful.",
      "_n": 24
    },
    {
      "ar": "وَمَآ أَرْسَلْنَا مِن قَبْلِكَ مِن رَّسُولٍ إِلَّا نُوحِىٓ إِلَيْهِ أَنَّهُۥ لَآ إِلَـٰهَ إِلَّآ أَنَا۠ فَٱعْبُدُونِ",
      "en": "We did not send any apostle before you but that We revealed to him that ‘There is no god except Me; so worship Me.’",
      "_n": 25
    },
    {
      "ar": "وَقَالُوا۟ ٱتَّخَذَ ٱلرَّحْمَـٰنُ وَلَدًا ۗ سُبْحَـٰنَهُۥ ۚ بَلْ عِبَادٌ مُّكْرَمُونَ",
      "en": "They say, ‘The All-beneficent has taken offsprings.’ Immaculate is He! Indeed, they are [His] honoured servants.",
      "_n": 26
    },
    {
      "ar": "لَا يَسْبِقُونَهُۥ بِٱلْقَوْلِ وَهُم بِأَمْرِهِۦ يَعْمَلُونَ",
      "en": "They do not venture to speak ahead of Him, and they act by His command.",
      "_n": 27
    },
    {
      "ar": "يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يَشْفَعُونَ إِلَّا لِمَنِ ٱرْتَضَىٰ وَهُم مِّنْ خَشْيَتِهِۦ مُشْفِقُونَ",
      "en": "He knows that which is before them and that which is behind them, and they do not intercede except for someone He approves of, and they are apprehensive for the fear of Him.",
      "_n": 28
    },
    {
      "ar": "وَمَن يَقُلْ مِنْهُمْ إِنِّىٓ إِلَـٰهٌ مِّن دُونِهِۦ فَذَٰلِكَ نَجْزِيهِ جَهَنَّمَ ۚ كَذَٰلِكَ نَجْزِى ٱلظَّـٰلِمِينَ",
      "en": "Should any of them say, ‘I am a god besides Him,’ We will requite him with hell. Thus do We requite the wrongdoers.",
      "_n": 29
    },
    {
      "ar": "أَوَلَمْ يَرَ ٱلَّذِينَ كَفَرُوٓا۟ أَنَّ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ كَانَتَا رَتْقًا فَفَتَقْنَـٰهُمَا ۖ وَجَعَلْنَا مِنَ ٱلْمَآءِ كُلَّ شَىْءٍ حَىٍّ ۖ أَفَلَا يُؤْمِنُونَ",
      "en": "Have the faithless not regarded that the heavens and the earth were interwoven and We unravelled them, and We made every living thing out of water? Will they not then have faith?",
      "_n": 30
    },
    {
      "ar": "وَجَعَلْنَا فِى ٱلْأَرْضِ رَوَٰسِىَ أَن تَمِيدَ بِهِمْ وَجَعَلْنَا فِيهَا فِجَاجًا سُبُلًا لَّعَلَّهُمْ يَهْتَدُونَ",
      "en": "We set firm mountains in the earth lest it should shake with them, and We made broad ways in them so that they may be guided [to their destinations].",
      "_n": 31
    },
    {
      "ar": "وَجَعَلْنَا ٱلسَّمَآءَ سَقْفًا مَّحْفُوظًا ۖ وَهُمْ عَنْ ءَايَـٰتِهَا مُعْرِضُونَ",
      "en": "We made the sky a preserved roof and yet they are disregardful of its signs.",
      "_n": 32
    },
    {
      "ar": "وَهُوَ ٱلَّذِى خَلَقَ ٱلَّيْلَ وَٱلنَّهَارَ وَٱلشَّمْسَ وَٱلْقَمَرَ ۖ كُلٌّ فِى فَلَكٍ يَسْبَحُونَ",
      "en": "It is He who created the night and the day, the sun and the moon, each swimming in an orbit.",
      "_n": 33
    },
    {
      "ar": "وَمَا جَعَلْنَا لِبَشَرٍ مِّن قَبْلِكَ ٱلْخُلْدَ ۖ أَفَإِي۟ن مِّتَّ فَهُمُ ٱلْخَـٰلِدُونَ",
      "en": "We did not give immortality to any human before you. If you are fated to die, will they live on forever?",
      "_n": 34
    },
    {
      "ar": "كُلُّ نَفْسٍ ذَآئِقَةُ ٱلْمَوْتِ ۗ وَنَبْلُوكُم بِٱلشَّرِّ وَٱلْخَيْرِ فِتْنَةً ۖ وَإِلَيْنَا تُرْجَعُونَ",
      "en": "Every soul shall taste death, and We will test you with good and ill by way of test, and to Us you will be brought back.",
      "_n": 35
    },
    {
      "ar": "وَإِذَا رَءَاكَ ٱلَّذِينَ كَفَرُوٓا۟ إِن يَتَّخِذُونَكَ إِلَّا هُزُوًا أَهَـٰذَا ٱلَّذِى يَذْكُرُ ءَالِهَتَكُمْ وَهُم بِذِكْرِ ٱلرَّحْمَـٰنِ هُمْ كَـٰفِرُونَ",
      "en": "Whenever the faithless see you they only take you in derision: ‘Is this the one who remembers your gods?’ while they remain defiant towards the remembrance of the All-beneficent.",
      "_n": 36
    },
    {
      "ar": "خُلِقَ ٱلْإِنسَـٰنُ مِنْ عَجَلٍ ۚ سَأُو۟رِيكُمْ ءَايَـٰتِى فَلَا تَسْتَعْجِلُونِ",
      "en": "Man is a creature of haste. Soon I will show you My signs. So do not ask Me to hasten.",
      "_n": 37
    },
    {
      "ar": "وَيَقُولُونَ مَتَىٰ هَـٰذَا ٱلْوَعْدُ إِن كُنتُمْ صَـٰدِقِينَ",
      "en": "And they say, ‘When will this promise be fulfilled, if you are truthful?’",
      "_n": 38
    },
    {
      "ar": "لَوْ يَعْلَمُ ٱلَّذِينَ كَفَرُوا۟ حِينَ لَا يَكُفُّونَ عَن وُجُوهِهِمُ ٱلنَّارَ وَلَا عَن ظُهُورِهِمْ وَلَا هُمْ يُنصَرُونَ",
      "en": "If only the faithless knew about the time when they will not be able to keep the Fire off their faces and their backs, nor will they be helped!",
      "_n": 39
    },
    {
      "ar": "بَلْ تَأْتِيهِم بَغْتَةً فَتَبْهَتُهُمْ فَلَا يَسْتَطِيعُونَ رَدَّهَا وَلَا هُمْ يُنظَرُونَ",
      "en": "Indeed, it will overtake them suddenly, dumbfounding them. So they will neither be able to avert it, nor will they be granted any respite.",
      "_n": 40
    },
    {
      "ar": "وَلَقَدِ ٱسْتُهْزِئَ بِرُسُلٍ مِّن قَبْلِكَ فَحَاقَ بِٱلَّذِينَ سَخِرُوا۟ مِنْهُم مَّا كَانُوا۟ بِهِۦ يَسْتَهْزِءُونَ",
      "en": "Apostles were certainly derided before you; but those who ridiculed them were besieged by what they had been deriding.",
      "_n": 41
    },
    {
      "ar": "قُلْ مَن يَكْلَؤُكُم بِٱلَّيْلِ وَٱلنَّهَارِ مِنَ ٱلرَّحْمَـٰنِ ۗ بَلْ هُمْ عَن ذِكْرِ رَبِّهِم مُّعْرِضُونَ",
      "en": "Say, ‘Who can guard you, day and night, against [the punishment of] the All-beneficent [should He want to punish you]?’ Indeed, they are disregardful of their Lord’s remembrance.",
      "_n": 42
    },
    {
      "ar": "أَمْ لَهُمْ ءَالِهَةٌ تَمْنَعُهُم مِّن دُونِنَا ۚ لَا يَسْتَطِيعُونَ نَصْرَ أَنفُسِهِمْ وَلَا هُم مِّنَّا يُصْحَبُونَ",
      "en": "Do they have gods besides Us to defend them? Neither can they help themselves, nor can they shield [the idolaters] from Us.",
      "_n": 43
    },
    {
      "ar": "بَلْ مَتَّعْنَا هَـٰٓؤُلَآءِ وَءَابَآءَهُمْ حَتَّىٰ طَالَ عَلَيْهِمُ ٱلْعُمُرُ ۗ أَفَلَا يَرَوْنَ أَنَّا نَأْتِى ٱلْأَرْضَ نَنقُصُهَا مِنْ أَطْرَافِهَآ ۚ أَفَهُمُ ٱلْغَـٰلِبُونَ",
      "en": "Indeed, We have provided for them and their fathers until they lived on for long years. Do they not see how We visit the land diminishing it at its edges? Are they the ones who will prevail?",
      "_n": 44
    },
    {
      "ar": "قُلْ إِنَّمَآ أُنذِرُكُم بِٱلْوَحْىِ ۚ وَلَا يَسْمَعُ ٱلصُّمُّ ٱلدُّعَآءَ إِذَا مَا يُنذَرُونَ",
      "en": "Say, ‘I indeed warn you by the means of revelation.’ But the deaf do not hear the call when they are warned.",
      "_n": 45
    },
    {
      "ar": "وَلَئِن مَّسَّتْهُمْ نَفْحَةٌ مِّنْ عَذَابِ رَبِّكَ لَيَقُولُنَّ يَـٰوَيْلَنَآ إِنَّا كُنَّا ظَـٰلِمِينَ",
      "en": "Should a whiff of your Lord’s punishment touch them, they will surely say, ‘Woe to us! We have indeed been wrongdoers!’",
      "_n": 46
    },
    {
      "ar": "وَنَضَعُ ٱلْمَوَٰزِينَ ٱلْقِسْطَ لِيَوْمِ ٱلْقِيَـٰمَةِ فَلَا تُظْلَمُ نَفْسٌ شَيْـًٔا ۖ وَإِن كَانَ مِثْقَالَ حَبَّةٍ مِّنْ خَرْدَلٍ أَتَيْنَا بِهَا ۗ وَكَفَىٰ بِنَا حَـٰسِبِينَ",
      "en": "We shall set up just scales on the Day of Resurrection, and no soul will be wronged in the least. Even if it be the weight of a mustard seed We shall produce it and We suffice as reckoners.",
      "_n": 47
    },
    {
      "ar": "وَلَقَدْ ءَاتَيْنَا مُوسَىٰ وَهَـٰرُونَ ٱلْفُرْقَانَ وَضِيَآءً وَذِكْرًا لِّلْمُتَّقِينَ",
      "en": "Certainly We gave Moses and Aaron the Criterion, a light and reminder for the Godwary",
      "_n": 48
    },
    {
      "ar": "ٱلَّذِينَ يَخْشَوْنَ رَبَّهُم بِٱلْغَيْبِ وَهُم مِّنَ ٱلسَّاعَةِ مُشْفِقُونَ",
      "en": "—those who fear their Lord in secret, and who are apprehensive of the Hour.",
      "_n": 49
    },
    {
      "ar": "وَهَـٰذَا ذِكْرٌ مُّبَارَكٌ أَنزَلْنَـٰهُ ۚ أَفَأَنتُمْ لَهُۥ مُنكِرُونَ",
      "en": "This [too] is a blessed reminder, which We have sent down. Will you then deny it?",
      "_n": 50
    },
    {
      "ar": "وَلَقَدْ ءَاتَيْنَآ إِبْرَٰهِيمَ رُشْدَهُۥ مِن قَبْلُ وَكُنَّا بِهِۦ عَـٰلِمِينَ",
      "en": "Certainly We had given Abraham his probity before, and We knew him",
      "_n": 51
    },
    {
      "ar": "إِذْ قَالَ لِأَبِيهِ وَقَوْمِهِۦ مَا هَـٰذِهِ ٱلتَّمَاثِيلُ ٱلَّتِىٓ أَنتُمْ لَهَا عَـٰكِفُونَ",
      "en": "when he said to his father and his people, ‘What are these images to which you keep on clinging?’",
      "_n": 52
    },
    {
      "ar": "قَالُوا۟ وَجَدْنَآ ءَابَآءَنَا لَهَا عَـٰبِدِينَ",
      "en": "They said, ‘We found our fathers worshipping them.’",
      "_n": 53
    },
    {
      "ar": "قَالَ لَقَدْ كُنتُمْ أَنتُمْ وَءَابَآؤُكُمْ فِى ضَلَـٰلٍ مُّبِينٍ",
      "en": "He said, ‘Certainly you and your fathers have been in manifest error.’",
      "_n": 54
    },
    {
      "ar": "قَالُوٓا۟ أَجِئْتَنَا بِٱلْحَقِّ أَمْ أَنتَ مِنَ ٱللَّـٰعِبِينَ",
      "en": "They said, ‘Are you telling the truth, or are you [just] kidding?’",
      "_n": 55
    },
    {
      "ar": "قَالَ بَل رَّبُّكُمْ رَبُّ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ٱلَّذِى فَطَرَهُنَّ وَأَنَا۠ عَلَىٰ ذَٰلِكُم مِّنَ ٱلشَّـٰهِدِينَ",
      "en": "He said, ‘Indeed, your Lord is the Lord of the heavens and the earth, who originated them, and I affirm that.",
      "_n": 56
    },
    {
      "ar": "وَتَٱللَّهِ لَأَكِيدَنَّ أَصْنَـٰمَكُم بَعْدَ أَن تُوَلُّوا۟ مُدْبِرِينَ",
      "en": "By Allah, I will devise a stratagem against your idols after you have gone away.’",
      "_n": 57
    },
    {
      "ar": "فَجَعَلَهُمْ جُذَٰذًا إِلَّا كَبِيرًا لَّهُمْ لَعَلَّهُمْ إِلَيْهِ يَرْجِعُونَ",
      "en": "So he broke them into pieces—all except the biggest of them—so that they might come back to it.",
      "_n": 58
    },
    {
      "ar": "قَالُوا۟ مَن فَعَلَ هَـٰذَا بِـَٔالِهَتِنَآ إِنَّهُۥ لَمِنَ ٱلظَّـٰلِمِينَ",
      "en": "They said, ‘Whoever has done this to Our gods?! He is indeed a wrongdoer!’",
      "_n": 59
    },
    {
      "ar": "قَالُوا۟ سَمِعْنَا فَتًى يَذْكُرُهُمْ يُقَالُ لَهُۥٓ إِبْرَٰهِيمُ",
      "en": "They said, ‘We heard a young man mentioning them. He is called ‘‘Abraham.’’ ’",
      "_n": 60
    },
    {
      "ar": "قَالُوا۟ فَأْتُوا۟ بِهِۦ عَلَىٰٓ أَعْيُنِ ٱلنَّاسِ لَعَلَّهُمْ يَشْهَدُونَ",
      "en": "They said, ‘Bring him before the people’s eyes so that they may bear witness [against him].’",
      "_n": 61
    },
    {
      "ar": "قَالُوٓا۟ ءَأَنتَ فَعَلْتَ هَـٰذَا بِـَٔالِهَتِنَا يَـٰٓإِبْرَٰهِيمُ",
      "en": "They said, ‘Was it you who did this to our gods, O Abraham?’",
      "_n": 62
    },
    {
      "ar": "قَالَ بَلْ فَعَلَهُۥ كَبِيرُهُمْ هَـٰذَا فَسْـَٔلُوهُمْ إِن كَانُوا۟ يَنطِقُونَ",
      "en": "He said, ‘No, it was this biggest one of them who did it! Ask them, if they can speak.’",
      "_n": 63
    },
    {
      "ar": "فَرَجَعُوٓا۟ إِلَىٰٓ أَنفُسِهِمْ فَقَالُوٓا۟ إِنَّكُمْ أَنتُمُ ٱلظَّـٰلِمُونَ",
      "en": "Thereat they came to themselves and said [to one another], ‘Indeed it is you who are the wrongdoers!’",
      "_n": 64
    },
    {
      "ar": "ثُمَّ نُكِسُوا۟ عَلَىٰ رُءُوسِهِمْ لَقَدْ عَلِمْتَ مَا هَـٰٓؤُلَآءِ يَنطِقُونَ",
      "en": "Then they hung their heads. [However, they said,] ‘You certainly know that they cannot speak.’",
      "_n": 65
    },
    {
      "ar": "قَالَ أَفَتَعْبُدُونَ مِن دُونِ ٱللَّهِ مَا لَا يَنفَعُكُمْ شَيْـًٔا وَلَا يَضُرُّكُمْ",
      "en": "He said, ‘Then, do you worship besides Allah that which cannot cause you any benefit or harm?",
      "_n": 66
    },
    {
      "ar": "أُفٍّ لَّكُمْ وَلِمَا تَعْبُدُونَ مِن دُونِ ٱللَّهِ ۖ أَفَلَا تَعْقِلُونَ",
      "en": "Fie on you and what you worship besides Allah! Do you not exercise your reason?’",
      "_n": 67
    },
    {
      "ar": "قَالُوا۟ حَرِّقُوهُ وَٱنصُرُوٓا۟ ءَالِهَتَكُمْ إِن كُنتُمْ فَـٰعِلِينَ",
      "en": "They said, ‘Burn him, and help your gods, if you are to do anything!’",
      "_n": 68
    },
    {
      "ar": "قُلْنَا يَـٰنَارُ كُونِى بَرْدًا وَسَلَـٰمًا عَلَىٰٓ إِبْرَٰهِيمَ",
      "en": "We said, ‘O fire! Be cool and safe for Abraham!’",
      "_n": 69
    },
    {
      "ar": "وَأَرَادُوا۟ بِهِۦ كَيْدًا فَجَعَلْنَـٰهُمُ ٱلْأَخْسَرِينَ",
      "en": "They plotted to harm him, but We made them the biggest losers.",
      "_n": 70
    },
    {
      "ar": "وَنَجَّيْنَـٰهُ وَلُوطًا إِلَى ٱلْأَرْضِ ٱلَّتِى بَـٰرَكْنَا فِيهَا لِلْعَـٰلَمِينَ",
      "en": "We delivered him and Lot toward the land, which We have blessed for all nations.",
      "_n": 71
    },
    {
      "ar": "وَوَهَبْنَا لَهُۥٓ إِسْحَـٰقَ وَيَعْقُوبَ نَافِلَةً ۖ وَكُلًّا جَعَلْنَا صَـٰلِحِينَ",
      "en": "And We gave him Isaac, and Jacob as well for a grandson, and each of them We made righteous.",
      "_n": 72
    },
    {
      "ar": "وَجَعَلْنَـٰهُمْ أَئِمَّةً يَهْدُونَ بِأَمْرِنَا وَأَوْحَيْنَآ إِلَيْهِمْ فِعْلَ ٱلْخَيْرَٰتِ وَإِقَامَ ٱلصَّلَوٰةِ وَإِيتَآءَ ٱلزَّكَوٰةِ ۖ وَكَانُوا۟ لَنَا عَـٰبِدِينَ",
      "en": "We made them imams, guiding by Our command, and We revealed to them [concerning] the performance of good deeds, the maintenance of prayers, and the giving of zakat, and they used to worship Us.",
      "_n": 73
    },
    {
      "ar": "وَلُوطًا ءَاتَيْنَـٰهُ حُكْمًا وَعِلْمًا وَنَجَّيْنَـٰهُ مِنَ ٱلْقَرْيَةِ ٱلَّتِى كَانَت تَّعْمَلُ ٱلْخَبَـٰٓئِثَ ۗ إِنَّهُمْ كَانُوا۟ قَوْمَ سَوْءٍ فَـٰسِقِينَ",
      "en": "We gave judgement and knowledge to Lot, and We delivered him from the town which used to commit vicious acts. Indeed, they were an evil and depraved lot.",
      "_n": 74
    },
    {
      "ar": "وَأَدْخَلْنَـٰهُ فِى رَحْمَتِنَآ ۖ إِنَّهُۥ مِنَ ٱلصَّـٰلِحِينَ",
      "en": "And We admitted him into Our mercy. Indeed, he was one of the righteous.",
      "_n": 75
    },
    {
      "ar": "وَنُوحًا إِذْ نَادَىٰ مِن قَبْلُ فَٱسْتَجَبْنَا لَهُۥ فَنَجَّيْنَـٰهُ وَأَهْلَهُۥ مِنَ ٱلْكَرْبِ ٱلْعَظِيمِ",
      "en": "And before that Noah, when he called out, We responded to him and delivered him and his family from the great agony.",
      "_n": 76
    },
    {
      "ar": "وَنَصَرْنَـٰهُ مِنَ ٱلْقَوْمِ ٱلَّذِينَ كَذَّبُوا۟ بِـَٔايَـٰتِنَآ ۚ إِنَّهُمْ كَانُوا۟ قَوْمَ سَوْءٍ فَأَغْرَقْنَـٰهُمْ أَجْمَعِينَ",
      "en": "And We helped him against the people who denied Our signs. They were indeed an evil lot; so We drowned them all.",
      "_n": 77
    },
    {
      "ar": "وَدَاوُۥدَ وَسُلَيْمَـٰنَ إِذْ يَحْكُمَانِ فِى ٱلْحَرْثِ إِذْ نَفَشَتْ فِيهِ غَنَمُ ٱلْقَوْمِ وَكُنَّا لِحُكْمِهِمْ شَـٰهِدِينَ",
      "en": "And [remember] David and Solomon when they gave judgement concerning the tillage when the sheep of some people strayed into it by night, and We were witness to their judgement.",
      "_n": 78
    },
    {
      "ar": "فَفَهَّمْنَـٰهَا سُلَيْمَـٰنَ ۚ وَكُلًّا ءَاتَيْنَا حُكْمًا وَعِلْمًا ۚ وَسَخَّرْنَا مَعَ دَاوُۥدَ ٱلْجِبَالَ يُسَبِّحْنَ وَٱلطَّيْرَ ۚ وَكُنَّا فَـٰعِلِينَ",
      "en": "We gave its understanding to Solomon, and to each We gave judgement and knowledge. We disposed the mountains and the birds to glorify [Us] with David, and We have been the doer [of these things].",
      "_n": 79
    },
    {
      "ar": "وَعَلَّمْنَـٰهُ صَنْعَةَ لَبُوسٍ لَّكُمْ لِتُحْصِنَكُم مِّنۢ بَأْسِكُمْ ۖ فَهَلْ أَنتُمْ شَـٰكِرُونَ",
      "en": "We taught him the making of coats of mail for you, to protect you from your [own] violence. Will you then be grateful?",
      "_n": 80
    },
    {
      "ar": "وَلِسُلَيْمَـٰنَ ٱلرِّيحَ عَاصِفَةً تَجْرِى بِأَمْرِهِۦٓ إِلَى ٱلْأَرْضِ ٱلَّتِى بَـٰرَكْنَا فِيهَا ۚ وَكُنَّا بِكُلِّ شَىْءٍ عَـٰلِمِينَ",
      "en": "And [We disposed] for Solomon the tempestuous wind which blew by his command toward the land which We have blessed, and We have knowledge of all things.",
      "_n": 81
    },
    {
      "ar": "وَمِنَ ٱلشَّيَـٰطِينِ مَن يَغُوصُونَ لَهُۥ وَيَعْمَلُونَ عَمَلًا دُونَ ذَٰلِكَ ۖ وَكُنَّا لَهُمْ حَـٰفِظِينَ",
      "en": "Among the devils were some who dived for him and performed tasks other than that, and We were watchful over them.",
      "_n": 82
    },
    {
      "ar": "وَأَيُّوبَ إِذْ نَادَىٰ رَبَّهُۥٓ أَنِّى مَسَّنِىَ ٱلضُّرُّ وَأَنتَ أَرْحَمُ ٱلرَّٰحِمِينَ",
      "en": "And [remember] Job, when he called out to his Lord, ‘Indeed distress has befallen me, and You are the most merciful of the merciful.’",
      "_n": 83
    },
    {
      "ar": "فَٱسْتَجَبْنَا لَهُۥ فَكَشَفْنَا مَا بِهِۦ مِن ضُرٍّ ۖ وَءَاتَيْنَـٰهُ أَهْلَهُۥ وَمِثْلَهُم مَّعَهُمْ رَحْمَةً مِّنْ عِندِنَا وَذِكْرَىٰ لِلْعَـٰبِدِينَ",
      "en": "So We answered his prayer and removed his distress, and We gave him [back] his family along with others like them, as a mercy from Us and an admonition for the devout.",
      "_n": 84
    },
    {
      "ar": "وَإِسْمَـٰعِيلَ وَإِدْرِيسَ وَذَا ٱلْكِفْلِ ۖ كُلٌّ مِّنَ ٱلصَّـٰبِرِينَ",
      "en": "And [remember] Ishmael, Idris, and Dhul-Kifl—each of them was among the patient.",
      "_n": 85
    },
    {
      "ar": "وَأَدْخَلْنَـٰهُمْ فِى رَحْمَتِنَآ ۖ إِنَّهُم مِّنَ ٱلصَّـٰلِحِينَ",
      "en": "We admitted them into Our mercy. Indeed, they were among the righteous.",
      "_n": 86
    },
    {
      "ar": "وَذَا ٱلنُّونِ إِذ ذَّهَبَ مُغَـٰضِبًا فَظَنَّ أَن لَّن نَّقْدِرَ عَلَيْهِ فَنَادَىٰ فِى ٱلظُّلُمَـٰتِ أَن لَّآ إِلَـٰهَ إِلَّآ أَنتَ سُبْحَـٰنَكَ إِنِّى كُنتُ مِنَ ٱلظَّـٰلِمِينَ",
      "en": "And [remember] the Man of the Fish, when he left in a rage, thinking that We would not put him to hardship. Then he cried out in the darkness, ‘There is no god except You! You are immaculate! I have indeed been among the wrongdoers!’",
      "_n": 87
    },
    {
      "ar": "فَٱسْتَجَبْنَا لَهُۥ وَنَجَّيْنَـٰهُ مِنَ ٱلْغَمِّ ۚ وَكَذَٰلِكَ نُـۨجِى ٱلْمُؤْمِنِينَ",
      "en": "So We answered his prayer and delivered him from the agony; and thus do We deliver the faithful.",
      "_n": 88
    },
    {
      "ar": "وَزَكَرِيَّآ إِذْ نَادَىٰ رَبَّهُۥ رَبِّ لَا تَذَرْنِى فَرْدًا وَأَنتَ خَيْرُ ٱلْوَٰرِثِينَ",
      "en": "And [remember] Zechariah, when he cried out to his Lord, ‘My Lord! Do not leave me without an heir, and You are the best of inheritors.’",
      "_n": 89
    },
    {
      "ar": "فَٱسْتَجَبْنَا لَهُۥ وَوَهَبْنَا لَهُۥ يَحْيَىٰ وَأَصْلَحْنَا لَهُۥ زَوْجَهُۥٓ ۚ إِنَّهُمْ كَانُوا۟ يُسَـٰرِعُونَ فِى ٱلْخَيْرَٰتِ وَيَدْعُونَنَا رَغَبًا وَرَهَبًا ۖ وَكَانُوا۟ لَنَا خَـٰشِعِينَ",
      "en": "So We answered his prayer, and gave him John, and cured for him his wife [of infertility]. Indeed, they were active in [performing] good works, and they would supplicate Us with eagerness and awe and were humble before Us.",
      "_n": 90
    },
    {
      "ar": "وَٱلَّتِىٓ أَحْصَنَتْ فَرْجَهَا فَنَفَخْنَا فِيهَا مِن رُّوحِنَا وَجَعَلْنَـٰهَا وَٱبْنَهَآ ءَايَةً لِّلْعَـٰلَمِينَ",
      "en": "And [remember] her who guarded her chastity, so We breathed into her Our spirit, and made her and her son a sign for all the nations.",
      "_n": 91
    },
    {
      "ar": "إِنَّ هَـٰذِهِۦٓ أُمَّتُكُمْ أُمَّةً وَٰحِدَةً وَأَنَا۠ رَبُّكُمْ فَٱعْبُدُونِ",
      "en": "Indeed this community of yours is one community, and I am your Lord. So worship Me.",
      "_n": 92
    },
    {
      "ar": "وَتَقَطَّعُوٓا۟ أَمْرَهُم بَيْنَهُمْ ۖ كُلٌّ إِلَيْنَا رَٰجِعُونَ",
      "en": "They have fragmented their religion among themselves, but everyone of them will return to Us.",
      "_n": 93
    },
    {
      "ar": "فَمَن يَعْمَلْ مِنَ ٱلصَّـٰلِحَـٰتِ وَهُوَ مُؤْمِنٌ فَلَا كُفْرَانَ لِسَعْيِهِۦ وَإِنَّا لَهُۥ كَـٰتِبُونَ",
      "en": "Whoever is faithful and does righteous deeds, his endeavour shall not go unappreciated, and We will indeed record it for him.",
      "_n": 94
    },
    {
      "ar": "وَحَرَٰمٌ عَلَىٰ قَرْيَةٍ أَهْلَكْنَـٰهَآ أَنَّهُمْ لَا يَرْجِعُونَ",
      "en": "It is forbidden for [the people of] any town that We have destroyed [to return to the world]: they shall not return,",
      "_n": 95
    },
    {
      "ar": "حَتَّىٰٓ إِذَا فُتِحَتْ يَأْجُوجُ وَمَأْجُوجُ وَهُم مِّن كُلِّ حَدَبٍ يَنسِلُونَ",
      "en": "until when Gog and Magog are let loose, and they race down from every slope,",
      "_n": 96
    },
    {
      "ar": "وَٱقْتَرَبَ ٱلْوَعْدُ ٱلْحَقُّ فَإِذَا هِىَ شَـٰخِصَةٌ أَبْصَـٰرُ ٱلَّذِينَ كَفَرُوا۟ يَـٰوَيْلَنَا قَدْ كُنَّا فِى غَفْلَةٍ مِّنْ هَـٰذَا بَلْ كُنَّا ظَـٰلِمِينَ",
      "en": "and the true promise draws near [to its fulfillment], behold, the faithless will look on with a fixed gaze: ‘Woe to us! We have certainly been oblivious of this! Indeed, we have been wrongdoers!’",
      "_n": 97
    },
    {
      "ar": "إِنَّكُمْ وَمَا تَعْبُدُونَ مِن دُونِ ٱللَّهِ حَصَبُ جَهَنَّمَ أَنتُمْ لَهَا وَٰرِدُونَ",
      "en": "Indeed you and what [idols] you worship besides Allah shall be fuel for hell, and you will enter it.",
      "_n": 98
    },
    {
      "ar": "لَوْ كَانَ هَـٰٓؤُلَآءِ ءَالِهَةً مَّا وَرَدُوهَا ۖ وَكُلٌّ فِيهَا خَـٰلِدُونَ",
      "en": "Had they been gods, they would not have entered it, and they will all remain in it [forever].",
      "_n": 99
    },
    {
      "ar": "لَهُمْ فِيهَا زَفِيرٌ وَهُمْ فِيهَا لَا يَسْمَعُونَ",
      "en": "Their lot therein will be groaning, and they will not hear anything in it.",
      "_n": 100
    },
    {
      "ar": "إِنَّ ٱلَّذِينَ سَبَقَتْ لَهُم مِّنَّا ٱلْحُسْنَىٰٓ أُو۟لَـٰٓئِكَ عَنْهَا مُبْعَدُونَ",
      "en": "Indeed those to whom there has gone beforehand [the promise of] the best reward from Us will be kept away from it.",
      "_n": 101
    },
    {
      "ar": "لَا يَسْمَعُونَ حَسِيسَهَا ۖ وَهُمْ فِى مَا ٱشْتَهَتْ أَنفُسُهُمْ خَـٰلِدُونَ",
      "en": "They will not hear even its faint sound and they will remain [forever] in what their souls desire.",
      "_n": 102
    },
    {
      "ar": "لَا يَحْزُنُهُمُ ٱلْفَزَعُ ٱلْأَكْبَرُ وَتَتَلَقَّىٰهُمُ ٱلْمَلَـٰٓئِكَةُ هَـٰذَا يَوْمُكُمُ ٱلَّذِى كُنتُمْ تُوعَدُونَ",
      "en": "The Great Terror will not upset them, and the angels will receive them [saying]: ‘This is your day which you were promised.’",
      "_n": 103
    },
    {
      "ar": "يَوْمَ نَطْوِى ٱلسَّمَآءَ كَطَىِّ ٱلسِّجِلِّ لِلْكُتُبِ ۚ كَمَا بَدَأْنَآ أَوَّلَ خَلْقٍ نُّعِيدُهُۥ ۚ وَعْدًا عَلَيْنَآ ۚ إِنَّا كُنَّا فَـٰعِلِينَ",
      "en": "The day We shall roll up the heaven, like rolling of the scrolls [meant] for writings. We will bring it back just as We began the first creation—a promise [binding] on Us. [That] indeed We will do.",
      "_n": 104
    },
    {
      "ar": "وَلَقَدْ كَتَبْنَا فِى ٱلزَّبُورِ مِنۢ بَعْدِ ٱلذِّكْرِ أَنَّ ٱلْأَرْضَ يَرِثُهَا عِبَادِىَ ٱلصَّـٰلِحُونَ",
      "en": "Certainly We wrote in the Psalms, after the Torah: ‘Indeed My righteous servants shall inherit the earth.’",
      "_n": 105
    },
    {
      "ar": "إِنَّ فِى هَـٰذَا لَبَلَـٰغًا لِّقَوْمٍ عَـٰبِدِينَ",
      "en": "There is indeed in this a proclamation for a devout people.",
      "_n": 106
    },
    {
      "ar": "وَمَآ أَرْسَلْنَـٰكَ إِلَّا رَحْمَةً لِّلْعَـٰلَمِينَ",
      "en": "We did not send you but as a mercy to all the nations.",
      "_n": 107
    },
    {
      "ar": "قُلْ إِنَّمَا يُوحَىٰٓ إِلَىَّ أَنَّمَآ إِلَـٰهُكُمْ إِلَـٰهٌ وَٰحِدٌ ۖ فَهَلْ أَنتُم مُّسْلِمُونَ",
      "en": "Say, ‘It has been revealed to me that your God is the One God. So will you submit?’",
      "_n": 108
    },
    {
      "ar": "فَإِن تَوَلَّوْا۟ فَقُلْ ءَاذَنتُكُمْ عَلَىٰ سَوَآءٍ ۖ وَإِنْ أَدْرِىٓ أَقَرِيبٌ أَم بَعِيدٌ مَّا تُوعَدُونَ",
      "en": "But if they turn away, say, ‘I have proclaimed to you all alike, and I do not know whether what you have been promised is far or near.",
      "_n": 109
    },
    {
      "ar": "إِنَّهُۥ يَعْلَمُ ٱلْجَهْرَ مِنَ ٱلْقَوْلِ وَيَعْلَمُ مَا تَكْتُمُونَ",
      "en": "Indeed He knows whatever is spoken aloud, and He knows whatever you conceal.",
      "_n": 110
    },
    {
      "ar": "وَإِنْ أَدْرِى لَعَلَّهُۥ فِتْنَةٌ لَّكُمْ وَمَتَـٰعٌ إِلَىٰ حِينٍ",
      "en": "I do not know—maybe it is a trial for you and an enjoyment for a while.’",
      "_n": 111
    },
    {
      "ar": "قَـٰلَ رَبِّ ٱحْكُم بِٱلْحَقِّ ۗ وَرَبُّنَا ٱلرَّحْمَـٰنُ ٱلْمُسْتَعَانُ عَلَىٰ مَا تَصِفُونَ",
      "en": "He said, ‘My Lord! Judge [between us and the polytheists] with justice.’ ‘Our Lord is the All-beneficent; [He is our] resort against what you allege.’",
      "_n": 112
    }
  ],
  "_n": 21,
  "_c": 112
}