{
  "ar": "القصص",
  "en": "The Stories",
  "_a": "Al-Qasas",
  "_l": "Meccan",
  "_v": [
    {
      "ar": "طسٓمٓ",
      "en": "Ta, Seen, Meem.",
      "_n": 1
    },
    {
      "ar": "تِلْكَ ءَايَـٰتُ ٱلْكِتَـٰبِ ٱلْمُبِينِ",
      "en": "These are the signs of the Manifest Book.",
      "_n": 2
    },
    {
      "ar": "نَتْلُوا۟ عَلَيْكَ مِن نَّبَإِ مُوسَىٰ وَفِرْعَوْنَ بِٱلْحَقِّ لِقَوْمٍ يُؤْمِنُونَ",
      "en": "We relate to you truly some of the account of Moses and Pharaoh for a people who have faith.",
      "_n": 3
    },
    {
      "ar": "إِنَّ فِرْعَوْنَ عَلَا فِى ٱلْأَرْضِ وَجَعَلَ أَهْلَهَا شِيَعًا يَسْتَضْعِفُ طَآئِفَةً مِّنْهُمْ يُذَبِّحُ أَبْنَآءَهُمْ وَيَسْتَحْىِۦ نِسَآءَهُمْ ۚ إِنَّهُۥ كَانَ مِنَ ٱلْمُفْسِدِينَ",
      "en": "Indeed Pharaoh tyrannized over the land, reducing its people to factions, abasing one group of them, slaughtering their sons, and sparing their women. Indeed, He was one of the agents of corruption.",
      "_n": 4
    },
    {
      "ar": "وَنُرِيدُ أَن نَّمُنَّ عَلَى ٱلَّذِينَ ٱسْتُضْعِفُوا۟ فِى ٱلْأَرْضِ وَنَجْعَلَهُمْ أَئِمَّةً وَنَجْعَلَهُمُ ٱلْوَٰرِثِينَ",
      "en": "And We desired to show favour to those who were abased in the land, and to make them imams, and to make them the heirs,",
      "_n": 5
    },
    {
      "ar": "وَنُمَكِّنَ لَهُمْ فِى ٱلْأَرْضِ وَنُرِىَ فِرْعَوْنَ وَهَـٰمَـٰنَ وَجُنُودَهُمَا مِنْهُم مَّا كَانُوا۟ يَحْذَرُونَ",
      "en": "and to establish them in the land, and to show Pharaoh and Haman and their hosts from them that of which they were apprehensive.",
      "_n": 6
    },
    {
      "ar": "وَأَوْحَيْنَآ إِلَىٰٓ أُمِّ مُوسَىٰٓ أَنْ أَرْضِعِيهِ ۖ فَإِذَا خِفْتِ عَلَيْهِ فَأَلْقِيهِ فِى ٱلْيَمِّ وَلَا تَخَافِى وَلَا تَحْزَنِىٓ ۖ إِنَّا رَآدُّوهُ إِلَيْكِ وَجَاعِلُوهُ مِنَ ٱلْمُرْسَلِينَ",
      "en": "We revealed to Moses’ mother, [saying], ‘Nurse him; then, when you fear for him, cast him into the river, and do not fear or grieve, for We will restore him to you and make him one of the apostles.’",
      "_n": 7
    },
    {
      "ar": "فَٱلْتَقَطَهُۥٓ ءَالُ فِرْعَوْنَ لِيَكُونَ لَهُمْ عَدُوًّا وَحَزَنًا ۗ إِنَّ فِرْعَوْنَ وَهَـٰمَـٰنَ وَجُنُودَهُمَا كَانُوا۟ خَـٰطِـِٔينَ",
      "en": "Then Pharaoh’s kinsmen picked him up that he might be an enemy and a cause of grief to them. Indeed Pharaoh and Haman and their hosts were iniquitous.",
      "_n": 8
    },
    {
      "ar": "وَقَالَتِ ٱمْرَأَتُ فِرْعَوْنَ قُرَّتُ عَيْنٍ لِّى وَلَكَ ۖ لَا تَقْتُلُوهُ عَسَىٰٓ أَن يَنفَعَنَآ أَوْ نَتَّخِذَهُۥ وَلَدًا وَهُمْ لَا يَشْعُرُونَ",
      "en": "Pharaoh’s wife said [to him], ‘[This infant will be] a [source of] comfort to me and to you. Do not kill him. Maybe he will benefit us, or we will adopt him as a son.’ But they were not aware.",
      "_n": 9
    },
    {
      "ar": "وَأَصْبَحَ فُؤَادُ أُمِّ مُوسَىٰ فَـٰرِغًا ۖ إِن كَادَتْ لَتُبْدِى بِهِۦ لَوْلَآ أَن رَّبَطْنَا عَلَىٰ قَلْبِهَا لِتَكُونَ مِنَ ٱلْمُؤْمِنِينَ",
      "en": "The heart of Moses’ mother became desolate, and indeed she was about to divulge it had We not fortified her heart so that she might have faith [in Allah’s promise].",
      "_n": 10
    },
    {
      "ar": "وَقَالَتْ لِأُخْتِهِۦ قُصِّيهِ ۖ فَبَصُرَتْ بِهِۦ عَن جُنُبٍ وَهُمْ لَا يَشْعُرُونَ",
      "en": "She said to his sister, ‘Follow him.’ So she watched him from a distance, while they were not aware.",
      "_n": 11
    },
    {
      "ar": "وَحَرَّمْنَا عَلَيْهِ ٱلْمَرَاضِعَ مِن قَبْلُ فَقَالَتْ هَلْ أَدُلُّكُمْ عَلَىٰٓ أَهْلِ بَيْتٍ يَكْفُلُونَهُۥ لَكُمْ وَهُمْ لَهُۥ نَـٰصِحُونَ",
      "en": "Since before We had forbidden him to be suckled by any nurse. So she said, ‘Shall I show you a household that will take care of him for you and they will be his well-wishers?’",
      "_n": 12
    },
    {
      "ar": "فَرَدَدْنَـٰهُ إِلَىٰٓ أُمِّهِۦ كَىْ تَقَرَّ عَيْنُهَا وَلَا تَحْزَنَ وَلِتَعْلَمَ أَنَّ وَعْدَ ٱللَّهِ حَقٌّ وَلَـٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ",
      "en": "That is how We restored him to his mother so that she might be comforted and not grieve, and that she might know that Allah’s promise is true, but most of them do not know.",
      "_n": 13
    },
    {
      "ar": "وَلَمَّا بَلَغَ أَشُدَّهُۥ وَٱسْتَوَىٰٓ ءَاتَيْنَـٰهُ حُكْمًا وَعِلْمًا ۚ وَكَذَٰلِكَ نَجْزِى ٱلْمُحْسِنِينَ",
      "en": "When he came of age and became fully matured, We gave him judgement and knowledge, and thus do We reward the virtuous.",
      "_n": 14
    },
    {
      "ar": "وَدَخَلَ ٱلْمَدِينَةَ عَلَىٰ حِينِ غَفْلَةٍ مِّنْ أَهْلِهَا فَوَجَدَ فِيهَا رَجُلَيْنِ يَقْتَتِلَانِ هَـٰذَا مِن شِيعَتِهِۦ وَهَـٰذَا مِنْ عَدُوِّهِۦ ۖ فَٱسْتَغَـٰثَهُ ٱلَّذِى مِن شِيعَتِهِۦ عَلَى ٱلَّذِى مِنْ عَدُوِّهِۦ فَوَكَزَهُۥ مُوسَىٰ فَقَضَىٰ عَلَيْهِ ۖ قَالَ هَـٰذَا مِنْ عَمَلِ ٱلشَّيْطَـٰنِ ۖ إِنَّهُۥ عَدُوٌّ مُّضِلٌّ مُّبِينٌ",
      "en": "[One day] he entered the city at a time when its people were not likely to take notice. He found there two men fighting, this one from among his followers, and that one from his enemies. The one who was from his followers sought his help against him who was from his enemies. So Moses hit him with his fist, whereupon he expired. He said, ‘This is of Satan’s doing. Indeed he is clearly a misguiding enemy.’",
      "_n": 15
    },
    {
      "ar": "قَالَ رَبِّ إِنِّى ظَلَمْتُ نَفْسِى فَٱغْفِرْ لِى فَغَفَرَ لَهُۥٓ ۚ إِنَّهُۥ هُوَ ٱلْغَفُورُ ٱلرَّحِيمُ",
      "en": "He said, ‘My Lord! I have wronged myself. Forgive me!’ So He forgave him. Indeed, He is the All-forgiving, the All-merciful.",
      "_n": 16
    },
    {
      "ar": "قَالَ رَبِّ بِمَآ أَنْعَمْتَ عَلَىَّ فَلَنْ أَكُونَ ظَهِيرًا لِّلْمُجْرِمِينَ",
      "en": "He said, ‘My Lord! As You have blessed me, I will never be a supporter of the guilty.’",
      "_n": 17
    },
    {
      "ar": "فَأَصْبَحَ فِى ٱلْمَدِينَةِ خَآئِفًا يَتَرَقَّبُ فَإِذَا ٱلَّذِى ٱسْتَنصَرَهُۥ بِٱلْأَمْسِ يَسْتَصْرِخُهُۥ ۚ قَالَ لَهُۥ مُوسَىٰٓ إِنَّكَ لَغَوِىٌّ مُّبِينٌ",
      "en": "He rose at dawn in the city, fearful and vigilant, when behold, the one who had sought his help the day before, shouted for his help [once again]. Moses said to him, ‘You are indeed clearly perverse!’",
      "_n": 18
    },
    {
      "ar": "فَلَمَّآ أَنْ أَرَادَ أَن يَبْطِشَ بِٱلَّذِى هُوَ عَدُوٌّ لَّهُمَا قَالَ يَـٰمُوسَىٰٓ أَتُرِيدُ أَن تَقْتُلَنِى كَمَا قَتَلْتَ نَفْسًۢا بِٱلْأَمْسِ ۖ إِن تُرِيدُ إِلَّآ أَن تَكُونَ جَبَّارًا فِى ٱلْأَرْضِ وَمَا تُرِيدُ أَن تَكُونَ مِنَ ٱلْمُصْلِحِينَ",
      "en": "But when he wanted to strike him who was an enemy of both of them, he said, ‘Moses, do you want to kill me, just like the one you killed yesterday? You only want to be a tyrant in the land, and you do not desire to be one who brings about reform.’",
      "_n": 19
    },
    {
      "ar": "وَجَآءَ رَجُلٌ مِّنْ أَقْصَا ٱلْمَدِينَةِ يَسْعَىٰ قَالَ يَـٰمُوسَىٰٓ إِنَّ ٱلْمَلَأَ يَأْتَمِرُونَ بِكَ لِيَقْتُلُوكَ فَٱخْرُجْ إِنِّى لَكَ مِنَ ٱلنَّـٰصِحِينَ",
      "en": "There came a man from the city outskirts, hurrying. He said, ‘Moses! The elite are indeed conspiring to kill you. So leave. I am indeed your well-wisher.’",
      "_n": 20
    },
    {
      "ar": "فَخَرَجَ مِنْهَا خَآئِفًا يَتَرَقَّبُ ۖ قَالَ رَبِّ نَجِّنِى مِنَ ٱلْقَوْمِ ٱلظَّـٰلِمِينَ",
      "en": "So he left the city, fearful and vigilant. He said, ‘My Lord! Deliver me from the wrongdoing lot.’",
      "_n": 21
    },
    {
      "ar": "وَلَمَّا تَوَجَّهَ تِلْقَآءَ مَدْيَنَ قَالَ عَسَىٰ رَبِّىٓ أَن يَهْدِيَنِى سَوَآءَ ٱلسَّبِيلِ",
      "en": "And when he turned his face toward Midian, he said, ‘Maybe my Lord will show me the right way.’",
      "_n": 22
    },
    {
      "ar": "وَلَمَّا وَرَدَ مَآءَ مَدْيَنَ وَجَدَ عَلَيْهِ أُمَّةً مِّنَ ٱلنَّاسِ يَسْقُونَ وَوَجَدَ مِن دُونِهِمُ ٱمْرَأَتَيْنِ تَذُودَانِ ۖ قَالَ مَا خَطْبُكُمَا ۖ قَالَتَا لَا نَسْقِى حَتَّىٰ يُصْدِرَ ٱلرِّعَآءُ ۖ وَأَبُونَا شَيْخٌ كَبِيرٌ",
      "en": "When he arrived at the well of Midian, he found there a throng of people watering [their flocks], and he found, besides them, two women holding back [their flock]. He said, ‘What is your business?’ They said, ‘We do not water [our flock] until the shepherds have driven out [their flocks], and our father is an aged man.’",
      "_n": 23
    },
    {
      "ar": "فَسَقَىٰ لَهُمَا ثُمَّ تَوَلَّىٰٓ إِلَى ٱلظِّلِّ فَقَالَ رَبِّ إِنِّى لِمَآ أَنزَلْتَ إِلَىَّ مِنْ خَيْرٍ فَقِيرٌ",
      "en": "So he watered [their flock] for them. Then he withdrew toward the shade and said, ‘My Lord! I am indeed in need of any good You may send down to me!’",
      "_n": 24
    },
    {
      "ar": "فَجَآءَتْهُ إِحْدَىٰهُمَا تَمْشِى عَلَى ٱسْتِحْيَآءٍ قَالَتْ إِنَّ أَبِى يَدْعُوكَ لِيَجْزِيَكَ أَجْرَ مَا سَقَيْتَ لَنَا ۚ فَلَمَّا جَآءَهُۥ وَقَصَّ عَلَيْهِ ٱلْقَصَصَ قَالَ لَا تَخَفْ ۖ نَجَوْتَ مِنَ ٱلْقَوْمِ ٱلظَّـٰلِمِينَ",
      "en": "Then one of the two women approached him, walking bashfully. She said, ‘Indeed my father invites you to pay you the wages for watering [our flock] for us.’ So when he came to him and recounted the story to him, he said, ‘Do not be afraid. You have been delivered from the wrongdoing lot.’",
      "_n": 25
    },
    {
      "ar": "قَالَتْ إِحْدَىٰهُمَا يَـٰٓأَبَتِ ٱسْتَـْٔجِرْهُ ۖ إِنَّ خَيْرَ مَنِ ٱسْتَـْٔجَرْتَ ٱلْقَوِىُّ ٱلْأَمِينُ",
      "en": "One of the two women said, ‘Father, hire him. Indeed the best you can hire is a powerful and trustworthy man.’",
      "_n": 26
    },
    {
      "ar": "قَالَ إِنِّىٓ أُرِيدُ أَنْ أُنكِحَكَ إِحْدَى ٱبْنَتَىَّ هَـٰتَيْنِ عَلَىٰٓ أَن تَأْجُرَنِى ثَمَـٰنِىَ حِجَجٍ ۖ فَإِنْ أَتْمَمْتَ عَشْرًا فَمِنْ عِندِكَ ۖ وَمَآ أُرِيدُ أَنْ أَشُقَّ عَلَيْكَ ۚ سَتَجِدُنِىٓ إِن شَآءَ ٱللَّهُ مِنَ ٱلصَّـٰلِحِينَ",
      "en": "He said, ‘Indeed I desire to marry you to one of these two daughters of mine, on condition that you hire yourself to me for eight years. And if you complete ten, that will be up to you, and I do not want to be hard on you. God willing, you will find me to a righteous person.’",
      "_n": 27
    },
    {
      "ar": "قَالَ ذَٰلِكَ بَيْنِى وَبَيْنَكَ ۖ أَيَّمَا ٱلْأَجَلَيْنِ قَضَيْتُ فَلَا عُدْوَٰنَ عَلَىَّ ۖ وَٱللَّهُ عَلَىٰ مَا نَقُولُ وَكِيلٌ",
      "en": "He said, ‘This will be [by consent] between you and me. Whichever of the two terms I complete, there shall be no imposition upon me, and Allah is witness over what we say.’",
      "_n": 28
    },
    {
      "ar": "فَلَمَّا قَضَىٰ مُوسَى ٱلْأَجَلَ وَسَارَ بِأَهْلِهِۦٓ ءَانَسَ مِن جَانِبِ ٱلطُّورِ نَارًا قَالَ لِأَهْلِهِ ٱمْكُثُوٓا۟ إِنِّىٓ ءَانَسْتُ نَارًا لَّعَلِّىٓ ءَاتِيكُم مِّنْهَا بِخَبَرٍ أَوْ جَذْوَةٍ مِّنَ ٱلنَّارِ لَعَلَّكُمْ تَصْطَلُونَ",
      "en": "So when Moses completed the term and set out with his family, he descried a fire on the side of the mountain. He said to his family, ‘Wait! Indeed, I descry a fire! Maybe I will bring you some news from it, or a brand of fire so that you may warm yourselves.’",
      "_n": 29
    },
    {
      "ar": "فَلَمَّآ أَتَىٰهَا نُودِىَ مِن شَـٰطِئِ ٱلْوَادِ ٱلْأَيْمَنِ فِى ٱلْبُقْعَةِ ٱلْمُبَـٰرَكَةِ مِنَ ٱلشَّجَرَةِ أَن يَـٰمُوسَىٰٓ إِنِّىٓ أَنَا ٱللَّهُ رَبُّ ٱلْعَـٰلَمِينَ",
      "en": "When he approached it, he was called from the right bank of the valley in that blessed site from the tree: ‘Moses! Indeed I am Allah, the Lord of all the worlds!’",
      "_n": 30
    },
    {
      "ar": "وَأَنْ أَلْقِ عَصَاكَ ۖ فَلَمَّا رَءَاهَا تَهْتَزُّ كَأَنَّهَا جَآنٌّ وَلَّىٰ مُدْبِرًا وَلَمْ يُعَقِّبْ ۚ يَـٰمُوسَىٰٓ أَقْبِلْ وَلَا تَخَفْ ۖ إِنَّكَ مِنَ ٱلْـَٔامِنِينَ",
      "en": "And: ‘Throw down your staff!’ And when he saw it wriggling as if it were a snake, he turned his back [to flee], without looking back. ‘Moses! Come forward, and do not be afraid. Indeed you are safe.’",
      "_n": 31
    },
    {
      "ar": "ٱسْلُكْ يَدَكَ فِى جَيْبِكَ تَخْرُجْ بَيْضَآءَ مِنْ غَيْرِ سُوٓءٍ وَٱضْمُمْ إِلَيْكَ جَنَاحَكَ مِنَ ٱلرَّهْبِ ۖ فَذَٰنِكَ بُرْهَـٰنَانِ مِن رَّبِّكَ إِلَىٰ فِرْعَوْنَ وَمَلَإِي۟هِۦٓ ۚ إِنَّهُمْ كَانُوا۟ قَوْمًا فَـٰسِقِينَ",
      "en": "‘Insert your hand into your shirt. It will emerge white, without any fault, and keep your arms drawn in awe to your sides. These shall be two proofs from your Lord to Pharaoh and his elite. They are indeed a transgressing lot.’",
      "_n": 32
    },
    {
      "ar": "قَالَ رَبِّ إِنِّى قَتَلْتُ مِنْهُمْ نَفْسًا فَأَخَافُ أَن يَقْتُلُونِ",
      "en": "He said, ‘My Lord! Indeed, I have killed one of their men, so I fear they will kill me.",
      "_n": 33
    },
    {
      "ar": "وَأَخِى هَـٰرُونُ هُوَ أَفْصَحُ مِنِّى لِسَانًا فَأَرْسِلْهُ مَعِىَ رِدْءًا يُصَدِّقُنِىٓ ۖ إِنِّىٓ أَخَافُ أَن يُكَذِّبُونِ",
      "en": "Aaron, my brother—he is more eloquent than me in speech. So send him with me as a helper to confirm me, for I fear that they will impugn me.’",
      "_n": 34
    },
    {
      "ar": "قَالَ سَنَشُدُّ عَضُدَكَ بِأَخِيكَ وَنَجْعَلُ لَكُمَا سُلْطَـٰنًا فَلَا يَصِلُونَ إِلَيْكُمَا ۚ بِـَٔايَـٰتِنَآ أَنتُمَا وَمَنِ ٱتَّبَعَكُمَا ٱلْغَـٰلِبُونَ",
      "en": "He said, ‘We will strengthen your arm by means of your brother, and invest both of you with such authority that they will not touch you. With the help of Our signs, you two, and those who follow the two of you, shall be the victors.’",
      "_n": 35
    },
    {
      "ar": "فَلَمَّا جَآءَهُم مُّوسَىٰ بِـَٔايَـٰتِنَا بَيِّنَـٰتٍ قَالُوا۟ مَا هَـٰذَآ إِلَّا سِحْرٌ مُّفْتَرًى وَمَا سَمِعْنَا بِهَـٰذَا فِىٓ ءَابَآئِنَا ٱلْأَوَّلِينَ",
      "en": "When Moses brought them Our manifest signs, they said, ‘This is nothing but concocted magic. We never heard of such a thing among our forefathers.’",
      "_n": 36
    },
    {
      "ar": "وَقَالَ مُوسَىٰ رَبِّىٓ أَعْلَمُ بِمَن جَآءَ بِٱلْهُدَىٰ مِنْ عِندِهِۦ وَمَن تَكُونُ لَهُۥ عَـٰقِبَةُ ٱلدَّارِ ۖ إِنَّهُۥ لَا يُفْلِحُ ٱلظَّـٰلِمُونَ",
      "en": "Moses said, ‘My Lord knows best who brings guidance from Him, and in whose favour the outcome of that abode will be. The wrongdoers will not be felicitous.’",
      "_n": 37
    },
    {
      "ar": "وَقَالَ فِرْعَوْنُ يَـٰٓأَيُّهَا ٱلْمَلَأُ مَا عَلِمْتُ لَكُم مِّنْ إِلَـٰهٍ غَيْرِى فَأَوْقِدْ لِى يَـٰهَـٰمَـٰنُ عَلَى ٱلطِّينِ فَٱجْعَل لِّى صَرْحًا لَّعَلِّىٓ أَطَّلِعُ إِلَىٰٓ إِلَـٰهِ مُوسَىٰ وَإِنِّى لَأَظُنُّهُۥ مِنَ ٱلْكَـٰذِبِينَ",
      "en": "Pharaoh said, ‘O [members of the] elite! I do not know of any god that you may have besides me. Haman, light for me a fire over clay, and build me a tower so that I may take a look at Moses’ god, and indeed I consider him to be a liar!’",
      "_n": 38
    },
    {
      "ar": "وَٱسْتَكْبَرَ هُوَ وَجُنُودُهُۥ فِى ٱلْأَرْضِ بِغَيْرِ ٱلْحَقِّ وَظَنُّوٓا۟ أَنَّهُمْ إِلَيْنَا لَا يُرْجَعُونَ",
      "en": "He and his hosts unduly acted arrogantly in the land, and thought they would not be brought back to Us.",
      "_n": 39
    },
    {
      "ar": "فَأَخَذْنَـٰهُ وَجُنُودَهُۥ فَنَبَذْنَـٰهُمْ فِى ٱلْيَمِّ ۖ فَٱنظُرْ كَيْفَ كَانَ عَـٰقِبَةُ ٱلظَّـٰلِمِينَ",
      "en": "So We seized him and his hosts, and threw them into the sea. So observe how was the fate of the wrongdoers!",
      "_n": 40
    },
    {
      "ar": "وَجَعَلْنَـٰهُمْ أَئِمَّةً يَدْعُونَ إِلَى ٱلنَّارِ ۖ وَيَوْمَ ٱلْقِيَـٰمَةِ لَا يُنصَرُونَ",
      "en": "We made them leaders who invite to the Fire, and on the Day of Resurrection they will not receive any help.",
      "_n": 41
    },
    {
      "ar": "وَأَتْبَعْنَـٰهُمْ فِى هَـٰذِهِ ٱلدُّنْيَا لَعْنَةً ۖ وَيَوْمَ ٱلْقِيَـٰمَةِ هُم مِّنَ ٱلْمَقْبُوحِينَ",
      "en": "We made a curse pursue them in this world, and on the Day of Resurrection they will be among the disfigured.",
      "_n": 42
    },
    {
      "ar": "وَلَقَدْ ءَاتَيْنَا مُوسَى ٱلْكِتَـٰبَ مِنۢ بَعْدِ مَآ أَهْلَكْنَا ٱلْقُرُونَ ٱلْأُولَىٰ بَصَآئِرَ لِلنَّاسِ وَهُدًى وَرَحْمَةً لَّعَلَّهُمْ يَتَذَكَّرُونَ",
      "en": "Certainly We gave Moses the Book, after We had destroyed the former generations, as [a set of] eye-openers, guidance and mercy for mankind, so that they may take admonition.",
      "_n": 43
    },
    {
      "ar": "وَمَا كُنتَ بِجَانِبِ ٱلْغَرْبِىِّ إِذْ قَضَيْنَآ إِلَىٰ مُوسَى ٱلْأَمْرَ وَمَا كُنتَ مِنَ ٱلشَّـٰهِدِينَ",
      "en": "You were not on the western side when We revealed the commandments to Moses, nor were you among the witnesses.",
      "_n": 44
    },
    {
      "ar": "وَلَـٰكِنَّآ أَنشَأْنَا قُرُونًا فَتَطَاوَلَ عَلَيْهِمُ ٱلْعُمُرُ ۚ وَمَا كُنتَ ثَاوِيًا فِىٓ أَهْلِ مَدْيَنَ تَتْلُوا۟ عَلَيْهِمْ ءَايَـٰتِنَا وَلَـٰكِنَّا كُنَّا مُرْسِلِينَ",
      "en": "But We brought forth other generations and time took its toll on them. You did not dwell among the people of Midian reciting to them Our signs, but it is We who are the senders [of the apostles].",
      "_n": 45
    },
    {
      "ar": "وَمَا كُنتَ بِجَانِبِ ٱلطُّورِ إِذْ نَادَيْنَا وَلَـٰكِن رَّحْمَةً مِّن رَّبِّكَ لِتُنذِرَ قَوْمًا مَّآ أَتَىٰهُم مِّن نَّذِيرٍ مِّن قَبْلِكَ لَعَلَّهُمْ يَتَذَكَّرُونَ",
      "en": "And you were not on the side of the Mount when We called out [to Moses], but [We have sent you as] a mercy from your Lord that you may warn a people to whom there did not come any warner before you, so that they may take admonition.",
      "_n": 46
    },
    {
      "ar": "وَلَوْلَآ أَن تُصِيبَهُم مُّصِيبَةٌۢ بِمَا قَدَّمَتْ أَيْدِيهِمْ فَيَقُولُوا۟ رَبَّنَا لَوْلَآ أَرْسَلْتَ إِلَيْنَا رَسُولًا فَنَتَّبِعَ ءَايَـٰتِكَ وَنَكُونَ مِنَ ٱلْمُؤْمِنِينَ",
      "en": "And lest—if an affliction were to befall them because of what their hands have sent ahead —they should say, ‘Our Lord! Why did You not send us an apostle so that we might have followed Your signs and been among the faithful?’",
      "_n": 47
    },
    {
      "ar": "فَلَمَّا جَآءَهُمُ ٱلْحَقُّ مِنْ عِندِنَا قَالُوا۟ لَوْلَآ أُوتِىَ مِثْلَ مَآ أُوتِىَ مُوسَىٰٓ ۚ أَوَلَمْ يَكْفُرُوا۟ بِمَآ أُوتِىَ مُوسَىٰ مِن قَبْلُ ۖ قَالُوا۟ سِحْرَانِ تَظَـٰهَرَا وَقَالُوٓا۟ إِنَّا بِكُلٍّ كَـٰفِرُونَ",
      "en": "But when there came to them the truth from Us, they said, ‘Why has he not been given the like of what Moses was given?’ Did they not disbelieve what Moses was given before, and said, ‘Two magicians abetting each other,’ and said, ‘Indeed we disbelieve both of them’?",
      "_n": 48
    },
    {
      "ar": "قُلْ فَأْتُوا۟ بِكِتَـٰبٍ مِّنْ عِندِ ٱللَّهِ هُوَ أَهْدَىٰ مِنْهُمَآ أَتَّبِعْهُ إِن كُنتُمْ صَـٰدِقِينَ",
      "en": "Say, ‘If you are truthful, bring some Book from Allah better in guidance than the two on them so that I may follow it.’",
      "_n": 49
    },
    {
      "ar": "فَإِن لَّمْ يَسْتَجِيبُوا۟ لَكَ فَٱعْلَمْ أَنَّمَا يَتَّبِعُونَ أَهْوَآءَهُمْ ۚ وَمَنْ أَضَلُّ مِمَّنِ ٱتَّبَعَ هَوَىٰهُ بِغَيْرِ هُدًى مِّنَ ٱللَّهِ ۚ إِنَّ ٱللَّهَ لَا يَهْدِى ٱلْقَوْمَ ٱلظَّـٰلِمِينَ",
      "en": "Then if they do not respond to you[r] [summons], know that they only follow their desires, and who is more astray than him who follows his desires without any guidance from Allah? Indeed Allah does not guide the wrongdoing lot.",
      "_n": 50
    },
    {
      "ar": "وَلَقَدْ وَصَّلْنَا لَهُمُ ٱلْقَوْلَ لَعَلَّهُمْ يَتَذَكَّرُونَ",
      "en": "Certainly We have carried on this discourse for them so that they may take admonition.",
      "_n": 51
    },
    {
      "ar": "ٱلَّذِينَ ءَاتَيْنَـٰهُمُ ٱلْكِتَـٰبَ مِن قَبْلِهِۦ هُم بِهِۦ يُؤْمِنُونَ",
      "en": "Those to whom We gave the Book before it are the ones who believe in it,",
      "_n": 52
    },
    {
      "ar": "وَإِذَا يُتْلَىٰ عَلَيْهِمْ قَالُوٓا۟ ءَامَنَّا بِهِۦٓ إِنَّهُ ٱلْحَقُّ مِن رَّبِّنَآ إِنَّا كُنَّا مِن قَبْلِهِۦ مُسْلِمِينَ",
      "en": "and when it is recited to them, they say, ‘We believe in it. It is indeed the truth from our Lord. Indeed we were Muslims [even] before it [came].’",
      "_n": 53
    },
    {
      "ar": "أُو۟لَـٰٓئِكَ يُؤْتَوْنَ أَجْرَهُم مَّرَّتَيْنِ بِمَا صَبَرُوا۟ وَيَدْرَءُونَ بِٱلْحَسَنَةِ ٱلسَّيِّئَةَ وَمِمَّا رَزَقْنَـٰهُمْ يُنفِقُونَ",
      "en": "Those will be given their reward two times for their patience. They repel evil [conduct] with good, and spend out of what We have provided them,",
      "_n": 54
    },
    {
      "ar": "وَإِذَا سَمِعُوا۟ ٱللَّغْوَ أَعْرَضُوا۟ عَنْهُ وَقَالُوا۟ لَنَآ أَعْمَـٰلُنَا وَلَكُمْ أَعْمَـٰلُكُمْ سَلَـٰمٌ عَلَيْكُمْ لَا نَبْتَغِى ٱلْجَـٰهِلِينَ",
      "en": "and when they hear vain talk, they avoid it and say, ‘Our deeds belong to us, and your deeds belong to you. Peace be to you. We do not court the ignorant.’",
      "_n": 55
    },
    {
      "ar": "إِنَّكَ لَا تَهْدِى مَنْ أَحْبَبْتَ وَلَـٰكِنَّ ٱللَّهَ يَهْدِى مَن يَشَآءُ ۚ وَهُوَ أَعْلَمُ بِٱلْمُهْتَدِينَ",
      "en": "You cannot guide whomever you wish, but [it is] Allah [who] guides whomever He wishes, and He knows best those who are guided.",
      "_n": 56
    },
    {
      "ar": "وَقَالُوٓا۟ إِن نَّتَّبِعِ ٱلْهُدَىٰ مَعَكَ نُتَخَطَّفْ مِنْ أَرْضِنَآ ۚ أَوَلَمْ نُمَكِّن لَّهُمْ حَرَمًا ءَامِنًا يُجْبَىٰٓ إِلَيْهِ ثَمَرَٰتُ كُلِّ شَىْءٍ رِّزْقًا مِّن لَّدُنَّا وَلَـٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ",
      "en": "They say, ‘If we follow the guidance with you, we will be forced out of our territory.’ Did We not establish a secure sanctuary for them where fruits of all kinds are brought as a provision from Us? But most of them do not know.",
      "_n": 57
    },
    {
      "ar": "وَكَمْ أَهْلَكْنَا مِن قَرْيَةٍۭ بَطِرَتْ مَعِيشَتَهَا ۖ فَتِلْكَ مَسَـٰكِنُهُمْ لَمْ تُسْكَن مِّنۢ بَعْدِهِمْ إِلَّا قَلِيلًا ۖ وَكُنَّا نَحْنُ ٱلْوَٰرِثِينَ",
      "en": "How many a town We have destroyed that exulted in its lifestyle! There lie their dwellings, uninhabited after them except by a few, and We were the [sole] inheritors.",
      "_n": 58
    },
    {
      "ar": "وَمَا كَانَ رَبُّكَ مُهْلِكَ ٱلْقُرَىٰ حَتَّىٰ يَبْعَثَ فِىٓ أُمِّهَا رَسُولًا يَتْلُوا۟ عَلَيْهِمْ ءَايَـٰتِنَا ۚ وَمَا كُنَّا مُهْلِكِى ٱلْقُرَىٰٓ إِلَّا وَأَهْلُهَا ظَـٰلِمُونَ",
      "en": "Your Lord would not destroy the towns until He had raised an apostle in their mother city to recite to them Our signs. We would never destroy the towns except when their people were wrongdoers.",
      "_n": 59
    },
    {
      "ar": "وَمَآ أُوتِيتُم مِّن شَىْءٍ فَمَتَـٰعُ ٱلْحَيَوٰةِ ٱلدُّنْيَا وَزِينَتُهَا ۚ وَمَا عِندَ ٱللَّهِ خَيْرٌ وَأَبْقَىٰٓ ۚ أَفَلَا تَعْقِلُونَ",
      "en": "Whatever things you have been given are only the wares of the life of this world and its glitter, and what is with Allah is better and more lasting. Will you not exercise your reason?",
      "_n": 60
    },
    {
      "ar": "أَفَمَن وَعَدْنَـٰهُ وَعْدًا حَسَنًا فَهُوَ لَـٰقِيهِ كَمَن مَّتَّعْنَـٰهُ مَتَـٰعَ ٱلْحَيَوٰةِ ٱلدُّنْيَا ثُمَّ هُوَ يَوْمَ ٱلْقِيَـٰمَةِ مِنَ ٱلْمُحْضَرِينَ",
      "en": "Is he to whom We have given a good promise, which he will receive, like him whom We have provided the wares of the life of this world, but who will be arraigned on the Day of Resurrection?",
      "_n": 61
    },
    {
      "ar": "وَيَوْمَ يُنَادِيهِمْ فَيَقُولُ أَيْنَ شُرَكَآءِىَ ٱلَّذِينَ كُنتُمْ تَزْعُمُونَ",
      "en": "The day He will call out to them and ask, ‘Where are My ‘partners’ that you used to claim?’",
      "_n": 62
    },
    {
      "ar": "قَالَ ٱلَّذِينَ حَقَّ عَلَيْهِمُ ٱلْقَوْلُ رَبَّنَا هَـٰٓؤُلَآءِ ٱلَّذِينَ أَغْوَيْنَآ أَغْوَيْنَـٰهُمْ كَمَا غَوَيْنَا ۖ تَبَرَّأْنَآ إِلَيْكَ ۖ مَا كَانُوٓا۟ إِيَّانَا يَعْبُدُونَ",
      "en": "Those against whom the word had become due will say, ‘Our Lord! These are the ones whom we have perverted. We perverted them as we were perverse ourselves. We repudiate them before You: it was not us that they worshipped.’",
      "_n": 63
    },
    {
      "ar": "وَقِيلَ ٱدْعُوا۟ شُرَكَآءَكُمْ فَدَعَوْهُمْ فَلَمْ يَسْتَجِيبُوا۟ لَهُمْ وَرَأَوُا۟ ٱلْعَذَابَ ۚ لَوْ أَنَّهُمْ كَانُوا۟ يَهْتَدُونَ",
      "en": "It will be said, ‘Invoke your partners!’ So they will invoke them, but they will not respond to them, and they will sight the punishment, wishing they had followed guidance.",
      "_n": 64
    },
    {
      "ar": "وَيَوْمَ يُنَادِيهِمْ فَيَقُولُ مَاذَآ أَجَبْتُمُ ٱلْمُرْسَلِينَ",
      "en": "The day He will call out to them and say, ‘What response did you give to the apostles?’",
      "_n": 65
    },
    {
      "ar": "فَعَمِيَتْ عَلَيْهِمُ ٱلْأَنۢبَآءُ يَوْمَئِذٍ فَهُمْ لَا يَتَسَآءَلُونَ",
      "en": "That day all information will be withheld from them, so they will not question one another.",
      "_n": 66
    },
    {
      "ar": "فَأَمَّا مَن تَابَ وَءَامَنَ وَعَمِلَ صَـٰلِحًا فَعَسَىٰٓ أَن يَكُونَ مِنَ ٱلْمُفْلِحِينَ",
      "en": "As for him who repents, has faith and acts righteously, maybe he will be among the felicitous.",
      "_n": 67
    },
    {
      "ar": "وَرَبُّكَ يَخْلُقُ مَا يَشَآءُ وَيَخْتَارُ ۗ مَا كَانَ لَهُمُ ٱلْخِيَرَةُ ۚ سُبْحَـٰنَ ٱللَّهِ وَتَعَـٰلَىٰ عَمَّا يُشْرِكُونَ",
      "en": "Your Lord creates whatever He wishes and chooses: they have no choice. Immaculate is Allah and exalted above [having] any partners that they ascribe [to Him].",
      "_n": 68
    },
    {
      "ar": "وَرَبُّكَ يَعْلَمُ مَا تُكِنُّ صُدُورُهُمْ وَمَا يُعْلِنُونَ",
      "en": "Your Lord knows whatever their breasts conceal, and whatever they disclose.",
      "_n": 69
    },
    {
      "ar": "وَهُوَ ٱللَّهُ لَآ إِلَـٰهَ إِلَّا هُوَ ۖ لَهُ ٱلْحَمْدُ فِى ٱلْأُولَىٰ وَٱلْـَٔاخِرَةِ ۖ وَلَهُ ٱلْحُكْمُ وَإِلَيْهِ تُرْجَعُونَ",
      "en": "He is Allah, there is no god except Him. All praise belongs to Him in this world and the Hereafter. All judgement belongs to Him, and to Him you will be brought back.",
      "_n": 70
    },
    {
      "ar": "قُلْ أَرَءَيْتُمْ إِن جَعَلَ ٱللَّهُ عَلَيْكُمُ ٱلَّيْلَ سَرْمَدًا إِلَىٰ يَوْمِ ٱلْقِيَـٰمَةِ مَنْ إِلَـٰهٌ غَيْرُ ٱللَّهِ يَأْتِيكُم بِضِيَآءٍ ۖ أَفَلَا تَسْمَعُونَ",
      "en": "Say, ‘Tell me, if Allah were to make the night perpetual for you until the Day of Resurrection, what god other than Allah can bring you light? Will you not listen?’",
      "_n": 71
    },
    {
      "ar": "قُلْ أَرَءَيْتُمْ إِن جَعَلَ ٱللَّهُ عَلَيْكُمُ ٱلنَّهَارَ سَرْمَدًا إِلَىٰ يَوْمِ ٱلْقِيَـٰمَةِ مَنْ إِلَـٰهٌ غَيْرُ ٱللَّهِ يَأْتِيكُم بِلَيْلٍ تَسْكُنُونَ فِيهِ ۖ أَفَلَا تُبْصِرُونَ",
      "en": "Say, ‘Tell me, if Allah were to make the day perpetual for you until the Day of Resurrection, what god other than Allah can bring you night wherein you can rest? Will you not perceive?’",
      "_n": 72
    },
    {
      "ar": "وَمِن رَّحْمَتِهِۦ جَعَلَ لَكُمُ ٱلَّيْلَ وَٱلنَّهَارَ لِتَسْكُنُوا۟ فِيهِ وَلِتَبْتَغُوا۟ مِن فَضْلِهِۦ وَلَعَلَّكُمْ تَشْكُرُونَ",
      "en": "He has made for you the night and the day out of His mercy, so that you may rest therein and that you may seek His bounty and so that you may give thanks.",
      "_n": 73
    },
    {
      "ar": "وَيَوْمَ يُنَادِيهِمْ فَيَقُولُ أَيْنَ شُرَكَآءِىَ ٱلَّذِينَ كُنتُمْ تَزْعُمُونَ",
      "en": "The day He will call out to them and say, ‘Where are My ‘partners’ that you used to claim?’",
      "_n": 74
    },
    {
      "ar": "وَنَزَعْنَا مِن كُلِّ أُمَّةٍ شَهِيدًا فَقُلْنَا هَاتُوا۟ بُرْهَـٰنَكُمْ فَعَلِمُوٓا۟ أَنَّ ٱلْحَقَّ لِلَّهِ وَضَلَّ عَنْهُم مَّا كَانُوا۟ يَفْتَرُونَ",
      "en": "We shall draw from every nation a witness and say, ‘Produce your evidence.’ Then they will know that all reality belongs to Allah and what they used to fabricate will forsake them.",
      "_n": 75
    },
    {
      "ar": "إِنَّ قَـٰرُونَ كَانَ مِن قَوْمِ مُوسَىٰ فَبَغَىٰ عَلَيْهِمْ ۖ وَءَاتَيْنَـٰهُ مِنَ ٱلْكُنُوزِ مَآ إِنَّ مَفَاتِحَهُۥ لَتَنُوٓأُ بِٱلْعُصْبَةِ أُو۟لِى ٱلْقُوَّةِ إِذْ قَالَ لَهُۥ قَوْمُهُۥ لَا تَفْرَحْ ۖ إِنَّ ٱللَّهَ لَا يُحِبُّ ٱلْفَرِحِينَ",
      "en": "Korah indeed belonged to the people of Moses, but he bullied them. We had given him so much treasures that their chests indeed proved heavy for a band of stalwarts. When his people said to him, ‘Do not boast! Indeed Allah does not like the boasters.",
      "_n": 76
    },
    {
      "ar": "وَٱبْتَغِ فِيمَآ ءَاتَىٰكَ ٱللَّهُ ٱلدَّارَ ٱلْـَٔاخِرَةَ ۖ وَلَا تَنسَ نَصِيبَكَ مِنَ ٱلدُّنْيَا ۖ وَأَحْسِن كَمَآ أَحْسَنَ ٱللَّهُ إِلَيْكَ ۖ وَلَا تَبْغِ ٱلْفَسَادَ فِى ٱلْأَرْضِ ۖ إِنَّ ٱللَّهَ لَا يُحِبُّ ٱلْمُفْسِدِينَ",
      "en": "Seek the abode of the Hereafter by means of what Allah has given you, while not forgetting your share of this world. Be good [to others] just as Allah has been good to you, and do not try to cause corruption in the land. Indeed Allah does not like the agents of corruption.’",
      "_n": 77
    },
    {
      "ar": "قَالَ إِنَّمَآ أُوتِيتُهُۥ عَلَىٰ عِلْمٍ عِندِىٓ ۚ أَوَلَمْ يَعْلَمْ أَنَّ ٱللَّهَ قَدْ أَهْلَكَ مِن قَبْلِهِۦ مِنَ ٱلْقُرُونِ مَنْ هُوَ أَشَدُّ مِنْهُ قُوَّةً وَأَكْثَرُ جَمْعًا ۚ وَلَا يُسْـَٔلُ عَن ذُنُوبِهِمُ ٱلْمُجْرِمُونَ",
      "en": "He said, ‘I have indeed been given [all] this because of the knowledge that I have.’ Did he not know that Allah had already destroyed before him some of the generations who were more powerful than him and greater in amassing [wealth]? The guilty will not be questioned about their sins.",
      "_n": 78
    },
    {
      "ar": "فَخَرَجَ عَلَىٰ قَوْمِهِۦ فِى زِينَتِهِۦ ۖ قَالَ ٱلَّذِينَ يُرِيدُونَ ٱلْحَيَوٰةَ ٱلدُّنْيَا يَـٰلَيْتَ لَنَا مِثْلَ مَآ أُوتِىَ قَـٰرُونُ إِنَّهُۥ لَذُو حَظٍّ عَظِيمٍ",
      "en": "So he emerged before his people in his finery. Those who desired the life of the world said, ‘We wish we had like what Korah has been given! Indeed he is greatly fortunate.’",
      "_n": 79
    },
    {
      "ar": "وَقَالَ ٱلَّذِينَ أُوتُوا۟ ٱلْعِلْمَ وَيْلَكُمْ ثَوَابُ ٱللَّهِ خَيْرٌ لِّمَنْ ءَامَنَ وَعَمِلَ صَـٰلِحًا وَلَا يُلَقَّىٰهَآ إِلَّا ٱلصَّـٰبِرُونَ",
      "en": "Those who were given knowledge said [to them], ‘Woe to you! Allah’s reward is better for someone who has faith and acts righteously, and no one will receive it except the patient.’",
      "_n": 80
    },
    {
      "ar": "فَخَسَفْنَا بِهِۦ وَبِدَارِهِ ٱلْأَرْضَ فَمَا كَانَ لَهُۥ مِن فِئَةٍ يَنصُرُونَهُۥ مِن دُونِ ٱللَّهِ وَمَا كَانَ مِنَ ٱلْمُنتَصِرِينَ",
      "en": "So We caused the earth to swallow him and his house, and he had no party that might protect him from Allah, nor could he rescue himself.",
      "_n": 81
    },
    {
      "ar": "وَأَصْبَحَ ٱلَّذِينَ تَمَنَّوْا۟ مَكَانَهُۥ بِٱلْأَمْسِ يَقُولُونَ وَيْكَأَنَّ ٱللَّهَ يَبْسُطُ ٱلرِّزْقَ لِمَن يَشَآءُ مِنْ عِبَادِهِۦ وَيَقْدِرُ ۖ لَوْلَآ أَن مَّنَّ ٱللَّهُ عَلَيْنَا لَخَسَفَ بِنَا ۖ وَيْكَأَنَّهُۥ لَا يُفْلِحُ ٱلْكَـٰفِرُونَ",
      "en": "By dawn those who longed to be in his place the day before were saying, ‘Don’t you see that Allah expands the provision for whomever He wishes of His servants, and tightens it? Had Allah not shown us favour, He might have made the earth swallow us too. Don’t you see that the faithless do not prosper?’",
      "_n": 82
    },
    {
      "ar": "تِلْكَ ٱلدَّارُ ٱلْـَٔاخِرَةُ نَجْعَلُهَا لِلَّذِينَ لَا يُرِيدُونَ عُلُوًّا فِى ٱلْأَرْضِ وَلَا فَسَادًا ۚ وَٱلْعَـٰقِبَةُ لِلْمُتَّقِينَ",
      "en": "This is the abode of the Hereafter, which We shall grant to those who do not desire to domineer in the earth nor to cause corruption, and the outcome will be in favour of the Godwary.",
      "_n": 83
    },
    {
      "ar": "مَن جَآءَ بِٱلْحَسَنَةِ فَلَهُۥ خَيْرٌ مِّنْهَا ۖ وَمَن جَآءَ بِٱلسَّيِّئَةِ فَلَا يُجْزَى ٱلَّذِينَ عَمِلُوا۟ ٱلسَّيِّـَٔاتِ إِلَّا مَا كَانُوا۟ يَعْمَلُونَ",
      "en": "Whoever brings virtue shall receive [a reward] better than it, but whoever brings vice—those who commit misdeeds shall not be requited except for what they used to do.",
      "_n": 84
    },
    {
      "ar": "إِنَّ ٱلَّذِى فَرَضَ عَلَيْكَ ٱلْقُرْءَانَ لَرَآدُّكَ إِلَىٰ مَعَادٍ ۚ قُل رَّبِّىٓ أَعْلَمُ مَن جَآءَ بِٱلْهُدَىٰ وَمَنْ هُوَ فِى ضَلَـٰلٍ مُّبِينٍ",
      "en": "Indeed He who has revealed to you the Quran will surely restore you to the place of return. Say, ‘My Lord knows best him who brings guidance and him who is in manifest error.’",
      "_n": 85
    },
    {
      "ar": "وَمَا كُنتَ تَرْجُوٓا۟ أَن يُلْقَىٰٓ إِلَيْكَ ٱلْكِتَـٰبُ إِلَّا رَحْمَةً مِّن رَّبِّكَ ۖ فَلَا تَكُونَنَّ ظَهِيرًا لِّلْكَـٰفِرِينَ",
      "en": "You did not expect that the Book would be delivered to you; but it was a mercy from your Lord. So do not be ever an advocate of the faithless.",
      "_n": 86
    },
    {
      "ar": "وَلَا يَصُدُّنَّكَ عَنْ ءَايَـٰتِ ٱللَّهِ بَعْدَ إِذْ أُنزِلَتْ إِلَيْكَ ۖ وَٱدْعُ إِلَىٰ رَبِّكَ ۖ وَلَا تَكُونَنَّ مِنَ ٱلْمُشْرِكِينَ",
      "en": "Do not ever let them bar you from Allah’s signs after they have been sent down to you. Invite to your Lord, and never be one of the polytheists.",
      "_n": 87
    },
    {
      "ar": "وَلَا تَدْعُ مَعَ ٱللَّهِ إِلَـٰهًا ءَاخَرَ ۘ لَآ إِلَـٰهَ إِلَّا هُوَ ۚ كُلُّ شَىْءٍ هَالِكٌ إِلَّا وَجْهَهُۥ ۚ لَهُ ٱلْحُكْمُ وَإِلَيْهِ تُرْجَعُونَ",
      "en": "And do not invoke another god besides Allah; there is no god except Him. Everything is to perish except His Face. All judgement belongs to Him, and to Him you will be brought back.",
      "_n": 88
    }
  ],
  "_n": 28,
  "_c": 88
}