{
  "ar": "آل عمران",
  "en": "The Family of Imraan",
  "_a": "Aal-i-Imraan",
  "_l": "Medinan",
  "_v": [
    {
      "ar": "الٓمٓ",
      "en": "Alif, Lam, Mim.",
      "_n": 1
    },
    {
      "ar": "ٱللَّهُ لَآ إِلَـٰهَ إِلَّا هُوَ ٱلْحَىُّ ٱلْقَيُّومُ",
      "en": "Allah—there is no god except Him—is the Living One, the All-sustainer.",
      "_n": 2
    },
    {
      "ar": "نَزَّلَ عَلَيْكَ ٱلْكِتَـٰبَ بِٱلْحَقِّ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ وَأَنزَلَ ٱلتَّوْرَىٰةَ وَٱلْإِنجِيلَ",
      "en": "He has sent down to you the Book with the truth, confirming what was [revealed] before it, and He had sent down the Torah and the Evangel",
      "_n": 3
    },
    {
      "ar": "مِن قَبْلُ هُدًى لِّلنَّاسِ وَأَنزَلَ ٱلْفُرْقَانَ ۗ إِنَّ ٱلَّذِينَ كَفَرُوا۟ بِـَٔايَـٰتِ ٱللَّهِ لَهُمْ عَذَابٌ شَدِيدٌ ۗ وَٱللَّهُ عَزِيزٌ ذُو ٱنتِقَامٍ",
      "en": "before as guidance for mankind, and He has sent down the Criterion. Indeed, there is a severe punishment for those who deny the signs of Allah, and Allah is all-mighty, avenger.",
      "_n": 4
    },
    {
      "ar": "إِنَّ ٱللَّهَ لَا يَخْفَىٰ عَلَيْهِ شَىْءٌ فِى ٱلْأَرْضِ وَلَا فِى ٱلسَّمَآءِ",
      "en": "Nothing is indeed hidden from Allah in the earth or in the sky.",
      "_n": 5
    },
    {
      "ar": "هُوَ ٱلَّذِى يُصَوِّرُكُمْ فِى ٱلْأَرْحَامِ كَيْفَ يَشَآءُ ۚ لَآ إِلَـٰهَ إِلَّا هُوَ ٱلْعَزِيزُ ٱلْحَكِيمُ",
      "en": "It is He who forms you in the wombs [of your mothers] however He wishes. There is no god except Him, the All-mighty, the All-wise.",
      "_n": 6
    },
    {
      "ar": "هُوَ ٱلَّذِىٓ أَنزَلَ عَلَيْكَ ٱلْكِتَـٰبَ مِنْهُ ءَايَـٰتٌ مُّحْكَمَـٰتٌ هُنَّ أُمُّ ٱلْكِتَـٰبِ وَأُخَرُ مُتَشَـٰبِهَـٰتٌ ۖ فَأَمَّا ٱلَّذِينَ فِى قُلُوبِهِمْ زَيْغٌ فَيَتَّبِعُونَ مَا تَشَـٰبَهَ مِنْهُ ٱبْتِغَآءَ ٱلْفِتْنَةِ وَٱبْتِغَآءَ تَأْوِيلِهِۦ ۗ وَمَا يَعْلَمُ تَأْوِيلَهُۥٓ إِلَّا ٱللَّهُ ۗ وَٱلرَّٰسِخُونَ فِى ٱلْعِلْمِ يَقُولُونَ ءَامَنَّا بِهِۦ كُلٌّ مِّنْ عِندِ رَبِّنَا ۗ وَمَا يَذَّكَّرُ إِلَّآ أُو۟لُوا۟ ٱلْأَلْبَـٰبِ",
      "en": "It is He who has sent down to you the Book. Parts of it are definitive verses, which are the mother of the Book, while others are metaphorical. As for those in whose hearts is deviance, they pursue what is metaphorical in it, courting temptation, and seeking its interpretation. But no one knows its interpretation except Allah and those firmly grounded in knowledge; they say, ‘We believe in it; all of it is from our Lord.’ And none takes admonition except those who possess intellect.",
      "_n": 7
    },
    {
      "ar": "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً ۚ إِنَّكَ أَنتَ ٱلْوَهَّابُ",
      "en": "[They say,] ‘Our Lord! Do not make our hearts swerve after You have guided us, and bestow Your mercy on us. Indeed, You are the All-munificent.",
      "_n": 8
    },
    {
      "ar": "رَبَّنَآ إِنَّكَ جَامِعُ ٱلنَّاسِ لِيَوْمٍ لَّا رَيْبَ فِيهِ ۚ إِنَّ ٱللَّهَ لَا يُخْلِفُ ٱلْمِيعَادَ",
      "en": "Our Lord! You will indeed gather mankind on a day in which there is no doubt. Indeed Allah does not break His promise.’",
      "_n": 9
    },
    {
      "ar": "إِنَّ ٱلَّذِينَ كَفَرُوا۟ لَن تُغْنِىَ عَنْهُمْ أَمْوَٰلُهُمْ وَلَآ أَوْلَـٰدُهُم مِّنَ ٱللَّهِ شَيْـًٔا ۖ وَأُو۟لَـٰٓئِكَ هُمْ وَقُودُ ٱلنَّارِ",
      "en": "As for the faithless, neither their wealth nor their children shall avail them anything against Allah; it is they who will be fuel for the Fire;",
      "_n": 10
    },
    {
      "ar": "كَدَأْبِ ءَالِ فِرْعَوْنَ وَٱلَّذِينَ مِن قَبْلِهِمْ ۚ كَذَّبُوا۟ بِـَٔايَـٰتِنَا فَأَخَذَهُمُ ٱللَّهُ بِذُنُوبِهِمْ ۗ وَٱللَّهُ شَدِيدُ ٱلْعِقَابِ",
      "en": "as in the case of Pharaoh’s clan and those who were before them, who denied Our signs. So Allah seized them for their sins, and Allah is severe in retribution.",
      "_n": 11
    },
    {
      "ar": "قُل لِّلَّذِينَ كَفَرُوا۟ سَتُغْلَبُونَ وَتُحْشَرُونَ إِلَىٰ جَهَنَّمَ ۚ وَبِئْسَ ٱلْمِهَادُ",
      "en": "Say to the faithless, ‘You shall be overcome and mustered toward hell, and it is an evil resting place.’",
      "_n": 12
    },
    {
      "ar": "قَدْ كَانَ لَكُمْ ءَايَةٌ فِى فِئَتَيْنِ ٱلْتَقَتَا ۖ فِئَةٌ تُقَـٰتِلُ فِى سَبِيلِ ٱللَّهِ وَأُخْرَىٰ كَافِرَةٌ يَرَوْنَهُم مِّثْلَيْهِمْ رَأْىَ ٱلْعَيْنِ ۚ وَٱللَّهُ يُؤَيِّدُ بِنَصْرِهِۦ مَن يَشَآءُ ۗ إِنَّ فِى ذَٰلِكَ لَعِبْرَةً لِّأُو۟لِى ٱلْأَبْصَـٰرِ",
      "en": "There was certainly a sign for you in the two hosts that met: one host fighting in the way of Allah and the other faithless, who saw them as visibly twice as many. Allah strengthens whomever He wishes with His help. There is indeed a moral in that for those who have insight.",
      "_n": 13
    },
    {
      "ar": "زُيِّنَ لِلنَّاسِ حُبُّ ٱلشَّهَوَٰتِ مِنَ ٱلنِّسَآءِ وَٱلْبَنِينَ وَٱلْقَنَـٰطِيرِ ٱلْمُقَنطَرَةِ مِنَ ٱلذَّهَبِ وَٱلْفِضَّةِ وَٱلْخَيْلِ ٱلْمُسَوَّمَةِ وَٱلْأَنْعَـٰمِ وَٱلْحَرْثِ ۗ ذَٰلِكَ مَتَـٰعُ ٱلْحَيَوٰةِ ٱلدُّنْيَا ۖ وَٱللَّهُ عِندَهُۥ حُسْنُ ٱلْمَـَٔابِ",
      "en": "The love of [worldly] allures, including women and children, accumulated piles of gold and silver, horses of mark, livestock, and farms has been made to seem decorous to mankind. Those are the wares of the life of this world, but the goodness of one’s ultimate destination lies near Allah.",
      "_n": 14
    },
    {
      "ar": "قُلْ أَؤُنَبِّئُكُم بِخَيْرٍ مِّن ذَٰلِكُمْ ۚ لِلَّذِينَ ٱتَّقَوْا۟ عِندَ رَبِّهِمْ جَنَّـٰتٌ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَا وَأَزْوَٰجٌ مُّطَهَّرَةٌ وَرِضْوَٰنٌ مِّنَ ٱللَّهِ ۗ وَٱللَّهُ بَصِيرٌۢ بِٱلْعِبَادِ",
      "en": "Say, ‘Shall I inform you of something better than that? For those who are Godwary there will be gardens near their Lord, with streams running in them, to remain in them [forever], and chaste mates, and Allah’s pleasure.’ And Allah watches His servants.",
      "_n": 15
    },
    {
      "ar": "ٱلَّذِينَ يَقُولُونَ رَبَّنَآ إِنَّنَآ ءَامَنَّا فَٱغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ ٱلنَّارِ",
      "en": "Those who say, ‘Our Lord! Indeed, we have faith. So forgive us our sins, and save us from the punishment of the Fire.’",
      "_n": 16
    },
    {
      "ar": "ٱلصَّـٰبِرِينَ وَٱلصَّـٰدِقِينَ وَٱلْقَـٰنِتِينَ وَٱلْمُنفِقِينَ وَٱلْمُسْتَغْفِرِينَ بِٱلْأَسْحَارِ",
      "en": "[They are] patient and truthful, obedient and charitable, and they plead for [Allah’s] forgiveness at dawns.",
      "_n": 17
    },
    {
      "ar": "شَهِدَ ٱللَّهُ أَنَّهُۥ لَآ إِلَـٰهَ إِلَّا هُوَ وَٱلْمَلَـٰٓئِكَةُ وَأُو۟لُوا۟ ٱلْعِلْمِ قَآئِمًۢا بِٱلْقِسْطِ ۚ لَآ إِلَـٰهَ إِلَّا هُوَ ٱلْعَزِيزُ ٱلْحَكِيمُ",
      "en": "Allah, maintainer of justice, the Almighty and the All-wise, besides whom there is no god, bears witness that there is no god except Him, and [so do] the angels and those who possess knowledge.",
      "_n": 18
    },
    {
      "ar": "إِنَّ ٱلدِّينَ عِندَ ٱللَّهِ ٱلْإِسْلَـٰمُ ۗ وَمَا ٱخْتَلَفَ ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَـٰبَ إِلَّا مِنۢ بَعْدِ مَا جَآءَهُمُ ٱلْعِلْمُ بَغْيًۢا بَيْنَهُمْ ۗ وَمَن يَكْفُرْ بِـَٔايَـٰتِ ٱللَّهِ فَإِنَّ ٱللَّهَ سَرِيعُ ٱلْحِسَابِ",
      "en": "Indeed, with Allah religion is Islam, and those who were given the Book did not differ except after knowledge had come to them, out of envy among themselves. And whoever denies Allah’s signs [should know that] Allah is swift at reckoning.",
      "_n": 19
    },
    {
      "ar": "فَإِنْ حَآجُّوكَ فَقُلْ أَسْلَمْتُ وَجْهِىَ لِلَّهِ وَمَنِ ٱتَّبَعَنِ ۗ وَقُل لِّلَّذِينَ أُوتُوا۟ ٱلْكِتَـٰبَ وَٱلْأُمِّيِّـۧنَ ءَأَسْلَمْتُمْ ۚ فَإِنْ أَسْلَمُوا۟ فَقَدِ ٱهْتَدَوا۟ ۖ وَّإِن تَوَلَّوْا۟ فَإِنَّمَا عَلَيْكَ ٱلْبَلَـٰغُ ۗ وَٱللَّهُ بَصِيرٌۢ بِٱلْعِبَادِ",
      "en": "If they argue with you, say, ‘I have submitted my will to Allah, and [so has] he who follows me.’ And say to those who were given the Book and the uninstructed ones, ‘Do you submit?’ If they submit, they will certainly be guided; but if they turn away, then your duty is only to communicate, and Allah watches His servants.",
      "_n": 20
    },
    {
      "ar": "إِنَّ ٱلَّذِينَ يَكْفُرُونَ بِـَٔايَـٰتِ ٱللَّهِ وَيَقْتُلُونَ ٱلنَّبِيِّـۧنَ بِغَيْرِ حَقٍّ وَيَقْتُلُونَ ٱلَّذِينَ يَأْمُرُونَ بِٱلْقِسْطِ مِنَ ٱلنَّاسِ فَبَشِّرْهُم بِعَذَابٍ أَلِيمٍ",
      "en": "Those who deny Allah’s signs and kill the prophets unjustly and kill those who call for justice from among the people, inform them of a painful punishment.",
      "_n": 21
    },
    {
      "ar": "أُو۟لَـٰٓئِكَ ٱلَّذِينَ حَبِطَتْ أَعْمَـٰلُهُمْ فِى ٱلدُّنْيَا وَٱلْـَٔاخِرَةِ وَمَا لَهُم مِّن نَّـٰصِرِينَ",
      "en": "They are the ones whose works have failed in this world and the Hereafter, and they will have no helpers.",
      "_n": 22
    },
    {
      "ar": "أَلَمْ تَرَ إِلَى ٱلَّذِينَ أُوتُوا۟ نَصِيبًا مِّنَ ٱلْكِتَـٰبِ يُدْعَوْنَ إِلَىٰ كِتَـٰبِ ٱللَّهِ لِيَحْكُمَ بَيْنَهُمْ ثُمَّ يَتَوَلَّىٰ فَرِيقٌ مِّنْهُمْ وَهُم مُّعْرِضُونَ",
      "en": "Have you not regarded those who were given a share of the Book, who are summoned to the Book of Allah in order that it may judge between them, whereat a part of them refuse to comply and they are disregardful?",
      "_n": 23
    },
    {
      "ar": "ذَٰلِكَ بِأَنَّهُمْ قَالُوا۟ لَن تَمَسَّنَا ٱلنَّارُ إِلَّآ أَيَّامًا مَّعْدُودَٰتٍ ۖ وَغَرَّهُمْ فِى دِينِهِم مَّا كَانُوا۟ يَفْتَرُونَ",
      "en": "That is because they say, ‘The Fire shall not touch us except for a number of days,’ and they have been misled in their religion by what they used to fabricate.",
      "_n": 24
    },
    {
      "ar": "فَكَيْفَ إِذَا جَمَعْنَـٰهُمْ لِيَوْمٍ لَّا رَيْبَ فِيهِ وَوُفِّيَتْ كُلُّ نَفْسٍ مَّا كَسَبَتْ وَهُمْ لَا يُظْلَمُونَ",
      "en": "But how will it be [with them] when We gather them on a day in which there is no doubt, and every soul shall be recompensed fully for what it has earned, and they will not be wronged?",
      "_n": 25
    },
    {
      "ar": "قُلِ ٱللَّهُمَّ مَـٰلِكَ ٱلْمُلْكِ تُؤْتِى ٱلْمُلْكَ مَن تَشَآءُ وَتَنزِعُ ٱلْمُلْكَ مِمَّن تَشَآءُ وَتُعِزُّ مَن تَشَآءُ وَتُذِلُّ مَن تَشَآءُ ۖ بِيَدِكَ ٱلْخَيْرُ ۖ إِنَّكَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ",
      "en": "Say, ‘O Allah, Master of all sovereignty! You give sovereignty to whomever You wish, and strip of sovereignty whomever You wish; You make mighty whomever You wish, and You degrade whomever You wish; all choice is in Your hand. Indeed You have power over all things.’",
      "_n": 26
    },
    {
      "ar": "تُولِجُ ٱلَّيْلَ فِى ٱلنَّهَارِ وَتُولِجُ ٱلنَّهَارَ فِى ٱلَّيْلِ ۖ وَتُخْرِجُ ٱلْحَىَّ مِنَ ٱلْمَيِّتِ وَتُخْرِجُ ٱلْمَيِّتَ مِنَ ٱلْحَىِّ ۖ وَتَرْزُقُ مَن تَشَآءُ بِغَيْرِ حِسَابٍ",
      "en": "‘You make the night pass into the day and You make the day pass into the night. You bring forth the living from the dead and You bring forth the dead from the living, and You provide for whomever You wish without any reckoning.’",
      "_n": 27
    },
    {
      "ar": "لَّا يَتَّخِذِ ٱلْمُؤْمِنُونَ ٱلْكَـٰفِرِينَ أَوْلِيَآءَ مِن دُونِ ٱلْمُؤْمِنِينَ ۖ وَمَن يَفْعَلْ ذَٰلِكَ فَلَيْسَ مِنَ ٱللَّهِ فِى شَىْءٍ إِلَّآ أَن تَتَّقُوا۟ مِنْهُمْ تُقَىٰةً ۗ وَيُحَذِّرُكُمُ ٱللَّهُ نَفْسَهُۥ ۗ وَإِلَى ٱللَّهِ ٱلْمَصِيرُ",
      "en": "The faithful should not take the faithless for allies instead of the faithful, and Allah will have nothing to do with those who do that, except when you are wary of them, out of caution. Allah warns you to beware of [disobeying] Him, and toward Allah is the return.",
      "_n": 28
    },
    {
      "ar": "قُلْ إِن تُخْفُوا۟ مَا فِى صُدُورِكُمْ أَوْ تُبْدُوهُ يَعْلَمْهُ ٱللَّهُ ۗ وَيَعْلَمُ مَا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۗ وَٱللَّهُ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ",
      "en": "Say, ‘Whether you hide what is in your hearts or disclose it, Allah knows it, and He knows whatever there is in the heavens and whatever there is in the earth; and Allah has power over all things.’",
      "_n": 29
    },
    {
      "ar": "يَوْمَ تَجِدُ كُلُّ نَفْسٍ مَّا عَمِلَتْ مِنْ خَيْرٍ مُّحْضَرًا وَمَا عَمِلَتْ مِن سُوٓءٍ تَوَدُّ لَوْ أَنَّ بَيْنَهَا وَبَيْنَهُۥٓ أَمَدًۢا بَعِيدًا ۗ وَيُحَذِّرُكُمُ ٱللَّهُ نَفْسَهُۥ ۗ وَٱللَّهُ رَءُوفٌۢ بِٱلْعِبَادِ",
      "en": "The day when every soul will find present whatever good it has done; and as for the evil, it has done, it will wish there were a far distance between it and itself. Allah warns you to beware of [disobeying] Him, and Allah is most kind to [His] servants.",
      "_n": 30
    },
    {
      "ar": "قُلْ إِن كُنتُمْ تُحِبُّونَ ٱللَّهَ فَٱتَّبِعُونِى يُحْبِبْكُمُ ٱللَّهُ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ ۗ وَٱللَّهُ غَفُورٌ رَّحِيمٌ",
      "en": "Say, ‘If you love Allah, then follow me; Allah will love you and forgive you your sins, and Allah is all-forgiving, all-merciful.’",
      "_n": 31
    },
    {
      "ar": "قُلْ أَطِيعُوا۟ ٱللَّهَ وَٱلرَّسُولَ ۖ فَإِن تَوَلَّوْا۟ فَإِنَّ ٱللَّهَ لَا يُحِبُّ ٱلْكَـٰفِرِينَ",
      "en": "Say, ‘Obey Allah and the Apostle.’ But if they turn away, indeed Allah does not like the faithless.",
      "_n": 32
    },
    {
      "ar": "إِنَّ ٱللَّهَ ٱصْطَفَىٰٓ ءَادَمَ وَنُوحًا وَءَالَ إِبْرَٰهِيمَ وَءَالَ عِمْرَٰنَ عَلَى ٱلْعَـٰلَمِينَ",
      "en": "Indeed Allah chose Adam and Noah, and the progeny of Abraham and the progeny of Imran above all the nations;",
      "_n": 33
    },
    {
      "ar": "ذُرِّيَّةًۢ بَعْضُهَا مِنۢ بَعْضٍ ۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ",
      "en": "some of them are descendants of the others, and Allah is all-hearing, all-knowing.",
      "_n": 34
    },
    {
      "ar": "إِذْ قَالَتِ ٱمْرَأَتُ عِمْرَٰنَ رَبِّ إِنِّى نَذَرْتُ لَكَ مَا فِى بَطْنِى مُحَرَّرًا فَتَقَبَّلْ مِنِّىٓ ۖ إِنَّكَ أَنتَ ٱلسَّمِيعُ ٱلْعَلِيمُ",
      "en": "When the wife of Imran said, ‘My Lord, I dedicate to You in consecration what is in my belly. Accept it from me; indeed You are the All-hearing, the All-knowing.’",
      "_n": 35
    },
    {
      "ar": "فَلَمَّا وَضَعَتْهَا قَالَتْ رَبِّ إِنِّى وَضَعْتُهَآ أُنثَىٰ وَٱللَّهُ أَعْلَمُ بِمَا وَضَعَتْ وَلَيْسَ ٱلذَّكَرُ كَٱلْأُنثَىٰ ۖ وَإِنِّى سَمَّيْتُهَا مَرْيَمَ وَإِنِّىٓ أُعِيذُهَا بِكَ وَذُرِّيَّتَهَا مِنَ ٱلشَّيْطَـٰنِ ٱلرَّجِيمِ",
      "en": "When she bore her, she said, ‘My Lord, I have borne a female [child]’—and Allah knew better what she had borne, and the male [child she expected] was no match for the female [child she had borne] —‘and I have named her Mary, and I commend her and her offspring to Your care against [the evil of] the outcast Satan.’",
      "_n": 36
    },
    {
      "ar": "فَتَقَبَّلَهَا رَبُّهَا بِقَبُولٍ حَسَنٍ وَأَنۢبَتَهَا نَبَاتًا حَسَنًا وَكَفَّلَهَا زَكَرِيَّا ۖ كُلَّمَا دَخَلَ عَلَيْهَا زَكَرِيَّا ٱلْمِحْرَابَ وَجَدَ عِندَهَا رِزْقًا ۖ قَالَ يَـٰمَرْيَمُ أَنَّىٰ لَكِ هَـٰذَا ۖ قَالَتْ هُوَ مِنْ عِندِ ٱللَّهِ ۖ إِنَّ ٱللَّهَ يَرْزُقُ مَن يَشَآءُ بِغَيْرِ حِسَابٍ",
      "en": "Thereupon her Lord accepted her with a gracious acceptance, and made her grow up in a worthy fashion, and He charged Zechariah with her care. Whenever Zechariah visited her in the sanctuary, he would find provisions with her. He said, ‘O Mary, from where does this come for you?’ She said, ‘It comes from Allah. Allah provides whomever He wishes without any reckoning.’",
      "_n": 37
    },
    {
      "ar": "هُنَالِكَ دَعَا زَكَرِيَّا رَبَّهُۥ ۖ قَالَ رَبِّ هَبْ لِى مِن لَّدُنكَ ذُرِّيَّةً طَيِّبَةً ۖ إِنَّكَ سَمِيعُ ٱلدُّعَآءِ",
      "en": "Thereat Zechariah supplicated his Lord. He said, ‘My Lord! Grant me a good offspring from You! Indeed You hear all supplications.’",
      "_n": 38
    },
    {
      "ar": "فَنَادَتْهُ ٱلْمَلَـٰٓئِكَةُ وَهُوَ قَآئِمٌ يُصَلِّى فِى ٱلْمِحْرَابِ أَنَّ ٱللَّهَ يُبَشِّرُكَ بِيَحْيَىٰ مُصَدِّقًۢا بِكَلِمَةٍ مِّنَ ٱللَّهِ وَسَيِّدًا وَحَصُورًا وَنَبِيًّا مِّنَ ٱلصَّـٰلِحِينَ",
      "en": "Then, as he stood praying in the sanctuary the angels called out to him: ‘Allah gives you the good news of John, as a confirmer of a Word of Allah, eminent and chaste, a prophet, and one of the righteous.’",
      "_n": 39
    },
    {
      "ar": "قَالَ رَبِّ أَنَّىٰ يَكُونُ لِى غُلَـٰمٌ وَقَدْ بَلَغَنِىَ ٱلْكِبَرُ وَٱمْرَأَتِى عَاقِرٌ ۖ قَالَ كَذَٰلِكَ ٱللَّهُ يَفْعَلُ مَا يَشَآءُ",
      "en": "He said, ‘My Lord, how shall I have a son while old age has overtaken me and my wife is barren?’ Said He, ‘So it is that Allah does whatever He wishes.’",
      "_n": 40
    },
    {
      "ar": "قَالَ رَبِّ ٱجْعَل لِّىٓ ءَايَةً ۖ قَالَ ءَايَتُكَ أَلَّا تُكَلِّمَ ٱلنَّاسَ ثَلَـٰثَةَ أَيَّامٍ إِلَّا رَمْزًا ۗ وَٱذْكُر رَّبَّكَ كَثِيرًا وَسَبِّحْ بِٱلْعَشِىِّ وَٱلْإِبْكَـٰرِ",
      "en": "He said, ‘My Lord, grant me a sign.’ Said He, ‘Your sign is that you will not speak to people for three days except in gestures. Remember Your Lord much, and glorify Him morning and evening.’",
      "_n": 41
    },
    {
      "ar": "وَإِذْ قَالَتِ ٱلْمَلَـٰٓئِكَةُ يَـٰمَرْيَمُ إِنَّ ٱللَّهَ ٱصْطَفَىٰكِ وَطَهَّرَكِ وَٱصْطَفَىٰكِ عَلَىٰ نِسَآءِ ٱلْعَـٰلَمِينَ",
      "en": "And when the angels said, ‘O Mary, Allah has chosen you and purified you, and He has chosen you above the world’s women.",
      "_n": 42
    },
    {
      "ar": "يَـٰمَرْيَمُ ٱقْنُتِى لِرَبِّكِ وَٱسْجُدِى وَٱرْكَعِى مَعَ ٱلرَّٰكِعِينَ",
      "en": "O Mary, be obedient to your Lord and prostrate and bow down with those who bow [in worship].’",
      "_n": 43
    },
    {
      "ar": "ذَٰلِكَ مِنْ أَنۢبَآءِ ٱلْغَيْبِ نُوحِيهِ إِلَيْكَ ۚ وَمَا كُنتَ لَدَيْهِمْ إِذْ يُلْقُونَ أَقْلَـٰمَهُمْ أَيُّهُمْ يَكْفُلُ مَرْيَمَ وَمَا كُنتَ لَدَيْهِمْ إِذْ يَخْتَصِمُونَ",
      "en": "These accounts are from the Unseen, which We reveal to you, and you were not with them when they were casting lots [to see] which of them would take charge of Mary’s care, nor were you with them when they were contending.",
      "_n": 44
    },
    {
      "ar": "إِذْ قَالَتِ ٱلْمَلَـٰٓئِكَةُ يَـٰمَرْيَمُ إِنَّ ٱللَّهَ يُبَشِّرُكِ بِكَلِمَةٍ مِّنْهُ ٱسْمُهُ ٱلْمَسِيحُ عِيسَى ٱبْنُ مَرْيَمَ وَجِيهًا فِى ٱلدُّنْيَا وَٱلْـَٔاخِرَةِ وَمِنَ ٱلْمُقَرَّبِينَ",
      "en": "When the angels said, ‘O Mary, Allah gives you the good news of a Word from Him whose name is Messiah, Jesus son of Mary, distinguished in the world and the Hereafter and one of those brought near [to Allah].",
      "_n": 45
    },
    {
      "ar": "وَيُكَلِّمُ ٱلنَّاسَ فِى ٱلْمَهْدِ وَكَهْلًا وَمِنَ ٱلصَّـٰلِحِينَ",
      "en": "He will speak to the people in the cradle and in adulthood, and will be one of the righteous.’",
      "_n": 46
    },
    {
      "ar": "قَالَتْ رَبِّ أَنَّىٰ يَكُونُ لِى وَلَدٌ وَلَمْ يَمْسَسْنِى بَشَرٌ ۖ قَالَ كَذَٰلِكِ ٱللَّهُ يَخْلُقُ مَا يَشَآءُ ۚ إِذَا قَضَىٰٓ أَمْرًا فَإِنَّمَا يَقُولُ لَهُۥ كُن فَيَكُونُ",
      "en": "She said, ‘My Lord, how shall I have a child seeing that no human has ever touched me?’ He said, ‘So it is that Allah creates whatever He wishes. When He decides on a matter He just says to it ‘‘Be!’’ and it is.",
      "_n": 47
    },
    {
      "ar": "وَيُعَلِّمُهُ ٱلْكِتَـٰبَ وَٱلْحِكْمَةَ وَٱلتَّوْرَىٰةَ وَٱلْإِنجِيلَ",
      "en": "He will teach him the Book and wisdom, the Torah and the Evangel,",
      "_n": 48
    },
    {
      "ar": "وَرَسُولًا إِلَىٰ بَنِىٓ إِسْرَٰٓءِيلَ أَنِّى قَدْ جِئْتُكُم بِـَٔايَةٍ مِّن رَّبِّكُمْ ۖ أَنِّىٓ أَخْلُقُ لَكُم مِّنَ ٱلطِّينِ كَهَيْـَٔةِ ٱلطَّيْرِ فَأَنفُخُ فِيهِ فَيَكُونُ طَيْرًۢا بِإِذْنِ ٱللَّهِ ۖ وَأُبْرِئُ ٱلْأَكْمَهَ وَٱلْأَبْرَصَ وَأُحْىِ ٱلْمَوْتَىٰ بِإِذْنِ ٱللَّهِ ۖ وَأُنَبِّئُكُم بِمَا تَأْكُلُونَ وَمَا تَدَّخِرُونَ فِى بُيُوتِكُمْ ۚ إِنَّ فِى ذَٰلِكَ لَـَٔايَةً لَّكُمْ إِن كُنتُم مُّؤْمِنِينَ",
      "en": "and [he will be] an apostle to the Children of Israel, [and he will declare,] “I have certainly brought you a sign from your Lord: I will create for you the form of a bird out of clay, then I will breathe into it, and it will become a bird by Allah’s leave. I heal the blind and the leper and I revive the dead by Allah’s leave. I will tell you what you have eaten and what you have stored in your houses. There is indeed a sign in that for you, should you be faithful.",
      "_n": 49
    },
    {
      "ar": "وَمُصَدِّقًا لِّمَا بَيْنَ يَدَىَّ مِنَ ٱلتَّوْرَىٰةِ وَلِأُحِلَّ لَكُم بَعْضَ ٱلَّذِى حُرِّمَ عَلَيْكُمْ ۚ وَجِئْتُكُم بِـَٔايَةٍ مِّن رَّبِّكُمْ فَٱتَّقُوا۟ ٱللَّهَ وَأَطِيعُونِ",
      "en": "And [I come] to confirm [the truth of] that which is before me of the Torah, and to make lawful for you some of the things that were forbidden you. I have brought you a sign from your Lord; so be wary of Allah and obey me.",
      "_n": 50
    },
    {
      "ar": "إِنَّ ٱللَّهَ رَبِّى وَرَبُّكُمْ فَٱعْبُدُوهُ ۗ هَـٰذَا صِرَٰطٌ مُّسْتَقِيمٌ",
      "en": "Indeed Allah is my Lord and your Lord; so worship Him. This is a straight path.” ’",
      "_n": 51
    },
    {
      "ar": "فَلَمَّآ أَحَسَّ عِيسَىٰ مِنْهُمُ ٱلْكُفْرَ قَالَ مَنْ أَنصَارِىٓ إِلَى ٱللَّهِ ۖ قَالَ ٱلْحَوَارِيُّونَ نَحْنُ أَنصَارُ ٱللَّهِ ءَامَنَّا بِٱللَّهِ وَٱشْهَدْ بِأَنَّا مُسْلِمُونَ",
      "en": "When Jesus sensed their faithlessness, he said, ‘Who will be my helpers [on the path] toward Allah?’ The Disciples said, ‘We will be helpers of Allah. We have faith in Allah, and you be witness that we have submitted [to Him].",
      "_n": 52
    },
    {
      "ar": "رَبَّنَآ ءَامَنَّا بِمَآ أَنزَلْتَ وَٱتَّبَعْنَا ٱلرَّسُولَ فَٱكْتُبْنَا مَعَ ٱلشَّـٰهِدِينَ",
      "en": "Our Lord, we believe in what You have sent down, and we follow the apostle, so write us among the witnesses.’",
      "_n": 53
    },
    {
      "ar": "وَمَكَرُوا۟ وَمَكَرَ ٱللَّهُ ۖ وَٱللَّهُ خَيْرُ ٱلْمَـٰكِرِينَ",
      "en": "Then they plotted [against Jesus], and Allah also devised, and Allah is the best of devisers.",
      "_n": 54
    },
    {
      "ar": "إِذْ قَالَ ٱللَّهُ يَـٰعِيسَىٰٓ إِنِّى مُتَوَفِّيكَ وَرَافِعُكَ إِلَىَّ وَمُطَهِّرُكَ مِنَ ٱلَّذِينَ كَفَرُوا۟ وَجَاعِلُ ٱلَّذِينَ ٱتَّبَعُوكَ فَوْقَ ٱلَّذِينَ كَفَرُوٓا۟ إِلَىٰ يَوْمِ ٱلْقِيَـٰمَةِ ۖ ثُمَّ إِلَىَّ مَرْجِعُكُمْ فَأَحْكُمُ بَيْنَكُمْ فِيمَا كُنتُمْ فِيهِ تَخْتَلِفُونَ",
      "en": "When Allah said, ‘O Jesus, I shall take you[r soul], and I shall raise you up toward Myself, and I shall clear you of [the calumnies of] the faithless, and I shall set those who follow you above the faithless until the Day of Resurrection. Then to Me will be your return, whereat I will judge between you concerning that about which you used to differ.",
      "_n": 55
    },
    {
      "ar": "فَأَمَّا ٱلَّذِينَ كَفَرُوا۟ فَأُعَذِّبُهُمْ عَذَابًا شَدِيدًا فِى ٱلدُّنْيَا وَٱلْـَٔاخِرَةِ وَمَا لَهُم مِّن نَّـٰصِرِينَ",
      "en": "As for the faithless, I will punish them with a severe punishment in the world and the Hereafter; and they will have no helpers.’",
      "_n": 56
    },
    {
      "ar": "وَأَمَّا ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ فَيُوَفِّيهِمْ أُجُورَهُمْ ۗ وَٱللَّهُ لَا يُحِبُّ ٱلظَّـٰلِمِينَ",
      "en": "But as for those who have faith and do righteous deeds, He will pay them in full their rewards, and Allah does not like the wrongdoers.",
      "_n": 57
    },
    {
      "ar": "ذَٰلِكَ نَتْلُوهُ عَلَيْكَ مِنَ ٱلْـَٔايَـٰتِ وَٱلذِّكْرِ ٱلْحَكِيمِ",
      "en": "These that We recite to you are from the signs and the Wise Reminder.",
      "_n": 58
    },
    {
      "ar": "إِنَّ مَثَلَ عِيسَىٰ عِندَ ٱللَّهِ كَمَثَلِ ءَادَمَ ۖ خَلَقَهُۥ مِن تُرَابٍ ثُمَّ قَالَ لَهُۥ كُن فَيَكُونُ",
      "en": "Indeed the case of Jesus with Allah is like the case of Adam: He created him from dust, then said to him, ‘Be,’ and he was.",
      "_n": 59
    },
    {
      "ar": "ٱلْحَقُّ مِن رَّبِّكَ فَلَا تَكُن مِّنَ ٱلْمُمْتَرِينَ",
      "en": "This is the truth from your Lord, so do not be among the skeptics.",
      "_n": 60
    },
    {
      "ar": "فَمَنْ حَآجَّكَ فِيهِ مِنۢ بَعْدِ مَا جَآءَكَ مِنَ ٱلْعِلْمِ فَقُلْ تَعَالَوْا۟ نَدْعُ أَبْنَآءَنَا وَأَبْنَآءَكُمْ وَنِسَآءَنَا وَنِسَآءَكُمْ وَأَنفُسَنَا وَأَنفُسَكُمْ ثُمَّ نَبْتَهِلْ فَنَجْعَل لَّعْنَتَ ٱللَّهِ عَلَى ٱلْكَـٰذِبِينَ",
      "en": "Should anyone argue with you concerning him, after the knowledge that has come to you, say, ‘Come! Let us call our sons and your sons, our women and your women, our souls and your souls, then let us pray earnestly, and call down Allah’s curse upon the liars.’",
      "_n": 61
    },
    {
      "ar": "إِنَّ هَـٰذَا لَهُوَ ٱلْقَصَصُ ٱلْحَقُّ ۚ وَمَا مِنْ إِلَـٰهٍ إِلَّا ٱللَّهُ ۚ وَإِنَّ ٱللَّهَ لَهُوَ ٱلْعَزِيزُ ٱلْحَكِيمُ",
      "en": "This is indeed the true account, for sure. There is no god but Allah, and indeed Allah is the All-mighty, the All-wise.",
      "_n": 62
    },
    {
      "ar": "فَإِن تَوَلَّوْا۟ فَإِنَّ ٱللَّهَ عَلِيمٌۢ بِٱلْمُفْسِدِينَ",
      "en": "But if they turn away, indeed Allah knows best the agents of corruption.",
      "_n": 63
    },
    {
      "ar": "قُلْ يَـٰٓأَهْلَ ٱلْكِتَـٰبِ تَعَالَوْا۟ إِلَىٰ كَلِمَةٍ سَوَآءٍۭ بَيْنَنَا وَبَيْنَكُمْ أَلَّا نَعْبُدَ إِلَّا ٱللَّهَ وَلَا نُشْرِكَ بِهِۦ شَيْـًٔا وَلَا يَتَّخِذَ بَعْضُنَا بَعْضًا أَرْبَابًا مِّن دُونِ ٱللَّهِ ۚ فَإِن تَوَلَّوْا۟ فَقُولُوا۟ ٱشْهَدُوا۟ بِأَنَّا مُسْلِمُونَ",
      "en": "Say, ‘O People of the Book! Come to a common word between us and you: that we will worship no one but Allah, that we will not ascribe any partner to Him, and that some of us will not take some others as lords besides Allah.’ But if they turn away, say, ‘Be witnesses that we have submitted [to Allah].’",
      "_n": 64
    },
    {
      "ar": "يَـٰٓأَهْلَ ٱلْكِتَـٰبِ لِمَ تُحَآجُّونَ فِىٓ إِبْرَٰهِيمَ وَمَآ أُنزِلَتِ ٱلتَّوْرَىٰةُ وَٱلْإِنجِيلُ إِلَّا مِنۢ بَعْدِهِۦٓ ۚ أَفَلَا تَعْقِلُونَ",
      "en": "O People of the Book! Why do you argue concerning Abraham? Neither the Torah nor the Evangel were sent down until [long] after him. Do you not exercise your reason?",
      "_n": 65
    },
    {
      "ar": "هَـٰٓأَنتُمْ هَـٰٓؤُلَآءِ حَـٰجَجْتُمْ فِيمَا لَكُم بِهِۦ عِلْمٌ فَلِمَ تُحَآجُّونَ فِيمَا لَيْسَ لَكُم بِهِۦ عِلْمٌ ۚ وَٱللَّهُ يَعْلَمُ وَأَنتُمْ لَا تَعْلَمُونَ",
      "en": "Ah! You are the very ones who argue about that of which you have knowledge. But why do you argue about that of which you have no knowledge? And Allah knows and you do not know.",
      "_n": 66
    },
    {
      "ar": "مَا كَانَ إِبْرَٰهِيمُ يَهُودِيًّا وَلَا نَصْرَانِيًّا وَلَـٰكِن كَانَ حَنِيفًا مُّسْلِمًا وَمَا كَانَ مِنَ ٱلْمُشْرِكِينَ",
      "en": "Abraham was neither a Jew nor a Christian. Rather, he was a Hanif, a Muslim, and he was not one of the polytheists.",
      "_n": 67
    },
    {
      "ar": "إِنَّ أَوْلَى ٱلنَّاسِ بِإِبْرَٰهِيمَ لَلَّذِينَ ٱتَّبَعُوهُ وَهَـٰذَا ٱلنَّبِىُّ وَٱلَّذِينَ ءَامَنُوا۟ ۗ وَٱللَّهُ وَلِىُّ ٱلْمُؤْمِنِينَ",
      "en": "Indeed the nearest of all people to Abraham are those who follow him and this prophet and those who have faith, and Allah is the guardian of the faithful.",
      "_n": 68
    },
    {
      "ar": "وَدَّت طَّآئِفَةٌ مِّنْ أَهْلِ ٱلْكِتَـٰبِ لَوْ يُضِلُّونَكُمْ وَمَا يُضِلُّونَ إِلَّآ أَنفُسَهُمْ وَمَا يَشْعُرُونَ",
      "en": "A group of the People of the Book were eager to lead you astray; yet they lead no one astray except themselves, but they are not aware.",
      "_n": 69
    },
    {
      "ar": "يَـٰٓأَهْلَ ٱلْكِتَـٰبِ لِمَ تَكْفُرُونَ بِـَٔايَـٰتِ ٱللَّهِ وَأَنتُمْ تَشْهَدُونَ",
      "en": "O People of the Book! Why do you deny Allah’s signs while you testify [to their truth]?",
      "_n": 70
    },
    {
      "ar": "يَـٰٓأَهْلَ ٱلْكِتَـٰبِ لِمَ تَلْبِسُونَ ٱلْحَقَّ بِٱلْبَـٰطِلِ وَتَكْتُمُونَ ٱلْحَقَّ وَأَنتُمْ تَعْلَمُونَ",
      "en": "O People of the Book! Why do you mix the truth with falsehood, and conceal the truth while you know [it]?",
      "_n": 71
    },
    {
      "ar": "وَقَالَت طَّآئِفَةٌ مِّنْ أَهْلِ ٱلْكِتَـٰبِ ءَامِنُوا۟ بِٱلَّذِىٓ أُنزِلَ عَلَى ٱلَّذِينَ ءَامَنُوا۟ وَجْهَ ٱلنَّهَارِ وَٱكْفُرُوٓا۟ ءَاخِرَهُۥ لَعَلَّهُمْ يَرْجِعُونَ",
      "en": "A group of the People of the Book say, ‘Believe in what has been sent down to the faithful at the beginning of the day, and disbelieve at its end, so that they may turn back [from their religion].’",
      "_n": 72
    },
    {
      "ar": "وَلَا تُؤْمِنُوٓا۟ إِلَّا لِمَن تَبِعَ دِينَكُمْ قُلْ إِنَّ ٱلْهُدَىٰ هُدَى ٱللَّهِ أَن يُؤْتَىٰٓ أَحَدٌ مِّثْلَ مَآ أُوتِيتُمْ أَوْ يُحَآجُّوكُمْ عِندَ رَبِّكُمْ ۗ قُلْ إِنَّ ٱلْفَضْلَ بِيَدِ ٱللَّهِ يُؤْتِيهِ مَن يَشَآءُ ۗ وَٱللَّهُ وَٰسِعٌ عَلِيمٌ",
      "en": "And [they say,] ‘Do not believe anyone except him who follows your religion.’ Say, ‘Indeed [true] guidance is the guidance of Allah.’ [They also say.] ‘[Do not believe] that anyone may be given the like of what you were given, or that he may argue with you before your Lord.’ Say, ‘Indeed all grace is in Allah’s hand; He grants it to whomever He wishes, and Allah is all-bounteous, all-knowing.",
      "_n": 73
    },
    {
      "ar": "يَخْتَصُّ بِرَحْمَتِهِۦ مَن يَشَآءُ ۗ وَٱللَّهُ ذُو ٱلْفَضْلِ ٱلْعَظِيمِ",
      "en": "He singles out for His mercy whomever He wishes, and Allah is dispenser of a great grace.’",
      "_n": 74
    },
    {
      "ar": "وَمِنْ أَهْلِ ٱلْكِتَـٰبِ مَنْ إِن تَأْمَنْهُ بِقِنطَارٍ يُؤَدِّهِۦٓ إِلَيْكَ وَمِنْهُم مَّنْ إِن تَأْمَنْهُ بِدِينَارٍ لَّا يُؤَدِّهِۦٓ إِلَيْكَ إِلَّا مَا دُمْتَ عَلَيْهِ قَآئِمًا ۗ ذَٰلِكَ بِأَنَّهُمْ قَالُوا۟ لَيْسَ عَلَيْنَا فِى ٱلْأُمِّيِّـۧنَ سَبِيلٌ وَيَقُولُونَ عَلَى ٱللَّهِ ٱلْكَذِبَ وَهُمْ يَعْلَمُونَ",
      "en": "Among the People of the Book is he who if you entrust him with a quintal will repay it to you, and among them is he who, if you entrust him with a dinar will not repay it to you unless you stand persistently over him. That is because they say, ‘We have no obligation to the non-Jews.’ But they attribute lies to Allah, and they know [it].",
      "_n": 75
    },
    {
      "ar": "بَلَىٰ مَنْ أَوْفَىٰ بِعَهْدِهِۦ وَٱتَّقَىٰ فَإِنَّ ٱللَّهَ يُحِبُّ ٱلْمُتَّقِينَ",
      "en": "Yes, whoever fulfills his commitments and is wary of Allah—Allah indeed loves the Godwary.",
      "_n": 76
    },
    {
      "ar": "إِنَّ ٱلَّذِينَ يَشْتَرُونَ بِعَهْدِ ٱللَّهِ وَأَيْمَـٰنِهِمْ ثَمَنًا قَلِيلًا أُو۟لَـٰٓئِكَ لَا خَلَـٰقَ لَهُمْ فِى ٱلْـَٔاخِرَةِ وَلَا يُكَلِّمُهُمُ ٱللَّهُ وَلَا يَنظُرُ إِلَيْهِمْ يَوْمَ ٱلْقِيَـٰمَةِ وَلَا يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ",
      "en": "There shall be no share in the Hereafter for those who sell Allah’s covenant and their oaths for a paltry gain, and on the Day of Resurrection Allah will not speak to them nor will He [so much as] look at them, nor will He purify them, and there is a painful punishment for them.",
      "_n": 77
    },
    {
      "ar": "وَإِنَّ مِنْهُمْ لَفَرِيقًا يَلْوُۥنَ أَلْسِنَتَهُم بِٱلْكِتَـٰبِ لِتَحْسَبُوهُ مِنَ ٱلْكِتَـٰبِ وَمَا هُوَ مِنَ ٱلْكِتَـٰبِ وَيَقُولُونَ هُوَ مِنْ عِندِ ٱللَّهِ وَمَا هُوَ مِنْ عِندِ ٱللَّهِ وَيَقُولُونَ عَلَى ٱللَّهِ ٱلْكَذِبَ وَهُمْ يَعْلَمُونَ",
      "en": "There is a group of them who alter their voice while reading out a text [that they have themselves authored], so that you may suppose it to be from the Book, though it is not from the Book, and they say, ‘It is from Allah,’ though it is not from Allah, and they attribute lies to Allah, and they know [it].",
      "_n": 78
    },
    {
      "ar": "مَا كَانَ لِبَشَرٍ أَن يُؤْتِيَهُ ٱللَّهُ ٱلْكِتَـٰبَ وَٱلْحُكْمَ وَٱلنُّبُوَّةَ ثُمَّ يَقُولَ لِلنَّاسِ كُونُوا۟ عِبَادًا لِّى مِن دُونِ ٱللَّهِ وَلَـٰكِن كُونُوا۟ رَبَّـٰنِيِّـۧنَ بِمَا كُنتُمْ تُعَلِّمُونَ ٱلْكِتَـٰبَ وَبِمَا كُنتُمْ تَدْرُسُونَ",
      "en": "It does not behoove any human that Allah should give him the Book, judgement and prophethood, and then he should say to the people, ‘Be my servants instead of Allah.’ Rather [he would say], ‘Be a godly people, because of your teaching the Book and because of your studying it.’",
      "_n": 79
    },
    {
      "ar": "وَلَا يَأْمُرَكُمْ أَن تَتَّخِذُوا۟ ٱلْمَلَـٰٓئِكَةَ وَٱلنَّبِيِّـۧنَ أَرْبَابًا ۗ أَيَأْمُرُكُم بِٱلْكُفْرِ بَعْدَ إِذْ أَنتُم مُّسْلِمُونَ",
      "en": "And he would not command you to take the angels and the prophets for lords. Would he call you to unfaith after you have submitted [to Allah]?",
      "_n": 80
    },
    {
      "ar": "وَإِذْ أَخَذَ ٱللَّهُ مِيثَـٰقَ ٱلنَّبِيِّـۧنَ لَمَآ ءَاتَيْتُكُم مِّن كِتَـٰبٍ وَحِكْمَةٍ ثُمَّ جَآءَكُمْ رَسُولٌ مُّصَدِّقٌ لِّمَا مَعَكُمْ لَتُؤْمِنُنَّ بِهِۦ وَلَتَنصُرُنَّهُۥ ۚ قَالَ ءَأَقْرَرْتُمْ وَأَخَذْتُمْ عَلَىٰ ذَٰلِكُمْ إِصْرِى ۖ قَالُوٓا۟ أَقْرَرْنَا ۚ قَالَ فَٱشْهَدُوا۟ وَأَنَا۠ مَعَكُم مِّنَ ٱلشَّـٰهِدِينَ",
      "en": "When Allah took a compact concerning the prophets, [He said,] ‘Inasmuch as I have given you [the knowledge] of the Book and wisdom, should an apostle come to you thereafter confirming what is with you, you shall believe in him and help him.’ He said, ‘Do you pledge and accept My covenant on this condition?’ They said, ‘We pledge.’ He said, ‘Then be witnesses, and I, too, am among the witnesses along with you.’",
      "_n": 81
    },
    {
      "ar": "فَمَن تَوَلَّىٰ بَعْدَ ذَٰلِكَ فَأُو۟لَـٰٓئِكَ هُمُ ٱلْفَـٰسِقُونَ",
      "en": "Then whoever turns away after that—it is they who are the transgressors.",
      "_n": 82
    },
    {
      "ar": "أَفَغَيْرَ دِينِ ٱللَّهِ يَبْغُونَ وَلَهُۥٓ أَسْلَمَ مَن فِى ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ طَوْعًا وَكَرْهًا وَإِلَيْهِ يُرْجَعُونَ",
      "en": "Do they seek a religion other than that of Allah, while to Him submits whoever there is in the heavens and the earth, willingly or unwillingly, and to Him they will be brought back?",
      "_n": 83
    },
    {
      "ar": "قُلْ ءَامَنَّا بِٱللَّهِ وَمَآ أُنزِلَ عَلَيْنَا وَمَآ أُنزِلَ عَلَىٰٓ إِبْرَٰهِيمَ وَإِسْمَـٰعِيلَ وَإِسْحَـٰقَ وَيَعْقُوبَ وَٱلْأَسْبَاطِ وَمَآ أُوتِىَ مُوسَىٰ وَعِيسَىٰ وَٱلنَّبِيُّونَ مِن رَّبِّهِمْ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّنْهُمْ وَنَحْنُ لَهُۥ مُسْلِمُونَ",
      "en": "Say, ‘We have faith in Allah and in what has been sent down to us, and what was sent down to Abraham, Ishmael, Isaac, Jacob and the Tribes, and that which Moses, Jesus and the prophets were given by their Lord. We make no distinction between any of them, and to Him do we submit.’",
      "_n": 84
    },
    {
      "ar": "وَمَن يَبْتَغِ غَيْرَ ٱلْإِسْلَـٰمِ دِينًا فَلَن يُقْبَلَ مِنْهُ وَهُوَ فِى ٱلْـَٔاخِرَةِ مِنَ ٱلْخَـٰسِرِينَ",
      "en": "Should anyone follow a religion other than Islam, it shall never be accepted from him, and he will be among the losers in the Hereafter.",
      "_n": 85
    },
    {
      "ar": "كَيْفَ يَهْدِى ٱللَّهُ قَوْمًا كَفَرُوا۟ بَعْدَ إِيمَـٰنِهِمْ وَشَهِدُوٓا۟ أَنَّ ٱلرَّسُولَ حَقٌّ وَجَآءَهُمُ ٱلْبَيِّنَـٰتُ ۚ وَٱللَّهُ لَا يَهْدِى ٱلْقَوْمَ ٱلظَّـٰلِمِينَ",
      "en": "How shall Allah guide a people who have disbelieved after their faith and [after] bearing witness that the Apostle is true, and [after] manifest proofs had come to them? Allah does not guide the wrongdoing lot.",
      "_n": 86
    },
    {
      "ar": "أُو۟لَـٰٓئِكَ جَزَآؤُهُمْ أَنَّ عَلَيْهِمْ لَعْنَةَ ٱللَّهِ وَٱلْمَلَـٰٓئِكَةِ وَٱلنَّاسِ أَجْمَعِينَ",
      "en": "Their requital is that there shall be upon them the curse of Allah, the angels, and all mankind.",
      "_n": 87
    },
    {
      "ar": "خَـٰلِدِينَ فِيهَا لَا يُخَفَّفُ عَنْهُمُ ٱلْعَذَابُ وَلَا هُمْ يُنظَرُونَ",
      "en": "They will remain in it [forever], and their punishment will not be lightened, nor will they be granted any respite,",
      "_n": 88
    },
    {
      "ar": "إِلَّا ٱلَّذِينَ تَابُوا۟ مِنۢ بَعْدِ ذَٰلِكَ وَأَصْلَحُوا۟ فَإِنَّ ٱللَّهَ غَفُورٌ رَّحِيمٌ",
      "en": "except such as repent after that and make amends, for Allah is all-forgiving, all-merciful.",
      "_n": 89
    },
    {
      "ar": "إِنَّ ٱلَّذِينَ كَفَرُوا۟ بَعْدَ إِيمَـٰنِهِمْ ثُمَّ ٱزْدَادُوا۟ كُفْرًا لَّن تُقْبَلَ تَوْبَتُهُمْ وَأُو۟لَـٰٓئِكَ هُمُ ٱلضَّآلُّونَ",
      "en": "Indeed those who turn faithless after their faith, and then advance in faithlessness, their repentance will never be accepted, and it is they who are the astray.",
      "_n": 90
    },
    {
      "ar": "إِنَّ ٱلَّذِينَ كَفَرُوا۟ وَمَاتُوا۟ وَهُمْ كُفَّارٌ فَلَن يُقْبَلَ مِنْ أَحَدِهِم مِّلْءُ ٱلْأَرْضِ ذَهَبًا وَلَوِ ٱفْتَدَىٰ بِهِۦٓ ۗ أُو۟لَـٰٓئِكَ لَهُمْ عَذَابٌ أَلِيمٌ وَمَا لَهُم مِّن نَّـٰصِرِينَ",
      "en": "Indeed those who turn faithless and die while they are faithless, a world of gold will not be accepted from any of them should he offer it for ransom. For such there will be a painful punishment, and they will have no helpers.",
      "_n": 91
    },
    {
      "ar": "لَن تَنَالُوا۟ ٱلْبِرَّ حَتَّىٰ تُنفِقُوا۟ مِمَّا تُحِبُّونَ ۚ وَمَا تُنفِقُوا۟ مِن شَىْءٍ فَإِنَّ ٱللَّهَ بِهِۦ عَلِيمٌ",
      "en": "You will never attain piety until you spend out of what you hold dear, and whatever you may spend of anything, Allah indeed knows it.",
      "_n": 92
    },
    {
      "ar": "كُلُّ ٱلطَّعَامِ كَانَ حِلًّا لِّبَنِىٓ إِسْرَٰٓءِيلَ إِلَّا مَا حَرَّمَ إِسْرَٰٓءِيلُ عَلَىٰ نَفْسِهِۦ مِن قَبْلِ أَن تُنَزَّلَ ٱلتَّوْرَىٰةُ ۗ قُلْ فَأْتُوا۟ بِٱلتَّوْرَىٰةِ فَٱتْلُوهَآ إِن كُنتُمْ صَـٰدِقِينَ",
      "en": "All food was lawful to the Children of Israel except what Israel had forbidden himself before the Torah was sent down. Say, ‘Bring the Torah, and read it, if you are truthful.’",
      "_n": 93
    },
    {
      "ar": "فَمَنِ ٱفْتَرَىٰ عَلَى ٱللَّهِ ٱلْكَذِبَ مِنۢ بَعْدِ ذَٰلِكَ فَأُو۟لَـٰٓئِكَ هُمُ ٱلظَّـٰلِمُونَ",
      "en": "So whoever fabricates a lie against Allah after that—it is they who are the wrongdoers.",
      "_n": 94
    },
    {
      "ar": "قُلْ صَدَقَ ٱللَّهُ ۗ فَٱتَّبِعُوا۟ مِلَّةَ إِبْرَٰهِيمَ حَنِيفًا وَمَا كَانَ مِنَ ٱلْمُشْرِكِينَ",
      "en": "Say, ‘Allah has spoken the truth; so follow the creed of Abraham, a Hanif, and he was not one of the polytheists.",
      "_n": 95
    },
    {
      "ar": "إِنَّ أَوَّلَ بَيْتٍ وُضِعَ لِلنَّاسِ لَلَّذِى بِبَكَّةَ مُبَارَكًا وَهُدًى لِّلْعَـٰلَمِينَ",
      "en": "Indeed the first house to be set up for mankind is the one at Bakkah, blessed and a guidance for all nations.",
      "_n": 96
    },
    {
      "ar": "فِيهِ ءَايَـٰتٌۢ بَيِّنَـٰتٌ مَّقَامُ إِبْرَٰهِيمَ ۖ وَمَن دَخَلَهُۥ كَانَ ءَامِنًا ۗ وَلِلَّهِ عَلَى ٱلنَّاسِ حِجُّ ٱلْبَيْتِ مَنِ ٱسْتَطَاعَ إِلَيْهِ سَبِيلًا ۚ وَمَن كَفَرَ فَإِنَّ ٱللَّهَ غَنِىٌّ عَنِ ٱلْعَـٰلَمِينَ",
      "en": "In it are manifest signs [and] Abraham’s Station, and whoever enters it shall be secure. And it is the duty of mankind toward Allah to make pilgrimage to the House—for those who can afford the journey to it—and should anyone renege [on his obligation], Allah is indeed without need of the creatures.",
      "_n": 97
    },
    {
      "ar": "قُلْ يَـٰٓأَهْلَ ٱلْكِتَـٰبِ لِمَ تَكْفُرُونَ بِـَٔايَـٰتِ ٱللَّهِ وَٱللَّهُ شَهِيدٌ عَلَىٰ مَا تَعْمَلُونَ",
      "en": "Say, ‘O People of the Book! Why do you deny the signs of Allah, while Allah is witness to what you do?’",
      "_n": 98
    },
    {
      "ar": "قُلْ يَـٰٓأَهْلَ ٱلْكِتَـٰبِ لِمَ تَصُدُّونَ عَن سَبِيلِ ٱللَّهِ مَنْ ءَامَنَ تَبْغُونَهَا عِوَجًا وَأَنتُمْ شُهَدَآءُ ۗ وَمَا ٱللَّهُ بِغَـٰفِلٍ عَمَّا تَعْمَلُونَ",
      "en": "Say, ‘O People of the Book! why do you bar the faithful from the way of Allah, seeking to make it crooked, while you are witnesses [to its truthfulness]? And Allah is not oblivious of what you do.’",
      "_n": 99
    },
    {
      "ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِن تُطِيعُوا۟ فَرِيقًا مِّنَ ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَـٰبَ يَرُدُّوكُم بَعْدَ إِيمَـٰنِكُمْ كَـٰفِرِينَ",
      "en": "O you who have faith, if you obey a part of those who were given the Book, they will turn you back, after your faith, into faithless ones.",
      "_n": 100
    },
    {
      "ar": "وَكَيْفَ تَكْفُرُونَ وَأَنتُمْ تُتْلَىٰ عَلَيْكُمْ ءَايَـٰتُ ٱللَّهِ وَفِيكُمْ رَسُولُهُۥ ۗ وَمَن يَعْتَصِم بِٱللَّهِ فَقَدْ هُدِىَ إِلَىٰ صِرَٰطٍ مُّسْتَقِيمٍ",
      "en": "And how would you be faithless while the signs of Allah are recited to you and His Apostle is in your midst? Whoever takes recourse in Allah is certainly guided to a straight path.",
      "_n": 101
    },
    {
      "ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱتَّقُوا۟ ٱللَّهَ حَقَّ تُقَاتِهِۦ وَلَا تَمُوتُنَّ إِلَّا وَأَنتُم مُّسْلِمُونَ",
      "en": "O you who have faith! Be wary of Allah with the wariness due to Him and do not die except as Muslims.",
      "_n": 102
    },
    {
      "ar": "وَٱعْتَصِمُوا۟ بِحَبْلِ ٱللَّهِ جَمِيعًا وَلَا تَفَرَّقُوا۟ ۚ وَٱذْكُرُوا۟ نِعْمَتَ ٱللَّهِ عَلَيْكُمْ إِذْ كُنتُمْ أَعْدَآءً فَأَلَّفَ بَيْنَ قُلُوبِكُمْ فَأَصْبَحْتُم بِنِعْمَتِهِۦٓ إِخْوَٰنًا وَكُنتُمْ عَلَىٰ شَفَا حُفْرَةٍ مِّنَ ٱلنَّارِ فَأَنقَذَكُم مِّنْهَا ۗ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمْ ءَايَـٰتِهِۦ لَعَلَّكُمْ تَهْتَدُونَ",
      "en": "Hold fast, all together, to Allah’s cord, and do not be divided [into sects]. Remember Allah’s blessing upon you when you were enemies, then He brought your hearts together, so you became brothers with His blessing. And you were on the brink of a pit of Fire, whereat He saved you from it. Thus does Allah clarify His signs for you so that you may be guided.",
      "_n": 103
    },
    {
      "ar": "وَلْتَكُن مِّنكُمْ أُمَّةٌ يَدْعُونَ إِلَى ٱلْخَيْرِ وَيَأْمُرُونَ بِٱلْمَعْرُوفِ وَيَنْهَوْنَ عَنِ ٱلْمُنكَرِ ۚ وَأُو۟لَـٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ",
      "en": "There has to be a nation among you summoning to the good, bidding what is right, and forbidding what is wrong. It is they who are the felicitous.",
      "_n": 104
    },
    {
      "ar": "وَلَا تَكُونُوا۟ كَٱلَّذِينَ تَفَرَّقُوا۟ وَٱخْتَلَفُوا۟ مِنۢ بَعْدِ مَا جَآءَهُمُ ٱلْبَيِّنَـٰتُ ۚ وَأُو۟لَـٰٓئِكَ لَهُمْ عَذَابٌ عَظِيمٌ",
      "en": "Do not be like those who became divided [into sects] and differed after manifest signs had come to them. For such there will be a great punishment",
      "_n": 105
    },
    {
      "ar": "يَوْمَ تَبْيَضُّ وُجُوهٌ وَتَسْوَدُّ وُجُوهٌ ۚ فَأَمَّا ٱلَّذِينَ ٱسْوَدَّتْ وُجُوهُهُمْ أَكَفَرْتُم بَعْدَ إِيمَـٰنِكُمْ فَذُوقُوا۟ ٱلْعَذَابَ بِمَا كُنتُمْ تَكْفُرُونَ",
      "en": "on the day when [some] faces will turn white and [some] faces will turn black. As for those whose faces turn black [it will be said to them], ‘Did you disbelieve after your faith? So taste the punishment because of what you used to disbelieve.’",
      "_n": 106
    },
    {
      "ar": "وَأَمَّا ٱلَّذِينَ ٱبْيَضَّتْ وُجُوهُهُمْ فَفِى رَحْمَةِ ٱللَّهِ هُمْ فِيهَا خَـٰلِدُونَ",
      "en": "But as for those whose faces become white, they shall dwell in Allah’s mercy, and they will remain in it [forever].",
      "_n": 107
    },
    {
      "ar": "تِلْكَ ءَايَـٰتُ ٱللَّهِ نَتْلُوهَا عَلَيْكَ بِٱلْحَقِّ ۗ وَمَا ٱللَّهُ يُرِيدُ ظُلْمًا لِّلْعَـٰلَمِينَ",
      "en": "These are the signs of Allah, which We recite to you in truth, and Allah does not desire any wrong for the creatures.",
      "_n": 108
    },
    {
      "ar": "وَلِلَّهِ مَا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۚ وَإِلَى ٱللَّهِ تُرْجَعُ ٱلْأُمُورُ",
      "en": "To Allah belongs whatever there is in the heavens and the earth, and to Allah all matters are returned.",
      "_n": 109
    },
    {
      "ar": "كُنتُمْ خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ تَأْمُرُونَ بِٱلْمَعْرُوفِ وَتَنْهَوْنَ عَنِ ٱلْمُنكَرِ وَتُؤْمِنُونَ بِٱللَّهِ ۗ وَلَوْ ءَامَنَ أَهْلُ ٱلْكِتَـٰبِ لَكَانَ خَيْرًا لَّهُم ۚ مِّنْهُمُ ٱلْمُؤْمِنُونَ وَأَكْثَرُهُمُ ٱلْفَـٰسِقُونَ",
      "en": "You are the best nation [ever] brought forth for mankind: you bid what is right and forbid what is wrong, and have faith in Allah. And if the People of the Book had believed, it would have been better for them. Among them [some] are faithful, but most of them are transgressors.",
      "_n": 110
    },
    {
      "ar": "لَن يَضُرُّوكُمْ إِلَّآ أَذًى ۖ وَإِن يُقَـٰتِلُوكُمْ يُوَلُّوكُمُ ٱلْأَدْبَارَ ثُمَّ لَا يُنصَرُونَ",
      "en": "They will never do you any harm, except for some hurt; and if they fight you, they will turn their backs [to flee], then they will not be helped.",
      "_n": 111
    },
    {
      "ar": "ضُرِبَتْ عَلَيْهِمُ ٱلذِّلَّةُ أَيْنَ مَا ثُقِفُوٓا۟ إِلَّا بِحَبْلٍ مِّنَ ٱللَّهِ وَحَبْلٍ مِّنَ ٱلنَّاسِ وَبَآءُو بِغَضَبٍ مِّنَ ٱللَّهِ وَضُرِبَتْ عَلَيْهِمُ ٱلْمَسْكَنَةُ ۚ ذَٰلِكَ بِأَنَّهُمْ كَانُوا۟ يَكْفُرُونَ بِـَٔايَـٰتِ ٱللَّهِ وَيَقْتُلُونَ ٱلْأَنۢبِيَآءَ بِغَيْرِ حَقٍّ ۚ ذَٰلِكَ بِمَا عَصَوا۟ وَّكَانُوا۟ يَعْتَدُونَ",
      "en": "Wherever they are found, abasement is stamped upon them, except for an asylum from Allah and an asylum from the people. They have earned the wrath of Allah, and poverty has been stamped upon them. That, because they would deny the signs of Allah and kill the prophets unjustly. That, because they would disobey and commit transgression.",
      "_n": 112
    },
    {
      "ar": "لَيْسُوا۟ سَوَآءً ۗ مِّنْ أَهْلِ ٱلْكِتَـٰبِ أُمَّةٌ قَآئِمَةٌ يَتْلُونَ ءَايَـٰتِ ٱللَّهِ ءَانَآءَ ٱلَّيْلِ وَهُمْ يَسْجُدُونَ",
      "en": "Yet they are not all alike. Among the People of the Book is an upright nation; they recite Allah’s signs in the watches of the night and prostrate.",
      "_n": 113
    },
    {
      "ar": "يُؤْمِنُونَ بِٱللَّهِ وَٱلْيَوْمِ ٱلْـَٔاخِرِ وَيَأْمُرُونَ بِٱلْمَعْرُوفِ وَيَنْهَوْنَ عَنِ ٱلْمُنكَرِ وَيُسَـٰرِعُونَ فِى ٱلْخَيْرَٰتِ وَأُو۟لَـٰٓئِكَ مِنَ ٱلصَّـٰلِحِينَ",
      "en": "They have faith in Allah and the Last Day, and bid what is right and forbid what is wrong, and they are active in [performing] good deeds. Those are among the righteous.",
      "_n": 114
    },
    {
      "ar": "وَمَا يَفْعَلُوا۟ مِنْ خَيْرٍ فَلَن يُكْفَرُوهُ ۗ وَٱللَّهُ عَلِيمٌۢ بِٱلْمُتَّقِينَ",
      "en": "Whatever good they do, they will not go unappreciated for it, and Allah knows well the Godwary.",
      "_n": 115
    },
    {
      "ar": "إِنَّ ٱلَّذِينَ كَفَرُوا۟ لَن تُغْنِىَ عَنْهُمْ أَمْوَٰلُهُمْ وَلَآ أَوْلَـٰدُهُم مِّنَ ٱللَّهِ شَيْـًٔا ۖ وَأُو۟لَـٰٓئِكَ أَصْحَـٰبُ ٱلنَّارِ ۚ هُمْ فِيهَا خَـٰلِدُونَ",
      "en": "As for the faithless, neither their wealth nor their children will avail them anything against Allah. They shall be the inmates of the Fire and remain in it [forever].",
      "_n": 116
    },
    {
      "ar": "مَثَلُ مَا يُنفِقُونَ فِى هَـٰذِهِ ٱلْحَيَوٰةِ ٱلدُّنْيَا كَمَثَلِ رِيحٍ فِيهَا صِرٌّ أَصَابَتْ حَرْثَ قَوْمٍ ظَلَمُوٓا۟ أَنفُسَهُمْ فَأَهْلَكَتْهُ ۚ وَمَا ظَلَمَهُمُ ٱللَّهُ وَلَـٰكِنْ أَنفُسَهُمْ يَظْلِمُونَ",
      "en": "The parable of what they spend in the life of this world is that of a cold wind that strikes the tillage of a people who wronged themselves, destroying it. Allah does not wrong them, but they wrong themselves.",
      "_n": 117
    },
    {
      "ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَتَّخِذُوا۟ بِطَانَةً مِّن دُونِكُمْ لَا يَأْلُونَكُمْ خَبَالًا وَدُّوا۟ مَا عَنِتُّمْ قَدْ بَدَتِ ٱلْبَغْضَآءُ مِنْ أَفْوَٰهِهِمْ وَمَا تُخْفِى صُدُورُهُمْ أَكْبَرُ ۚ قَدْ بَيَّنَّا لَكُمُ ٱلْـَٔايَـٰتِ ۖ إِن كُنتُمْ تَعْقِلُونَ",
      "en": "O you who have faith! Do not take your confidants from others than yourselves; they will spare nothing to ruin you. They are eager to see you in distress. Hatred has already shown itself from their mouths, and what their breasts hide [within] is yet worse. We have certainly made the signs clear for you, should you exercise your reason.",
      "_n": 118
    },
    {
      "ar": "هَـٰٓأَنتُمْ أُو۟لَآءِ تُحِبُّونَهُمْ وَلَا يُحِبُّونَكُمْ وَتُؤْمِنُونَ بِٱلْكِتَـٰبِ كُلِّهِۦ وَإِذَا لَقُوكُمْ قَالُوٓا۟ ءَامَنَّا وَإِذَا خَلَوْا۟ عَضُّوا۟ عَلَيْكُمُ ٱلْأَنَامِلَ مِنَ ٱلْغَيْظِ ۚ قُلْ مُوتُوا۟ بِغَيْظِكُمْ ۗ إِنَّ ٱللَّهَ عَلِيمٌۢ بِذَاتِ ٱلصُّدُورِ",
      "en": "Ah! You are the ones who bear love towards them, while they do not love you, though you believe in all the Books. When they meet you, they say, ‘We believe,’ but when they are alone, they bite their fingertips at you out of rage. Say, ‘Die of your rage!’ Indeed Allah knows well what is in the breasts.",
      "_n": 119
    },
    {
      "ar": "إِن تَمْسَسْكُمْ حَسَنَةٌ تَسُؤْهُمْ وَإِن تُصِبْكُمْ سَيِّئَةٌ يَفْرَحُوا۟ بِهَا ۖ وَإِن تَصْبِرُوا۟ وَتَتَّقُوا۟ لَا يَضُرُّكُمْ كَيْدُهُمْ شَيْـًٔا ۗ إِنَّ ٱللَّهَ بِمَا يَعْمَلُونَ مُحِيطٌ",
      "en": "If some good should befall you, it upsets them, but if some ill befalls you, they rejoice at it. Yet if you are patient and Godwary, their guile will not harm you in any way. Indeed Allah encompasses what they do.",
      "_n": 120
    },
    {
      "ar": "وَإِذْ غَدَوْتَ مِنْ أَهْلِكَ تُبَوِّئُ ٱلْمُؤْمِنِينَ مَقَـٰعِدَ لِلْقِتَالِ ۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ",
      "en": "When you left your family at dawn to settle the faithful in their positions for battle —and Allah is all-hearing, all-knowing.",
      "_n": 121
    },
    {
      "ar": "إِذْ هَمَّت طَّآئِفَتَانِ مِنكُمْ أَن تَفْشَلَا وَٱللَّهُ وَلِيُّهُمَا ۗ وَعَلَى ٱللَّهِ فَلْيَتَوَكَّلِ ٱلْمُؤْمِنُونَ",
      "en": "When two groups among you were about to lose courage—though Allah is their guardian, and in Allah let all the faithful put their trust.",
      "_n": 122
    },
    {
      "ar": "وَلَقَدْ نَصَرَكُمُ ٱللَّهُ بِبَدْرٍ وَأَنتُمْ أَذِلَّةٌ ۖ فَٱتَّقُوا۟ ٱللَّهَ لَعَلَّكُمْ تَشْكُرُونَ",
      "en": "Certainly Allah helped you at Badr, when you were weak [in the enemy’s eyes]. So be wary of Allah so that you may give thanks.",
      "_n": 123
    },
    {
      "ar": "إِذْ تَقُولُ لِلْمُؤْمِنِينَ أَلَن يَكْفِيَكُمْ أَن يُمِدَّكُمْ رَبُّكُم بِثَلَـٰثَةِ ءَالَـٰفٍ مِّنَ ٱلْمَلَـٰٓئِكَةِ مُنزَلِينَ",
      "en": "When you were saying to the faithful, ‘Is it not enough for you that your Lord should aid you with three thousand angels sent down?’",
      "_n": 124
    },
    {
      "ar": "بَلَىٰٓ ۚ إِن تَصْبِرُوا۟ وَتَتَّقُوا۟ وَيَأْتُوكُم مِّن فَوْرِهِمْ هَـٰذَا يُمْدِدْكُمْ رَبُّكُم بِخَمْسَةِ ءَالَـٰفٍ مِّنَ ٱلْمَلَـٰٓئِكَةِ مُسَوِّمِينَ",
      "en": "Yes, if you are steadfast and Godwary, and should they come at you suddenly, your Lord will aid you with five thousand angels sent in [to the scene of battle].",
      "_n": 125
    },
    {
      "ar": "وَمَا جَعَلَهُ ٱللَّهُ إِلَّا بُشْرَىٰ لَكُمْ وَلِتَطْمَئِنَّ قُلُوبُكُم بِهِۦ ۗ وَمَا ٱلنَّصْرُ إِلَّا مِنْ عِندِ ٱللَّهِ ٱلْعَزِيزِ ٱلْحَكِيمِ",
      "en": "Allah did not appoint it but as a good news for you and to reassure with it your hearts; and victory comes only from Allah, the All-mighty, the All-wise,",
      "_n": 126
    },
    {
      "ar": "لِيَقْطَعَ طَرَفًا مِّنَ ٱلَّذِينَ كَفَرُوٓا۟ أَوْ يَكْبِتَهُمْ فَيَنقَلِبُوا۟ خَآئِبِينَ",
      "en": "that He may cut down a section of the faithless, or subdue them, so that they retreat disappointed.",
      "_n": 127
    },
    {
      "ar": "لَيْسَ لَكَ مِنَ ٱلْأَمْرِ شَىْءٌ أَوْ يَتُوبَ عَلَيْهِمْ أَوْ يُعَذِّبَهُمْ فَإِنَّهُمْ ظَـٰلِمُونَ",
      "en": "You have no hand in the matter, whether He accepts their repentance or punishes them, for they are indeed wrongdoers.",
      "_n": 128
    },
    {
      "ar": "وَلِلَّهِ مَا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۚ يَغْفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُ ۚ وَٱللَّهُ غَفُورٌ رَّحِيمٌ",
      "en": "To Allah belongs whatever there is in the heavens and the earth: He forgives whomever He wishes and punishes whomever He wishes, and Allah is all-forgiving, all-merciful.",
      "_n": 129
    },
    {
      "ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَأْكُلُوا۟ ٱلرِّبَوٰٓا۟ أَضْعَـٰفًا مُّضَـٰعَفَةً ۖ وَٱتَّقُوا۟ ٱللَّهَ لَعَلَّكُمْ تُفْلِحُونَ",
      "en": "O you who have faith! Do not exact usury, twofold and severalfold, and be wary of Allah so that you may be felicitous.",
      "_n": 130
    },
    {
      "ar": "وَٱتَّقُوا۟ ٱلنَّارَ ٱلَّتِىٓ أُعِدَّتْ لِلْكَـٰفِرِينَ",
      "en": "Beware of the Fire, which has been prepared for the faithless,",
      "_n": 131
    },
    {
      "ar": "وَأَطِيعُوا۟ ٱللَّهَ وَٱلرَّسُولَ لَعَلَّكُمْ تُرْحَمُونَ",
      "en": "and obey Allah and the Apostle so that you may be granted [His] mercy.",
      "_n": 132
    },
    {
      "ar": "وَسَارِعُوٓا۟ إِلَىٰ مَغْفِرَةٍ مِّن رَّبِّكُمْ وَجَنَّةٍ عَرْضُهَا ٱلسَّمَـٰوَٰتُ وَٱلْأَرْضُ أُعِدَّتْ لِلْمُتَّقِينَ",
      "en": "Hasten towards your Lord’s forgiveness and a paradise as vast as the heavens and the earth, prepared for the Godwary",
      "_n": 133
    },
    {
      "ar": "ٱلَّذِينَ يُنفِقُونَ فِى ٱلسَّرَّآءِ وَٱلضَّرَّآءِ وَٱلْكَـٰظِمِينَ ٱلْغَيْظَ وَٱلْعَافِينَ عَنِ ٱلنَّاسِ ۗ وَٱللَّهُ يُحِبُّ ٱلْمُحْسِنِينَ",
      "en": "—those who spend in ease and adversity, and suppress their anger, and excuse [the faults of] the people, and Allah loves the virtuous;",
      "_n": 134
    },
    {
      "ar": "وَٱلَّذِينَ إِذَا فَعَلُوا۟ فَـٰحِشَةً أَوْ ظَلَمُوٓا۟ أَنفُسَهُمْ ذَكَرُوا۟ ٱللَّهَ فَٱسْتَغْفَرُوا۟ لِذُنُوبِهِمْ وَمَن يَغْفِرُ ٱلذُّنُوبَ إِلَّا ٱللَّهُ وَلَمْ يُصِرُّوا۟ عَلَىٰ مَا فَعَلُوا۟ وَهُمْ يَعْلَمُونَ",
      "en": "and those who, when they commit an indecent act or wrong themselves, remember Allah, and plead [to Allah seeking His] forgiveness for their sins—and who forgives sins except Allah?—and who knowingly do not persist in what [sins] they have committed.",
      "_n": 135
    },
    {
      "ar": "أُو۟لَـٰٓئِكَ جَزَآؤُهُم مَّغْفِرَةٌ مِّن رَّبِّهِمْ وَجَنَّـٰتٌ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَا ۚ وَنِعْمَ أَجْرُ ٱلْعَـٰمِلِينَ",
      "en": "Their reward is forgiveness from their Lord, and gardens with streams running in them, to remain in them [forever]. How excellent is the reward of the workers!",
      "_n": 136
    },
    {
      "ar": "قَدْ خَلَتْ مِن قَبْلِكُمْ سُنَنٌ فَسِيرُوا۟ فِى ٱلْأَرْضِ فَٱنظُرُوا۟ كَيْفَ كَانَ عَـٰقِبَةُ ٱلْمُكَذِّبِينَ",
      "en": "Certain [Divine] precedents have passed before you. So travel through the land and observe how was the fate of the deniers.",
      "_n": 137
    },
    {
      "ar": "هَـٰذَا بَيَانٌ لِّلنَّاسِ وَهُدًى وَمَوْعِظَةٌ لِّلْمُتَّقِينَ",
      "en": "This is an explanation for mankind, and a guidance and advice for the Godwary.",
      "_n": 138
    },
    {
      "ar": "وَلَا تَهِنُوا۟ وَلَا تَحْزَنُوا۟ وَأَنتُمُ ٱلْأَعْلَوْنَ إِن كُنتُم مُّؤْمِنِينَ",
      "en": "Do not weaken or grieve: you shall have the upper hand, should you be faithful.",
      "_n": 139
    },
    {
      "ar": "إِن يَمْسَسْكُمْ قَرْحٌ فَقَدْ مَسَّ ٱلْقَوْمَ قَرْحٌ مِّثْلُهُۥ ۚ وَتِلْكَ ٱلْأَيَّامُ نُدَاوِلُهَا بَيْنَ ٱلنَّاسِ وَلِيَعْلَمَ ٱللَّهُ ٱلَّذِينَ ءَامَنُوا۟ وَيَتَّخِذَ مِنكُمْ شُهَدَآءَ ۗ وَٱللَّهُ لَا يُحِبُّ ٱلظَّـٰلِمِينَ",
      "en": "If wounds afflict you, like wounds have already afflicted those people; and We make such vicissitudes rotate among mankind, so that Allah may ascertain those who have faith, and that He may take martyrs from among you, and Allah does not like the wrongdoers.",
      "_n": 140
    },
    {
      "ar": "وَلِيُمَحِّصَ ٱللَّهُ ٱلَّذِينَ ءَامَنُوا۟ وَيَمْحَقَ ٱلْكَـٰفِرِينَ",
      "en": "And so that Allah may purge [the hearts of] those who have faith and that He may wipe out the faithless.",
      "_n": 141
    },
    {
      "ar": "أَمْ حَسِبْتُمْ أَن تَدْخُلُوا۟ ٱلْجَنَّةَ وَلَمَّا يَعْلَمِ ٱللَّهُ ٱلَّذِينَ جَـٰهَدُوا۟ مِنكُمْ وَيَعْلَمَ ٱلصَّـٰبِرِينَ",
      "en": "Do you suppose that you would enter paradise, while Allah has not yet ascertained those of you who have waged jihad and He has not ascertained the steadfast?",
      "_n": 142
    },
    {
      "ar": "وَلَقَدْ كُنتُمْ تَمَنَّوْنَ ٱلْمَوْتَ مِن قَبْلِ أَن تَلْقَوْهُ فَقَدْ رَأَيْتُمُوهُ وَأَنتُمْ تَنظُرُونَ",
      "en": "Certainly you were longing for death before you had encountered it. Then certainly, you saw it, as you were looking on.",
      "_n": 143
    },
    {
      "ar": "وَمَا مُحَمَّدٌ إِلَّا رَسُولٌ قَدْ خَلَتْ مِن قَبْلِهِ ٱلرُّسُلُ ۚ أَفَإِي۟ن مَّاتَ أَوْ قُتِلَ ٱنقَلَبْتُمْ عَلَىٰٓ أَعْقَـٰبِكُمْ ۚ وَمَن يَنقَلِبْ عَلَىٰ عَقِبَيْهِ فَلَن يَضُرَّ ٱللَّهَ شَيْـًٔا ۗ وَسَيَجْزِى ٱللَّهُ ٱلشَّـٰكِرِينَ",
      "en": "Muhammad is but an apostle; [other] apostles have passed before him. If he dies or is slain, will you turn back on your heels? Anyone who turns back on his heels, will not harm Allah in the least, and soon Allah will reward the grateful.",
      "_n": 144
    },
    {
      "ar": "وَمَا كَانَ لِنَفْسٍ أَن تَمُوتَ إِلَّا بِإِذْنِ ٱللَّهِ كِتَـٰبًا مُّؤَجَّلًا ۗ وَمَن يُرِدْ ثَوَابَ ٱلدُّنْيَا نُؤْتِهِۦ مِنْهَا وَمَن يُرِدْ ثَوَابَ ٱلْـَٔاخِرَةِ نُؤْتِهِۦ مِنْهَا ۚ وَسَنَجْزِى ٱلشَّـٰكِرِينَ",
      "en": "No soul may die except by Allah’s leave, at an appointed time. Whoever desires the reward of this world, We will give him of it; and whoever desires the reward of the Hereafter, We will give him of it; and soon We will reward the grateful.",
      "_n": 145
    },
    {
      "ar": "وَكَأَيِّن مِّن نَّبِىٍّ قَـٰتَلَ مَعَهُۥ رِبِّيُّونَ كَثِيرٌ فَمَا وَهَنُوا۟ لِمَآ أَصَابَهُمْ فِى سَبِيلِ ٱللَّهِ وَمَا ضَعُفُوا۟ وَمَا ٱسْتَكَانُوا۟ ۗ وَٱللَّهُ يُحِبُّ ٱلصَّـٰبِرِينَ",
      "en": "How many a prophet there has been with whom a multitude of godly men fought. They did not falter for what befell them in the way of Allah, neither did they weaken, nor did they abase themselves; and Allah loves the steadfast.",
      "_n": 146
    },
    {
      "ar": "وَمَا كَانَ قَوْلَهُمْ إِلَّآ أَن قَالُوا۟ رَبَّنَا ٱغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِىٓ أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وَٱنصُرْنَا عَلَى ٱلْقَوْمِ ٱلْكَـٰفِرِينَ",
      "en": "All that they said was, ‘Our Lord, forgive us our sins and our excesses in our affairs, make our feet steady, and help us against the faithless lot.’",
      "_n": 147
    },
    {
      "ar": "فَـَٔاتَىٰهُمُ ٱللَّهُ ثَوَابَ ٱلدُّنْيَا وَحُسْنَ ثَوَابِ ٱلْـَٔاخِرَةِ ۗ وَٱللَّهُ يُحِبُّ ٱلْمُحْسِنِينَ",
      "en": "So Allah gave them the reward of this world and the fair reward of the Hereafter; and Allah loves the virtuous.",
      "_n": 148
    },
    {
      "ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِن تُطِيعُوا۟ ٱلَّذِينَ كَفَرُوا۟ يَرُدُّوكُمْ عَلَىٰٓ أَعْقَـٰبِكُمْ فَتَنقَلِبُوا۟ خَـٰسِرِينَ",
      "en": "O you who have faith! If you obey the faithless, they will turn you back on your heels, and you will become losers.",
      "_n": 149
    },
    {
      "ar": "بَلِ ٱللَّهُ مَوْلَىٰكُمْ ۖ وَهُوَ خَيْرُ ٱلنَّـٰصِرِينَ",
      "en": "Indeed, Allah is your Master, and He is the best of helpers.",
      "_n": 150
    },
    {
      "ar": "سَنُلْقِى فِى قُلُوبِ ٱلَّذِينَ كَفَرُوا۟ ٱلرُّعْبَ بِمَآ أَشْرَكُوا۟ بِٱللَّهِ مَا لَمْ يُنَزِّلْ بِهِۦ سُلْطَـٰنًا ۖ وَمَأْوَىٰهُمُ ٱلنَّارُ ۚ وَبِئْسَ مَثْوَى ٱلظَّـٰلِمِينَ",
      "en": "We shall cast terror into the hearts of the faithless because of their ascribing partners to Allah, for which He has not sent down any authority, and their refuge shall be the Fire, and evil is the [final] abode of the wrongdoers.",
      "_n": 151
    },
    {
      "ar": "وَلَقَدْ صَدَقَكُمُ ٱللَّهُ وَعْدَهُۥٓ إِذْ تَحُسُّونَهُم بِإِذْنِهِۦ ۖ حَتَّىٰٓ إِذَا فَشِلْتُمْ وَتَنَـٰزَعْتُمْ فِى ٱلْأَمْرِ وَعَصَيْتُم مِّنۢ بَعْدِ مَآ أَرَىٰكُم مَّا تُحِبُّونَ ۚ مِنكُم مَّن يُرِيدُ ٱلدُّنْيَا وَمِنكُم مَّن يُرِيدُ ٱلْـَٔاخِرَةَ ۚ ثُمَّ صَرَفَكُمْ عَنْهُمْ لِيَبْتَلِيَكُمْ ۖ وَلَقَدْ عَفَا عَنكُمْ ۗ وَٱللَّهُ ذُو فَضْلٍ عَلَى ٱلْمُؤْمِنِينَ",
      "en": "Allah certainly fulfilled His promise to you when you were slaying them with His leave, until you lost courage, disputed about the matter, and disobeyed after He showed you what you loved. Some among you desire this world, and some among you desire the Hereafter. Then He turned you away from them so that He might test you. Certainly He has excused you, for Allah is gracious to the faithful.",
      "_n": 152
    },
    {
      "ar": "إِذْ تُصْعِدُونَ وَلَا تَلْوُۥنَ عَلَىٰٓ أَحَدٍ وَٱلرَّسُولُ يَدْعُوكُمْ فِىٓ أُخْرَىٰكُمْ فَأَثَـٰبَكُمْ غَمًّۢا بِغَمٍّ لِّكَيْلَا تَحْزَنُوا۟ عَلَىٰ مَا فَاتَكُمْ وَلَا مَآ أَصَـٰبَكُمْ ۗ وَٱللَّهُ خَبِيرٌۢ بِمَا تَعْمَلُونَ",
      "en": "When you were fleeing without paying any attention to anyone, while the Apostle was calling you from your rear, He requited you with grief upon grief, so that you may not grieve for what you lose nor for what befalls you, and Allah is well aware of what you do.",
      "_n": 153
    },
    {
      "ar": "ثُمَّ أَنزَلَ عَلَيْكُم مِّنۢ بَعْدِ ٱلْغَمِّ أَمَنَةً نُّعَاسًا يَغْشَىٰ طَآئِفَةً مِّنكُمْ ۖ وَطَآئِفَةٌ قَدْ أَهَمَّتْهُمْ أَنفُسُهُمْ يَظُنُّونَ بِٱللَّهِ غَيْرَ ٱلْحَقِّ ظَنَّ ٱلْجَـٰهِلِيَّةِ ۖ يَقُولُونَ هَل لَّنَا مِنَ ٱلْأَمْرِ مِن شَىْءٍ ۗ قُلْ إِنَّ ٱلْأَمْرَ كُلَّهُۥ لِلَّهِ ۗ يُخْفُونَ فِىٓ أَنفُسِهِم مَّا لَا يُبْدُونَ لَكَ ۖ يَقُولُونَ لَوْ كَانَ لَنَا مِنَ ٱلْأَمْرِ شَىْءٌ مَّا قُتِلْنَا هَـٰهُنَا ۗ قُل لَّوْ كُنتُمْ فِى بُيُوتِكُمْ لَبَرَزَ ٱلَّذِينَ كُتِبَ عَلَيْهِمُ ٱلْقَتْلُ إِلَىٰ مَضَاجِعِهِمْ ۖ وَلِيَبْتَلِىَ ٱللَّهُ مَا فِى صُدُورِكُمْ وَلِيُمَحِّصَ مَا فِى قُلُوبِكُمْ ۗ وَٱللَّهُ عَلِيمٌۢ بِذَاتِ ٱلصُّدُورِ",
      "en": "Then He sent down to you safety after grief—a drowsiness that came over a group of you—while another group, anxious only about themselves, entertained false notions about Allah, notions of [pagan] ignorance. They say, ‘Do we have any role in the matter?’ Say, ‘Indeed the matter belongs totally to Allah.’ They hide in their hearts what they do not disclose to you. They say, ‘Had we any role in the matter, we would not have been slain here.’ Say, ‘Even if you had remained in your houses, those destined to be slain would have set out toward the places where they were laid to rest, so that Allah may test what is in your breasts, and that He may purge what is in your hearts, and Allah knows well what is in the breasts.’",
      "_n": 154
    },
    {
      "ar": "إِنَّ ٱلَّذِينَ تَوَلَّوْا۟ مِنكُمْ يَوْمَ ٱلْتَقَى ٱلْجَمْعَانِ إِنَّمَا ٱسْتَزَلَّهُمُ ٱلشَّيْطَـٰنُ بِبَعْضِ مَا كَسَبُوا۟ ۖ وَلَقَدْ عَفَا ٱللَّهُ عَنْهُمْ ۗ إِنَّ ٱللَّهَ غَفُورٌ حَلِيمٌ",
      "en": "Those of you who fled on the day when the two hosts met, only Satan had made them stumble because of some of their deeds. Certainly, Allah has excused them, for Allah is all-forgiving, all-forbearing.",
      "_n": 155
    },
    {
      "ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَكُونُوا۟ كَٱلَّذِينَ كَفَرُوا۟ وَقَالُوا۟ لِإِخْوَٰنِهِمْ إِذَا ضَرَبُوا۟ فِى ٱلْأَرْضِ أَوْ كَانُوا۟ غُزًّى لَّوْ كَانُوا۟ عِندَنَا مَا مَاتُوا۟ وَمَا قُتِلُوا۟ لِيَجْعَلَ ٱللَّهُ ذَٰلِكَ حَسْرَةً فِى قُلُوبِهِمْ ۗ وَٱللَّهُ يُحْىِۦ وَيُمِيتُ ۗ وَٱللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ",
      "en": "O you who have faith! Do not be like the faithless who say of their brethren, when they travel in the land or go into battle, ‘Had they stayed with us they would not have died or been killed,’ so that Allah may make it a regret in their hearts. But Allah gives life and brings death, and Allah watches what you do.",
      "_n": 156
    },
    {
      "ar": "وَلَئِن قُتِلْتُمْ فِى سَبِيلِ ٱللَّهِ أَوْ مُتُّمْ لَمَغْفِرَةٌ مِّنَ ٱللَّهِ وَرَحْمَةٌ خَيْرٌ مِّمَّا يَجْمَعُونَ",
      "en": "If you are slain in the way of Allah, or die, forgiveness and mercy from Allah are surely better than what they amass.",
      "_n": 157
    },
    {
      "ar": "وَلَئِن مُّتُّمْ أَوْ قُتِلْتُمْ لَإِلَى ٱللَّهِ تُحْشَرُونَ",
      "en": "If you die or are slain, you will surely be mustered toward Allah.",
      "_n": 158
    },
    {
      "ar": "فَبِمَا رَحْمَةٍ مِّنَ ٱللَّهِ لِنتَ لَهُمْ ۖ وَلَوْ كُنتَ فَظًّا غَلِيظَ ٱلْقَلْبِ لَٱنفَضُّوا۟ مِنْ حَوْلِكَ ۖ فَٱعْفُ عَنْهُمْ وَٱسْتَغْفِرْ لَهُمْ وَشَاوِرْهُمْ فِى ٱلْأَمْرِ ۖ فَإِذَا عَزَمْتَ فَتَوَكَّلْ عَلَى ٱللَّهِ ۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلْمُتَوَكِّلِينَ",
      "en": "It is by Allah’s mercy that you are gentle to them; had you been harsh and hardhearted, they would have surely scattered from around you. So excuse them and plead for forgiveness for them, and consult them in the affairs, and once you are resolved, put your trust in Allah. Indeed Allah loves those who trust in Him.",
      "_n": 159
    },
    {
      "ar": "إِن يَنصُرْكُمُ ٱللَّهُ فَلَا غَالِبَ لَكُمْ ۖ وَإِن يَخْذُلْكُمْ فَمَن ذَا ٱلَّذِى يَنصُرُكُم مِّنۢ بَعْدِهِۦ ۗ وَعَلَى ٱللَّهِ فَلْيَتَوَكَّلِ ٱلْمُؤْمِنُونَ",
      "en": "If Allah helps you, no one can overcome you, but if He forsakes you, who will help you after Him? So in Allah let all the faithful put their trust.",
      "_n": 160
    },
    {
      "ar": "وَمَا كَانَ لِنَبِىٍّ أَن يَغُلَّ ۚ وَمَن يَغْلُلْ يَأْتِ بِمَا غَلَّ يَوْمَ ٱلْقِيَـٰمَةِ ۚ ثُمَّ تُوَفَّىٰ كُلُّ نَفْسٍ مَّا كَسَبَتْ وَهُمْ لَا يُظْلَمُونَ",
      "en": "A prophet may not breach his trust, and whoever breaches his trust will bring his breaches on the Day of Resurrection; then every soul shall be recompensed fully for what it has earned, and they will not be wronged.",
      "_n": 161
    },
    {
      "ar": "أَفَمَنِ ٱتَّبَعَ رِضْوَٰنَ ٱللَّهِ كَمَنۢ بَآءَ بِسَخَطٍ مِّنَ ٱللَّهِ وَمَأْوَىٰهُ جَهَنَّمُ ۚ وَبِئْسَ ٱلْمَصِيرُ",
      "en": "Is he who follows [the course of] Allah’s pleasure like him who earns Allah’s displeasure and whose refuge is hell, an evil destination?",
      "_n": 162
    },
    {
      "ar": "هُمْ دَرَجَـٰتٌ عِندَ ٱللَّهِ ۗ وَٱللَّهُ بَصِيرٌۢ بِمَا يَعْمَلُونَ",
      "en": "They have ranks with Allah, and Allah watches what they do.",
      "_n": 163
    },
    {
      "ar": "لَقَدْ مَنَّ ٱللَّهُ عَلَى ٱلْمُؤْمِنِينَ إِذْ بَعَثَ فِيهِمْ رَسُولًا مِّنْ أَنفُسِهِمْ يَتْلُوا۟ عَلَيْهِمْ ءَايَـٰتِهِۦ وَيُزَكِّيهِمْ وَيُعَلِّمُهُمُ ٱلْكِتَـٰبَ وَٱلْحِكْمَةَ وَإِن كَانُوا۟ مِن قَبْلُ لَفِى ضَلَـٰلٍ مُّبِينٍ",
      "en": "Allah certainly favoured the faithful when He raised up among them an apostle from among themselves to recite to them His signs and to purify them and teach them the Book and wisdom, and earlier they had indeed been in manifest error.",
      "_n": 164
    },
    {
      "ar": "أَوَلَمَّآ أَصَـٰبَتْكُم مُّصِيبَةٌ قَدْ أَصَبْتُم مِّثْلَيْهَا قُلْتُمْ أَنَّىٰ هَـٰذَا ۖ قُلْ هُوَ مِنْ عِندِ أَنفُسِكُمْ ۗ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ",
      "en": "What, when an affliction visits you—while you have inflicted twice as much—do you say, ‘How is this?’! Say, ‘This is from your own souls.’ Indeed Allah has power over all things.",
      "_n": 165
    },
    {
      "ar": "وَمَآ أَصَـٰبَكُمْ يَوْمَ ٱلْتَقَى ٱلْجَمْعَانِ فَبِإِذْنِ ٱللَّهِ وَلِيَعْلَمَ ٱلْمُؤْمِنِينَ",
      "en": "What befell you on the day when the two hosts met, was by Allah’s permission, so that He may ascertain the faithful,",
      "_n": 166
    },
    {
      "ar": "وَلِيَعْلَمَ ٱلَّذِينَ نَافَقُوا۟ ۚ وَقِيلَ لَهُمْ تَعَالَوْا۟ قَـٰتِلُوا۟ فِى سَبِيلِ ٱللَّهِ أَوِ ٱدْفَعُوا۟ ۖ قَالُوا۟ لَوْ نَعْلَمُ قِتَالًا لَّٱتَّبَعْنَـٰكُمْ ۗ هُمْ لِلْكُفْرِ يَوْمَئِذٍ أَقْرَبُ مِنْهُمْ لِلْإِيمَـٰنِ ۚ يَقُولُونَ بِأَفْوَٰهِهِم مَّا لَيْسَ فِى قُلُوبِهِمْ ۗ وَٱللَّهُ أَعْلَمُ بِمَا يَكْتُمُونَ",
      "en": "and ascertain the hypocrites. [When] they were told: ‘Come, fight in the way of Allah, or defend [yourselves], they said, ‘If we knew any fighting, we would have surely followed you.’ That day they were nearer to unfaith than to faith. They say with their mouths what is not in their hearts, and Allah knows well whatever they conceal.",
      "_n": 167
    },
    {
      "ar": "ٱلَّذِينَ قَالُوا۟ لِإِخْوَٰنِهِمْ وَقَعَدُوا۟ لَوْ أَطَاعُونَا مَا قُتِلُوا۟ ۗ قُلْ فَٱدْرَءُوا۟ عَنْ أَنفُسِكُمُ ٱلْمَوْتَ إِن كُنتُمْ صَـٰدِقِينَ",
      "en": "Those who said of their brethren, while they themselves sat back: ‘Had they obeyed us, they would not have been killed.’ Say, ‘Then keep death off from yourselves, if you are truthful.’",
      "_n": 168
    },
    {
      "ar": "وَلَا تَحْسَبَنَّ ٱلَّذِينَ قُتِلُوا۟ فِى سَبِيلِ ٱللَّهِ أَمْوَٰتًۢا ۚ بَلْ أَحْيَآءٌ عِندَ رَبِّهِمْ يُرْزَقُونَ",
      "en": "Do not suppose those who were slain in the way of Allah to be dead; no, they are living and provided for near their Lord,",
      "_n": 169
    },
    {
      "ar": "فَرِحِينَ بِمَآ ءَاتَىٰهُمُ ٱللَّهُ مِن فَضْلِهِۦ وَيَسْتَبْشِرُونَ بِٱلَّذِينَ لَمْ يَلْحَقُوا۟ بِهِم مِّنْ خَلْفِهِمْ أَلَّا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "en": "exulting in what Allah has given them out of His grace, and rejoicing for those who have not yet joined them from [those left] behind them, that they will have no fear, nor will they grieve.",
      "_n": 170
    },
    {
      "ar": "يَسْتَبْشِرُونَ بِنِعْمَةٍ مِّنَ ٱللَّهِ وَفَضْلٍ وَأَنَّ ٱللَّهَ لَا يُضِيعُ أَجْرَ ٱلْمُؤْمِنِينَ",
      "en": "They rejoice in Allah’s blessing and grace, and that Allah does not waste the reward of the faithful.",
      "_n": 171
    },
    {
      "ar": "ٱلَّذِينَ ٱسْتَجَابُوا۟ لِلَّهِ وَٱلرَّسُولِ مِنۢ بَعْدِ مَآ أَصَابَهُمُ ٱلْقَرْحُ ۚ لِلَّذِينَ أَحْسَنُوا۟ مِنْهُمْ وَٱتَّقَوْا۟ أَجْرٌ عَظِيمٌ",
      "en": "Those who responded to Allah and the Apostle [even] after they had been wounded—for those of them who have been virtuous and Godwary there shall be a great reward.",
      "_n": 172
    },
    {
      "ar": "ٱلَّذِينَ قَالَ لَهُمُ ٱلنَّاسُ إِنَّ ٱلنَّاسَ قَدْ جَمَعُوا۟ لَكُمْ فَٱخْشَوْهُمْ فَزَادَهُمْ إِيمَـٰنًا وَقَالُوا۟ حَسْبُنَا ٱللَّهُ وَنِعْمَ ٱلْوَكِيلُ",
      "en": "—Those to whom the people said, ‘All the people have gathered against you, so fear them.’ That only increased them in faith, and they said, ‘Allah is sufficient for us, and He is an excellent trustee.’",
      "_n": 173
    },
    {
      "ar": "فَٱنقَلَبُوا۟ بِنِعْمَةٍ مِّنَ ٱللَّهِ وَفَضْلٍ لَّمْ يَمْسَسْهُمْ سُوٓءٌ وَٱتَّبَعُوا۟ رِضْوَٰنَ ٱللَّهِ ۗ وَٱللَّهُ ذُو فَضْلٍ عَظِيمٍ",
      "en": "So they returned with Allah’s blessing and grace, untouched by any harm. They pursued the pleasure of Allah, and Allah is dispenser of a great grace.",
      "_n": 174
    },
    {
      "ar": "إِنَّمَا ذَٰلِكُمُ ٱلشَّيْطَـٰنُ يُخَوِّفُ أَوْلِيَآءَهُۥ فَلَا تَخَافُوهُمْ وَخَافُونِ إِن كُنتُم مُّؤْمِنِينَ",
      "en": "That is only Satan frightening [you] of his followers! So fear them not, and fear Me, should you be faithful.",
      "_n": 175
    },
    {
      "ar": "وَلَا يَحْزُنكَ ٱلَّذِينَ يُسَـٰرِعُونَ فِى ٱلْكُفْرِ ۚ إِنَّهُمْ لَن يَضُرُّوا۟ ٱللَّهَ شَيْـًٔا ۗ يُرِيدُ ٱللَّهُ أَلَّا يَجْعَلَ لَهُمْ حَظًّا فِى ٱلْـَٔاخِرَةِ ۖ وَلَهُمْ عَذَابٌ عَظِيمٌ",
      "en": "Do not grieve for those who are active in unfaith; they will not hurt Allah in the least: Allah desires to give them no share in the Hereafter, and there is a great punishment for them.",
      "_n": 176
    },
    {
      "ar": "إِنَّ ٱلَّذِينَ ٱشْتَرَوُا۟ ٱلْكُفْرَ بِٱلْإِيمَـٰنِ لَن يَضُرُّوا۟ ٱللَّهَ شَيْـًٔا وَلَهُمْ عَذَابٌ أَلِيمٌ",
      "en": "Those who have bought unfaith for faith will not hurt Allah in the least, and there is a painful punishment for them.",
      "_n": 177
    },
    {
      "ar": "وَلَا يَحْسَبَنَّ ٱلَّذِينَ كَفَرُوٓا۟ أَنَّمَا نُمْلِى لَهُمْ خَيْرٌ لِّأَنفُسِهِمْ ۚ إِنَّمَا نُمْلِى لَهُمْ لِيَزْدَادُوٓا۟ إِثْمًا ۚ وَلَهُمْ عَذَابٌ مُّهِينٌ",
      "en": "Let the faithless not suppose that the respite that We grant them is good for their souls: We give them respite only that they may increase in sin, and there is a humiliating punishment for them.",
      "_n": 178
    },
    {
      "ar": "مَّا كَانَ ٱللَّهُ لِيَذَرَ ٱلْمُؤْمِنِينَ عَلَىٰ مَآ أَنتُمْ عَلَيْهِ حَتَّىٰ يَمِيزَ ٱلْخَبِيثَ مِنَ ٱلطَّيِّبِ ۗ وَمَا كَانَ ٱللَّهُ لِيُطْلِعَكُمْ عَلَى ٱلْغَيْبِ وَلَـٰكِنَّ ٱللَّهَ يَجْتَبِى مِن رُّسُلِهِۦ مَن يَشَآءُ ۖ فَـَٔامِنُوا۟ بِٱللَّهِ وَرُسُلِهِۦ ۚ وَإِن تُؤْمِنُوا۟ وَتَتَّقُوا۟ فَلَكُمْ أَجْرٌ عَظِيمٌ",
      "en": "Allah will not leave the faithful in your present state, until He has separated the bad ones from the good. Allah will not acquaint you with the Unseen, but Allah chooses whomever He wishes from His apostles. So have faith in Allah and His apostles; and if you are faithful and Godwary, there shall be a great reward for you.",
      "_n": 179
    },
    {
      "ar": "وَلَا يَحْسَبَنَّ ٱلَّذِينَ يَبْخَلُونَ بِمَآ ءَاتَىٰهُمُ ٱللَّهُ مِن فَضْلِهِۦ هُوَ خَيْرًا لَّهُم ۖ بَلْ هُوَ شَرٌّ لَّهُمْ ۖ سَيُطَوَّقُونَ مَا بَخِلُوا۟ بِهِۦ يَوْمَ ٱلْقِيَـٰمَةِ ۗ وَلِلَّهِ مِيرَٰثُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۗ وَٱللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ",
      "en": "Let the stingy not suppose that [their grudging] what Allah has given them out of His bounty is good for them; no, it is bad for them. They will be collared with what they grudge on the Day of Resurrection. To Allah belongs the heritage of the heavens and the earth, and Allah is well aware of what you do.",
      "_n": 180
    },
    {
      "ar": "لَّقَدْ سَمِعَ ٱللَّهُ قَوْلَ ٱلَّذِينَ قَالُوٓا۟ إِنَّ ٱللَّهَ فَقِيرٌ وَنَحْنُ أَغْنِيَآءُ ۘ سَنَكْتُبُ مَا قَالُوا۟ وَقَتْلَهُمُ ٱلْأَنۢبِيَآءَ بِغَيْرِ حَقٍّ وَنَقُولُ ذُوقُوا۟ عَذَابَ ٱلْحَرِيقِ",
      "en": "Allah has certainly heard the remark of those who said, ‘Allah is poor and we are rich.’ We will record what they have said, and their killing of the prophets unjustly, and We shall say, ‘Taste the punishment of the burning.",
      "_n": 181
    },
    {
      "ar": "ذَٰلِكَ بِمَا قَدَّمَتْ أَيْدِيكُمْ وَأَنَّ ٱللَّهَ لَيْسَ بِظَلَّامٍ لِّلْعَبِيدِ",
      "en": "That is because of what your hands have sent ahead, and because Allah is not tyrannical to His servants.’",
      "_n": 182
    },
    {
      "ar": "ٱلَّذِينَ قَالُوٓا۟ إِنَّ ٱللَّهَ عَهِدَ إِلَيْنَآ أَلَّا نُؤْمِنَ لِرَسُولٍ حَتَّىٰ يَأْتِيَنَا بِقُرْبَانٍ تَأْكُلُهُ ٱلنَّارُ ۗ قُلْ قَدْ جَآءَكُمْ رُسُلٌ مِّن قَبْلِى بِٱلْبَيِّنَـٰتِ وَبِٱلَّذِى قُلْتُمْ فَلِمَ قَتَلْتُمُوهُمْ إِن كُنتُمْ صَـٰدِقِينَ",
      "en": "Tell those who say, ‘Allah has pledged us not to believe in any apostle unless he brings us an offering consumed by fire,’ ‘Apostles before me certainly did bring you manifest signs and what you speak of. Then why did you kill them, if you are truthful?’",
      "_n": 183
    },
    {
      "ar": "فَإِن كَذَّبُوكَ فَقَدْ كُذِّبَ رُسُلٌ مِّن قَبْلِكَ جَآءُو بِٱلْبَيِّنَـٰتِ وَٱلزُّبُرِ وَٱلْكِتَـٰبِ ٱلْمُنِيرِ",
      "en": "But if they deny you, [other] apostles have been denied before you, who came with manifest signs, holy writs, and an illuminating scripture.",
      "_n": 184
    },
    {
      "ar": "كُلُّ نَفْسٍ ذَآئِقَةُ ٱلْمَوْتِ ۗ وَإِنَّمَا تُوَفَّوْنَ أُجُورَكُمْ يَوْمَ ٱلْقِيَـٰمَةِ ۖ فَمَن زُحْزِحَ عَنِ ٱلنَّارِ وَأُدْخِلَ ٱلْجَنَّةَ فَقَدْ فَازَ ۗ وَمَا ٱلْحَيَوٰةُ ٱلدُّنْيَآ إِلَّا مَتَـٰعُ ٱلْغُرُورِ",
      "en": "Every soul shall taste death, and you will indeed be paid your full rewards on the Day of Resurrection. Whoever is delivered from the Fire and admitted to paradise has certainly succeeded. The life of this world is nothing but the wares of delusion.",
      "_n": 185
    },
    {
      "ar": "لَتُبْلَوُنَّ فِىٓ أَمْوَٰلِكُمْ وَأَنفُسِكُمْ وَلَتَسْمَعُنَّ مِنَ ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَـٰبَ مِن قَبْلِكُمْ وَمِنَ ٱلَّذِينَ أَشْرَكُوٓا۟ أَذًى كَثِيرًا ۚ وَإِن تَصْبِرُوا۟ وَتَتَّقُوا۟ فَإِنَّ ذَٰلِكَ مِنْ عَزْمِ ٱلْأُمُورِ",
      "en": "You will surely be tested in your possessions and your souls, and you will surely hear much affront from those who were given the Book before you and from the polytheists; but if you are patient and Godwary, that is indeed the steadiest of courses.",
      "_n": 186
    },
    {
      "ar": "وَإِذْ أَخَذَ ٱللَّهُ مِيثَـٰقَ ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَـٰبَ لَتُبَيِّنُنَّهُۥ لِلنَّاسِ وَلَا تَكْتُمُونَهُۥ فَنَبَذُوهُ وَرَآءَ ظُهُورِهِمْ وَٱشْتَرَوْا۟ بِهِۦ ثَمَنًا قَلِيلًا ۖ فَبِئْسَ مَا يَشْتَرُونَ",
      "en": "When Allah made a covenant with those who were given the Book: ‘You shall explain it for the people, and you shall not conceal it,’ they cast it behind their backs and sold it for a paltry gain. How evil is what they buy!",
      "_n": 187
    },
    {
      "ar": "لَا تَحْسَبَنَّ ٱلَّذِينَ يَفْرَحُونَ بِمَآ أَتَوا۟ وَّيُحِبُّونَ أَن يُحْمَدُوا۟ بِمَا لَمْ يَفْعَلُوا۟ فَلَا تَحْسَبَنَّهُم بِمَفَازَةٍ مِّنَ ٱلْعَذَابِ ۖ وَلَهُمْ عَذَابٌ أَلِيمٌ",
      "en": "Do not suppose those who brag about what they have done, and love to be praised for what they have not done—do not suppose them saved from punishment and there is a painful punishment for them.",
      "_n": 188
    },
    {
      "ar": "وَلِلَّهِ مُلْكُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۗ وَٱللَّهُ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ",
      "en": "To Allah belongs the kingdom of the heavens and the earth, and Allah has power over all things.",
      "_n": 189
    },
    {
      "ar": "إِنَّ فِى خَلْقِ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ وَٱخْتِلَـٰفِ ٱلَّيْلِ وَٱلنَّهَارِ لَـَٔايَـٰتٍ لِّأُو۟لِى ٱلْأَلْبَـٰبِ",
      "en": "Indeed in the creation of the heavens and the earth and the alternation of night and day, there are signs for those who possess intellect.",
      "_n": 190
    },
    {
      "ar": "ٱلَّذِينَ يَذْكُرُونَ ٱللَّهَ قِيَـٰمًا وَقُعُودًا وَعَلَىٰ جُنُوبِهِمْ وَيَتَفَكَّرُونَ فِى خَلْقِ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ رَبَّنَا مَا خَلَقْتَ هَـٰذَا بَـٰطِلًا سُبْحَـٰنَكَ فَقِنَا عَذَابَ ٱلنَّارِ",
      "en": "Those who remember Allah standing, sitting, and lying on their sides, and reflect on the creation of the heavens and the earth [and say], ‘Our Lord, You have not created this in vain! Immaculate are You! Save us from the punishment of the Fire.",
      "_n": 191
    },
    {
      "ar": "رَبَّنَآ إِنَّكَ مَن تُدْخِلِ ٱلنَّارَ فَقَدْ أَخْزَيْتَهُۥ ۖ وَمَا لِلظَّـٰلِمِينَ مِنْ أَنصَارٍ",
      "en": "Our Lord, whoever that You make enter the Fire will surely have been disgraced by You, and the wrongdoers will have no helpers.",
      "_n": 192
    },
    {
      "ar": "رَّبَّنَآ إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِى لِلْإِيمَـٰنِ أَنْ ءَامِنُوا۟ بِرَبِّكُمْ فَـَٔامَنَّا ۚ رَبَّنَا فَٱغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّـَٔاتِنَا وَتَوَفَّنَا مَعَ ٱلْأَبْرَارِ",
      "en": "Our Lord, we have indeed heard a summoner calling to faith, declaring, ‘‘Have faith in your Lord!’’ So we believed. Our Lord, forgive us our sins and absolve us of our misdeeds, and make us die with the pious.",
      "_n": 193
    },
    {
      "ar": "رَبَّنَا وَءَاتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ ٱلْقِيَـٰمَةِ ۗ إِنَّكَ لَا تُخْلِفُ ٱلْمِيعَادَ",
      "en": "Our Lord, give us what You have promised us through Your apostles, and do not disgrace us on the Day of Resurrection. Indeed You do not break Your promise.’",
      "_n": 194
    },
    {
      "ar": "فَٱسْتَجَابَ لَهُمْ رَبُّهُمْ أَنِّى لَآ أُضِيعُ عَمَلَ عَـٰمِلٍ مِّنكُم مِّن ذَكَرٍ أَوْ أُنثَىٰ ۖ بَعْضُكُم مِّنۢ بَعْضٍ ۖ فَٱلَّذِينَ هَاجَرُوا۟ وَأُخْرِجُوا۟ مِن دِيَـٰرِهِمْ وَأُوذُوا۟ فِى سَبِيلِى وَقَـٰتَلُوا۟ وَقُتِلُوا۟ لَأُكَفِّرَنَّ عَنْهُمْ سَيِّـَٔاتِهِمْ وَلَأُدْخِلَنَّهُمْ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ ثَوَابًا مِّنْ عِندِ ٱللَّهِ ۗ وَٱللَّهُ عِندَهُۥ حُسْنُ ٱلثَّوَابِ",
      "en": "Then their Lord answered them, ‘I do not waste the work of any worker among you, whether male or female; you are all on the same footing. So those who migrated and were expelled from their homes, and were tormented in My way, and those who fought and were killed—I will surely absolve them of their misdeeds and I will admit them into gardens with streams running in them, as a reward from Allah, and Allah—with Him is the best of rewards.’",
      "_n": 195
    },
    {
      "ar": "لَا يَغُرَّنَّكَ تَقَلُّبُ ٱلَّذِينَ كَفَرُوا۟ فِى ٱلْبِلَـٰدِ",
      "en": "Never be misled by the bustle of the faithless in the towns.",
      "_n": 196
    },
    {
      "ar": "مَتَـٰعٌ قَلِيلٌ ثُمَّ مَأْوَىٰهُمْ جَهَنَّمُ ۚ وَبِئْسَ ٱلْمِهَادُ",
      "en": "It is a trivial enjoyment; then their refuge is hell, and it is an evil resting place.",
      "_n": 197
    },
    {
      "ar": "لَـٰكِنِ ٱلَّذِينَ ٱتَّقَوْا۟ رَبَّهُمْ لَهُمْ جَنَّـٰتٌ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَا نُزُلًا مِّنْ عِندِ ٱللَّهِ ۗ وَمَا عِندَ ٱللَّهِ خَيْرٌ لِّلْأَبْرَارِ",
      "en": "But those who are wary of their Lord—for them shall be gardens with streams running in them, to remain in them [forever], a hospitality from Allah; and what is with Allah is better for the pious.",
      "_n": 198
    },
    {
      "ar": "وَإِنَّ مِنْ أَهْلِ ٱلْكِتَـٰبِ لَمَن يُؤْمِنُ بِٱللَّهِ وَمَآ أُنزِلَ إِلَيْكُمْ وَمَآ أُنزِلَ إِلَيْهِمْ خَـٰشِعِينَ لِلَّهِ لَا يَشْتَرُونَ بِـَٔايَـٰتِ ٱللَّهِ ثَمَنًا قَلِيلًا ۗ أُو۟لَـٰٓئِكَ لَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ ۗ إِنَّ ٱللَّهَ سَرِيعُ ٱلْحِسَابِ",
      "en": "Indeed among the People of the Book there are some who have faith in Allah and in what has been sent down to you, and in what has been sent down to them. Humble toward Allah, they do not sell the signs of Allah for a paltry gain. They shall have their reward near their Lord; indeed Allah is swift at reckoning.",
      "_n": 199
    },
    {
      "ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱصْبِرُوا۟ وَصَابِرُوا۟ وَرَابِطُوا۟ وَٱتَّقُوا۟ ٱللَّهَ لَعَلَّكُمْ تُفْلِحُونَ",
      "en": "O you who have faith! Be patient, stand firm, and close [your] ranks, and be wary of Allah so that you may be felicitous.",
      "_n": 200
    }
  ],
  "_n": 3,
  "_c": 200
}