{
  "ar": "الأحزاب",
  "en": "The Clans",
  "_a": "Al-Ahzaab",
  "_l": "Medinan",
  "_v": [
    {
      "ar": "يَـٰٓأَيُّهَا ٱلنَّبِىُّ ٱتَّقِ ٱللَّهَ وَلَا تُطِعِ ٱلْكَـٰفِرِينَ وَٱلْمُنَـٰفِقِينَ ۗ إِنَّ ٱللَّهَ كَانَ عَلِيمًا حَكِيمًا",
      "en": "O Prophet! Be wary of Allah and do not obey the faithless and the hypocrites. Indeed Allah is all-knowing, all-wise.",
      "_n": 1
    },
    {
      "ar": "وَٱتَّبِعْ مَا يُوحَىٰٓ إِلَيْكَ مِن رَّبِّكَ ۚ إِنَّ ٱللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا",
      "en": "Follow that which is revealed to you from your Lord. Indeed Allah is well aware of what you do.",
      "_n": 2
    },
    {
      "ar": "وَتَوَكَّلْ عَلَى ٱللَّهِ ۚ وَكَفَىٰ بِٱللَّهِ وَكِيلًا",
      "en": "And put your trust in Allah; Allah suffices as trustee.",
      "_n": 3
    },
    {
      "ar": "مَّا جَعَلَ ٱللَّهُ لِرَجُلٍ مِّن قَلْبَيْنِ فِى جَوْفِهِۦ ۚ وَمَا جَعَلَ أَزْوَٰجَكُمُ ٱلَّـٰٓـِٔى تُظَـٰهِرُونَ مِنْهُنَّ أُمَّهَـٰتِكُمْ ۚ وَمَا جَعَلَ أَدْعِيَآءَكُمْ أَبْنَآءَكُمْ ۚ ذَٰلِكُمْ قَوْلُكُم بِأَفْوَٰهِكُمْ ۖ وَٱللَّهُ يَقُولُ ٱلْحَقَّ وَهُوَ يَهْدِى ٱلسَّبِيلَ",
      "en": "Allah has not put two hearts within any man, nor has He made your wives whom you repudiate by zihar your mothers, nor has he made your adopted sons your [actual] sons. These are mere utterances of your mouths. But Allah speaks the truth and He guides to the [right] way.",
      "_n": 4
    },
    {
      "ar": "ٱدْعُوهُمْ لِـَٔابَآئِهِمْ هُوَ أَقْسَطُ عِندَ ٱللَّهِ ۚ فَإِن لَّمْ تَعْلَمُوٓا۟ ءَابَآءَهُمْ فَإِخْوَٰنُكُمْ فِى ٱلدِّينِ وَمَوَٰلِيكُمْ ۚ وَلَيْسَ عَلَيْكُمْ جُنَاحٌ فِيمَآ أَخْطَأْتُم بِهِۦ وَلَـٰكِن مَّا تَعَمَّدَتْ قُلُوبُكُمْ ۚ وَكَانَ ٱللَّهُ غَفُورًا رَّحِيمًا",
      "en": "Call them after their fathers. That is more just with Allah. If you do not know their fathers, then they are your brethren in the faith and your kinsmen. Excepting what your hearts may intend deliberately, there will be no sin upon you for any mistake that you may make therein. And Allah is all-forgiving, all-merciful.",
      "_n": 5
    },
    {
      "ar": "ٱلنَّبِىُّ أَوْلَىٰ بِٱلْمُؤْمِنِينَ مِنْ أَنفُسِهِمْ ۖ وَأَزْوَٰجُهُۥٓ أُمَّهَـٰتُهُمْ ۗ وَأُو۟لُوا۟ ٱلْأَرْحَامِ بَعْضُهُمْ أَوْلَىٰ بِبَعْضٍ فِى كِتَـٰبِ ٱللَّهِ مِنَ ٱلْمُؤْمِنِينَ وَٱلْمُهَـٰجِرِينَ إِلَّآ أَن تَفْعَلُوٓا۟ إِلَىٰٓ أَوْلِيَآئِكُم مَّعْرُوفًا ۚ كَانَ ذَٰلِكَ فِى ٱلْكِتَـٰبِ مَسْطُورًا",
      "en": "The Prophet is closer to the faithful than their own souls, and his wives are their mothers. The blood relatives are more entitled to inherit from one another in the Book of Allah than the [other] faithful and Emigrants, barring any favour you may do your comrades. This has been written in the Book.",
      "_n": 6
    },
    {
      "ar": "وَإِذْ أَخَذْنَا مِنَ ٱلنَّبِيِّـۧنَ مِيثَـٰقَهُمْ وَمِنكَ وَمِن نُّوحٍ وَإِبْرَٰهِيمَ وَمُوسَىٰ وَعِيسَى ٱبْنِ مَرْيَمَ ۖ وَأَخَذْنَا مِنْهُم مِّيثَـٰقًا غَلِيظًا",
      "en": "[Recall] when We took a pledge from the prophets, and from you and from Noah and Abraham and Moses and Jesus son of Mary, and We took from them a solemn pledge,",
      "_n": 7
    },
    {
      "ar": "لِّيَسْـَٔلَ ٱلصَّـٰدِقِينَ عَن صِدْقِهِمْ ۚ وَأَعَدَّ لِلْكَـٰفِرِينَ عَذَابًا أَلِيمًا",
      "en": "so that He may question the truthful concerning their truthfulness. And He has prepared for the faithless a painful punishment.",
      "_n": 8
    },
    {
      "ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱذْكُرُوا۟ نِعْمَةَ ٱللَّهِ عَلَيْكُمْ إِذْ جَآءَتْكُمْ جُنُودٌ فَأَرْسَلْنَا عَلَيْهِمْ رِيحًا وَجُنُودًا لَّمْ تَرَوْهَا ۚ وَكَانَ ٱللَّهُ بِمَا تَعْمَلُونَ بَصِيرًا",
      "en": "O you who have faith! Remember Allah’s blessing upon you when the hosts came at you, and We sent against them a gale and hosts whom you did not see, and Allah sees best what you do.",
      "_n": 9
    },
    {
      "ar": "إِذْ جَآءُوكُم مِّن فَوْقِكُمْ وَمِنْ أَسْفَلَ مِنكُمْ وَإِذْ زَاغَتِ ٱلْأَبْصَـٰرُ وَبَلَغَتِ ٱلْقُلُوبُ ٱلْحَنَاجِرَ وَتَظُنُّونَ بِٱللَّهِ ٱلظُّنُونَا۠",
      "en": "When they came at you from above and below you, and when the eyes rolled [with fear] and the hearts leapt to the throats, and you entertained misgivings about Allah,",
      "_n": 10
    },
    {
      "ar": "هُنَالِكَ ٱبْتُلِىَ ٱلْمُؤْمِنُونَ وَزُلْزِلُوا۟ زِلْزَالًا شَدِيدًا",
      "en": "it was there that the faithful were tested and jolted with a severe agitation.",
      "_n": 11
    },
    {
      "ar": "وَإِذْ يَقُولُ ٱلْمُنَـٰفِقُونَ وَٱلَّذِينَ فِى قُلُوبِهِم مَّرَضٌ مَّا وَعَدَنَا ٱللَّهُ وَرَسُولُهُۥٓ إِلَّا غُرُورًا",
      "en": "When the hypocrites, as well as those in whose hearts is a sickness, were saying, ‘Allah and His Apostle did not promise us [anything] except delusion.’",
      "_n": 12
    },
    {
      "ar": "وَإِذْ قَالَت طَّآئِفَةٌ مِّنْهُمْ يَـٰٓأَهْلَ يَثْرِبَ لَا مُقَامَ لَكُمْ فَٱرْجِعُوا۟ ۚ وَيَسْتَـْٔذِنُ فَرِيقٌ مِّنْهُمُ ٱلنَّبِىَّ يَقُولُونَ إِنَّ بُيُوتَنَا عَوْرَةٌ وَمَا هِىَ بِعَوْرَةٍ ۖ إِن يُرِيدُونَ إِلَّا فِرَارًا",
      "en": "And when a group of them said, ‘O people of Yathrib! [This is] not a place for you, so go back!’ A group of them sought the Prophet’s permission [to leave the scene of battle], saying, ‘Our homes lie exposed [to the enemy],’ although they were not exposed. They only sought to flee.",
      "_n": 13
    },
    {
      "ar": "وَلَوْ دُخِلَتْ عَلَيْهِم مِّنْ أَقْطَارِهَا ثُمَّ سُئِلُوا۟ ٱلْفِتْنَةَ لَـَٔاتَوْهَا وَمَا تَلَبَّثُوا۟ بِهَآ إِلَّا يَسِيرًا",
      "en": "Had they been invaded from its flanks and had they been asked to apostatize, they would have done so with only a mild hesitation,",
      "_n": 14
    },
    {
      "ar": "وَلَقَدْ كَانُوا۟ عَـٰهَدُوا۟ ٱللَّهَ مِن قَبْلُ لَا يُوَلُّونَ ٱلْأَدْبَـٰرَ ۚ وَكَانَ عَهْدُ ٱللَّهِ مَسْـُٔولًا",
      "en": "though they had already pledged to Allah before that they would not turn their backs [to flee], and pledges given to Allah are accountable.",
      "_n": 15
    },
    {
      "ar": "قُل لَّن يَنفَعَكُمُ ٱلْفِرَارُ إِن فَرَرْتُم مِّنَ ٱلْمَوْتِ أَوِ ٱلْقَتْلِ وَإِذًا لَّا تُمَتَّعُونَ إِلَّا قَلِيلًا",
      "en": "Say, ‘Flight will not avail you, if you flee from death, or from being killed, and then you will be let to enjoy only for a little while.’",
      "_n": 16
    },
    {
      "ar": "قُلْ مَن ذَا ٱلَّذِى يَعْصِمُكُم مِّنَ ٱللَّهِ إِنْ أَرَادَ بِكُمْ سُوٓءًا أَوْ أَرَادَ بِكُمْ رَحْمَةً ۚ وَلَا يَجِدُونَ لَهُم مِّن دُونِ ٱللَّهِ وَلِيًّا وَلَا نَصِيرًا",
      "en": "Say, ‘Who is it that can protect you from Allah if He desires to cause you harm or desires to grant you His mercy?’ Besides Allah they will not find for themselves any protector or helper.",
      "_n": 17
    },
    {
      "ar": "قَدْ يَعْلَمُ ٱللَّهُ ٱلْمُعَوِّقِينَ مِنكُمْ وَٱلْقَآئِلِينَ لِإِخْوَٰنِهِمْ هَلُمَّ إِلَيْنَا ۖ وَلَا يَأْتُونَ ٱلْبَأْسَ إِلَّا قَلِيلًا",
      "en": "Allah knows those of you who discourage others, and those who say to their brethren, ‘Come to us!’ and take little part in the battle,",
      "_n": 18
    },
    {
      "ar": "أَشِحَّةً عَلَيْكُمْ ۖ فَإِذَا جَآءَ ٱلْخَوْفُ رَأَيْتَهُمْ يَنظُرُونَ إِلَيْكَ تَدُورُ أَعْيُنُهُمْ كَٱلَّذِى يُغْشَىٰ عَلَيْهِ مِنَ ٱلْمَوْتِ ۖ فَإِذَا ذَهَبَ ٱلْخَوْفُ سَلَقُوكُم بِأَلْسِنَةٍ حِدَادٍ أَشِحَّةً عَلَى ٱلْخَيْرِ ۚ أُو۟لَـٰٓئِكَ لَمْ يُؤْمِنُوا۟ فَأَحْبَطَ ٱللَّهُ أَعْمَـٰلَهُمْ ۚ وَكَانَ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرًا",
      "en": "grudging you [their help]. So when there is panic, you see them looking at you, with their eyes rolling like someone fainting at death. Then, when the panic is over, they scald you with [their] sharp tongues in their greed for the spoils. They never have had faith. So Allah has made their works fail, and that is easy for Allah.",
      "_n": 19
    },
    {
      "ar": "يَحْسَبُونَ ٱلْأَحْزَابَ لَمْ يَذْهَبُوا۟ ۖ وَإِن يَأْتِ ٱلْأَحْزَابُ يَوَدُّوا۟ لَوْ أَنَّهُم بَادُونَ فِى ٱلْأَعْرَابِ يَسْـَٔلُونَ عَنْ أَنۢبَآئِكُمْ ۖ وَلَوْ كَانُوا۟ فِيكُم مَّا قَـٰتَلُوٓا۟ إِلَّا قَلِيلًا",
      "en": "They suppose the confederates have not left yet, and were the confederates to come [again], they would wish they were in the desert with the Bedouins asking about your news, and if they were with you they would fight but a little.",
      "_n": 20
    },
    {
      "ar": "لَّقَدْ كَانَ لَكُمْ فِى رَسُولِ ٱللَّهِ أُسْوَةٌ حَسَنَةٌ لِّمَن كَانَ يَرْجُوا۟ ٱللَّهَ وَٱلْيَوْمَ ٱلْـَٔاخِرَ وَذَكَرَ ٱللَّهَ كَثِيرًا",
      "en": "There is certainly a good exemplar for you in the Apostle of Allah—for those who look forward to Allah and the Last Day, and remember Allah much.",
      "_n": 21
    },
    {
      "ar": "وَلَمَّا رَءَا ٱلْمُؤْمِنُونَ ٱلْأَحْزَابَ قَالُوا۟ هَـٰذَا مَا وَعَدَنَا ٱللَّهُ وَرَسُولُهُۥ وَصَدَقَ ٱللَّهُ وَرَسُولُهُۥ ۚ وَمَا زَادَهُمْ إِلَّآ إِيمَـٰنًا وَتَسْلِيمًا",
      "en": "But when the faithful saw the confederates, they said, ‘This is what Allah and His Apostle had promised us, and Allah and His Apostle were true.’ And it only increased them in faith and submission.",
      "_n": 22
    },
    {
      "ar": "مِّنَ ٱلْمُؤْمِنِينَ رِجَالٌ صَدَقُوا۟ مَا عَـٰهَدُوا۟ ٱللَّهَ عَلَيْهِ ۖ فَمِنْهُم مَّن قَضَىٰ نَحْبَهُۥ وَمِنْهُم مَّن يَنتَظِرُ ۖ وَمَا بَدَّلُوا۟ تَبْدِيلًا",
      "en": "Among the faithful are men who fulfill what they have pledged to Allah: there are some among them who have fulfilled their pledge, and some of them who still wait, and they have not changed in the least,",
      "_n": 23
    },
    {
      "ar": "لِّيَجْزِىَ ٱللَّهُ ٱلصَّـٰدِقِينَ بِصِدْقِهِمْ وَيُعَذِّبَ ٱلْمُنَـٰفِقِينَ إِن شَآءَ أَوْ يَتُوبَ عَلَيْهِمْ ۚ إِنَّ ٱللَّهَ كَانَ غَفُورًا رَّحِيمًا",
      "en": "that Allah may reward the true for their truthfulness, and punish the hypocrites, if He wishes, or accept their repentance. Indeed Allah is all-forgiving, all-merciful.",
      "_n": 24
    },
    {
      "ar": "وَرَدَّ ٱللَّهُ ٱلَّذِينَ كَفَرُوا۟ بِغَيْظِهِمْ لَمْ يَنَالُوا۟ خَيْرًا ۚ وَكَفَى ٱللَّهُ ٱلْمُؤْمِنِينَ ٱلْقِتَالَ ۚ وَكَانَ ٱللَّهُ قَوِيًّا عَزِيزًا",
      "en": "Allah sent back the faithless in their rage, without their attaining any advantage, and Allah spared the faithful of fighting, and Allah is all-strong, all-mighty.",
      "_n": 25
    },
    {
      "ar": "وَأَنزَلَ ٱلَّذِينَ ظَـٰهَرُوهُم مِّنْ أَهْلِ ٱلْكِتَـٰبِ مِن صَيَاصِيهِمْ وَقَذَفَ فِى قُلُوبِهِمُ ٱلرُّعْبَ فَرِيقًا تَقْتُلُونَ وَتَأْسِرُونَ فَرِيقًا",
      "en": "And He dragged down from their strongholds those who had backed them from among the People of the Book, and He cast terror into their hearts, [so that] you killed a part of them, and took captive [another] part.",
      "_n": 26
    },
    {
      "ar": "وَأَوْرَثَكُمْ أَرْضَهُمْ وَدِيَـٰرَهُمْ وَأَمْوَٰلَهُمْ وَأَرْضًا لَّمْ تَطَـُٔوهَا ۚ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَىْءٍ قَدِيرًا",
      "en": "He bequeathed you their land, their houses and their possessions, and a territory you had not trodden, and Allah has power over all things.",
      "_n": 27
    },
    {
      "ar": "يَـٰٓأَيُّهَا ٱلنَّبِىُّ قُل لِّأَزْوَٰجِكَ إِن كُنتُنَّ تُرِدْنَ ٱلْحَيَوٰةَ ٱلدُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ أُمَتِّعْكُنَّ وَأُسَرِّحْكُنَّ سَرَاحًا جَمِيلًا",
      "en": "O Prophet! Say to your wives, ‘If you desire the life of the world and its glitter, come, I will provide for you and release you in a graceful manner.",
      "_n": 28
    },
    {
      "ar": "وَإِن كُنتُنَّ تُرِدْنَ ٱللَّهَ وَرَسُولَهُۥ وَٱلدَّارَ ٱلْـَٔاخِرَةَ فَإِنَّ ٱللَّهَ أَعَدَّ لِلْمُحْسِنَـٰتِ مِنكُنَّ أَجْرًا عَظِيمًا",
      "en": "But if you desire Allah and His Apostle and the abode of the Hereafter, then Allah has indeed prepared a great reward for the virtuous among you.’",
      "_n": 29
    },
    {
      "ar": "يَـٰنِسَآءَ ٱلنَّبِىِّ مَن يَأْتِ مِنكُنَّ بِفَـٰحِشَةٍ مُّبَيِّنَةٍ يُضَـٰعَفْ لَهَا ٱلْعَذَابُ ضِعْفَيْنِ ۚ وَكَانَ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرًا",
      "en": "O wives of the Prophet! Whoever of you commits a gross indecency, her punishment shall be doubled, and that is easy for Allah.",
      "_n": 30
    },
    {
      "ar": "وَمَن يَقْنُتْ مِنكُنَّ لِلَّهِ وَرَسُولِهِۦ وَتَعْمَلْ صَـٰلِحًا نُّؤْتِهَآ أَجْرَهَا مَرَّتَيْنِ وَأَعْتَدْنَا لَهَا رِزْقًا كَرِيمًا",
      "en": "But whoever of you is obedient to Allah and His Apostle and acts righteously, We shall give her a twofold reward, and We will have in store for her a noble provision.",
      "_n": 31
    },
    {
      "ar": "يَـٰنِسَآءَ ٱلنَّبِىِّ لَسْتُنَّ كَأَحَدٍ مِّنَ ٱلنِّسَآءِ ۚ إِنِ ٱتَّقَيْتُنَّ فَلَا تَخْضَعْنَ بِٱلْقَوْلِ فَيَطْمَعَ ٱلَّذِى فِى قَلْبِهِۦ مَرَضٌ وَقُلْنَ قَوْلًا مَّعْرُوفًا",
      "en": "O wives of the Prophet! You are not like other women: if you are wary [of Allah], do not be complaisant in your speech, lest he in whose heart is a sickness should aspire; speak honourable words.",
      "_n": 32
    },
    {
      "ar": "وَقَرْنَ فِى بُيُوتِكُنَّ وَلَا تَبَرَّجْنَ تَبَرُّجَ ٱلْجَـٰهِلِيَّةِ ٱلْأُولَىٰ ۖ وَأَقِمْنَ ٱلصَّلَوٰةَ وَءَاتِينَ ٱلزَّكَوٰةَ وَأَطِعْنَ ٱللَّهَ وَرَسُولَهُۥٓ ۚ إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيرًا",
      "en": "Stay in your houses and do not flaunt your finery like the former [days of pagan] ignorance. Maintain the prayer and pay the zakat, and obey Allah and His Apostle. Indeed Allah desires to repel all impurity from you, O People of the Household, and purify you with a thorough purification.",
      "_n": 33
    },
    {
      "ar": "وَٱذْكُرْنَ مَا يُتْلَىٰ فِى بُيُوتِكُنَّ مِنْ ءَايَـٰتِ ٱللَّهِ وَٱلْحِكْمَةِ ۚ إِنَّ ٱللَّهَ كَانَ لَطِيفًا خَبِيرًا",
      "en": "And remember what is recited in your homes of the signs of Allah and wisdom. Indeed Allah is all-attentive, all-aware.",
      "_n": 34
    },
    {
      "ar": "إِنَّ ٱلْمُسْلِمِينَ وَٱلْمُسْلِمَـٰتِ وَٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَـٰتِ وَٱلْقَـٰنِتِينَ وَٱلْقَـٰنِتَـٰتِ وَٱلصَّـٰدِقِينَ وَٱلصَّـٰدِقَـٰتِ وَٱلصَّـٰبِرِينَ وَٱلصَّـٰبِرَٰتِ وَٱلْخَـٰشِعِينَ وَٱلْخَـٰشِعَـٰتِ وَٱلْمُتَصَدِّقِينَ وَٱلْمُتَصَدِّقَـٰتِ وَٱلصَّـٰٓئِمِينَ وَٱلصَّـٰٓئِمَـٰتِ وَٱلْحَـٰفِظِينَ فُرُوجَهُمْ وَٱلْحَـٰفِظَـٰتِ وَٱلذَّٰكِرِينَ ٱللَّهَ كَثِيرًا وَٱلذَّٰكِرَٰتِ أَعَدَّ ٱللَّهُ لَهُم مَّغْفِرَةً وَأَجْرًا عَظِيمًا",
      "en": "Indeed the muslim men and the muslim women, the faithful men and the faithful women, the obedient men and the obedient women, the truthful men and the truthful women, the patient men and the patient women, the humble men and the humble women, the charitable men and the charitable women, the men who fast and the women who fast, the men who guard their private parts and the women who guard, the men who remember Allah greatly and the women who remember [Allah greatly]—Allah holds in store for them forgiveness and a great reward.",
      "_n": 35
    },
    {
      "ar": "وَمَا كَانَ لِمُؤْمِنٍ وَلَا مُؤْمِنَةٍ إِذَا قَضَى ٱللَّهُ وَرَسُولُهُۥٓ أَمْرًا أَن يَكُونَ لَهُمُ ٱلْخِيَرَةُ مِنْ أَمْرِهِمْ ۗ وَمَن يَعْصِ ٱللَّهَ وَرَسُولَهُۥ فَقَدْ ضَلَّ ضَلَـٰلًا مُّبِينًا",
      "en": "A faithful man or woman may not have any option in their matter, when Allah and His Apostle have decided on a matter, and whoever disobeys Allah and His Apostle has certainly strayed into manifest error.",
      "_n": 36
    },
    {
      "ar": "وَإِذْ تَقُولُ لِلَّذِىٓ أَنْعَمَ ٱللَّهُ عَلَيْهِ وَأَنْعَمْتَ عَلَيْهِ أَمْسِكْ عَلَيْكَ زَوْجَكَ وَٱتَّقِ ٱللَّهَ وَتُخْفِى فِى نَفْسِكَ مَا ٱللَّهُ مُبْدِيهِ وَتَخْشَى ٱلنَّاسَ وَٱللَّهُ أَحَقُّ أَن تَخْشَىٰهُ ۖ فَلَمَّا قَضَىٰ زَيْدٌ مِّنْهَا وَطَرًا زَوَّجْنَـٰكَهَا لِكَىْ لَا يَكُونَ عَلَى ٱلْمُؤْمِنِينَ حَرَجٌ فِىٓ أَزْوَٰجِ أَدْعِيَآئِهِمْ إِذَا قَضَوْا۟ مِنْهُنَّ وَطَرًا ۚ وَكَانَ أَمْرُ ٱللَّهِ مَفْعُولًا",
      "en": "When you said to him whom Allah had blessed, and whom you [too] had blessed, ‘Retain your wife for yourself, and be wary of Allah,’ and you had hidden in your heart what Allah was to divulge, and you feared the people though Allah is worthier that you should fear Him, so when Zayd had got through with her, We wedded her to you, so that there may be no blame on the faithful in respect of the wives of their adopted sons, when the latter have got through with them, and Allah’s command is bound to be fulfilled.",
      "_n": 37
    },
    {
      "ar": "مَّا كَانَ عَلَى ٱلنَّبِىِّ مِنْ حَرَجٍ فِيمَا فَرَضَ ٱللَّهُ لَهُۥ ۖ سُنَّةَ ٱللَّهِ فِى ٱلَّذِينَ خَلَوْا۟ مِن قَبْلُ ۚ وَكَانَ أَمْرُ ٱللَّهِ قَدَرًا مَّقْدُورًا",
      "en": "There is no blame on the Prophet in respect of that which Allah has made lawful for him: Allah’s precedent with those who passed away earlier (and Allah’s commands are ordained by a precise ordaining),",
      "_n": 38
    },
    {
      "ar": "ٱلَّذِينَ يُبَلِّغُونَ رِسَـٰلَـٰتِ ٱللَّهِ وَيَخْشَوْنَهُۥ وَلَا يَخْشَوْنَ أَحَدًا إِلَّا ٱللَّهَ ۗ وَكَفَىٰ بِٱللَّهِ حَسِيبًا",
      "en": "such as deliver the messages of Allah and fear Him, and fear no one except Allah, and Allah suffices as reckoner.",
      "_n": 39
    },
    {
      "ar": "مَّا كَانَ مُحَمَّدٌ أَبَآ أَحَدٍ مِّن رِّجَالِكُمْ وَلَـٰكِن رَّسُولَ ٱللَّهِ وَخَاتَمَ ٱلنَّبِيِّـۧنَ ۗ وَكَانَ ٱللَّهُ بِكُلِّ شَىْءٍ عَلِيمًا",
      "en": "Muhammad is not the father of any man among you, but he is the Apostle of Allah and the Seal of the Prophets, and Allah has knowledge of all things.",
      "_n": 40
    },
    {
      "ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱذْكُرُوا۟ ٱللَّهَ ذِكْرًا كَثِيرًا",
      "en": "O you who have faith! Remember Allah with frequent remembrance,",
      "_n": 41
    },
    {
      "ar": "وَسَبِّحُوهُ بُكْرَةً وَأَصِيلًا",
      "en": "and glorify Him morning and evening.",
      "_n": 42
    },
    {
      "ar": "هُوَ ٱلَّذِى يُصَلِّى عَلَيْكُمْ وَمَلَـٰٓئِكَتُهُۥ لِيُخْرِجَكُم مِّنَ ٱلظُّلُمَـٰتِ إِلَى ٱلنُّورِ ۚ وَكَانَ بِٱلْمُؤْمِنِينَ رَحِيمًا",
      "en": "It is He who blesses you—and so do His angels—that He may bring you out from darkness into light, and He is most merciful to the faithful.",
      "_n": 43
    },
    {
      "ar": "تَحِيَّتُهُمْ يَوْمَ يَلْقَوْنَهُۥ سَلَـٰمٌ ۚ وَأَعَدَّ لَهُمْ أَجْرًا كَرِيمًا",
      "en": "The day they encounter Him, their greeting will be, ‘Peace,’ and He holds in store for them a noble reward.",
      "_n": 44
    },
    {
      "ar": "يَـٰٓأَيُّهَا ٱلنَّبِىُّ إِنَّآ أَرْسَلْنَـٰكَ شَـٰهِدًا وَمُبَشِّرًا وَنَذِيرًا",
      "en": "O Prophet! Indeed We have sent you as a witness, as a bearer of good news and as a warner",
      "_n": 45
    },
    {
      "ar": "وَدَاعِيًا إِلَى ٱللَّهِ بِإِذْنِهِۦ وَسِرَاجًا مُّنِيرًا",
      "en": "and as a summoner to Allah by His permission, and as a radiant lamp.",
      "_n": 46
    },
    {
      "ar": "وَبَشِّرِ ٱلْمُؤْمِنِينَ بِأَنَّ لَهُم مِّنَ ٱللَّهِ فَضْلًا كَبِيرًا",
      "en": "Announce to the faithful the good news that there will be for them a great grace from Allah.",
      "_n": 47
    },
    {
      "ar": "وَلَا تُطِعِ ٱلْكَـٰفِرِينَ وَٱلْمُنَـٰفِقِينَ وَدَعْ أَذَىٰهُمْ وَتَوَكَّلْ عَلَى ٱللَّهِ ۚ وَكَفَىٰ بِٱللَّهِ وَكِيلًا",
      "en": "Do not obey the faithless and the hypocrites, and disregard their torments, and put your trust in Allah, and Allah suffices as trustee.",
      "_n": 48
    },
    {
      "ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِذَا نَكَحْتُمُ ٱلْمُؤْمِنَـٰتِ ثُمَّ طَلَّقْتُمُوهُنَّ مِن قَبْلِ أَن تَمَسُّوهُنَّ فَمَا لَكُمْ عَلَيْهِنَّ مِنْ عِدَّةٍ تَعْتَدُّونَهَا ۖ فَمَتِّعُوهُنَّ وَسَرِّحُوهُنَّ سَرَاحًا جَمِيلًا",
      "en": "O you who have faith! When you marry faithful women and then divorce them before you touch them, there shall be no period for you to reckon. But provide for them and release them in a graceful manner.",
      "_n": 49
    },
    {
      "ar": "يَـٰٓأَيُّهَا ٱلنَّبِىُّ إِنَّآ أَحْلَلْنَا لَكَ أَزْوَٰجَكَ ٱلَّـٰتِىٓ ءَاتَيْتَ أُجُورَهُنَّ وَمَا مَلَكَتْ يَمِينُكَ مِمَّآ أَفَآءَ ٱللَّهُ عَلَيْكَ وَبَنَاتِ عَمِّكَ وَبَنَاتِ عَمَّـٰتِكَ وَبَنَاتِ خَالِكَ وَبَنَاتِ خَـٰلَـٰتِكَ ٱلَّـٰتِى هَاجَرْنَ مَعَكَ وَٱمْرَأَةً مُّؤْمِنَةً إِن وَهَبَتْ نَفْسَهَا لِلنَّبِىِّ إِنْ أَرَادَ ٱلنَّبِىُّ أَن يَسْتَنكِحَهَا خَالِصَةً لَّكَ مِن دُونِ ٱلْمُؤْمِنِينَ ۗ قَدْ عَلِمْنَا مَا فَرَضْنَا عَلَيْهِمْ فِىٓ أَزْوَٰجِهِمْ وَمَا مَلَكَتْ أَيْمَـٰنُهُمْ لِكَيْلَا يَكُونَ عَلَيْكَ حَرَجٌ ۗ وَكَانَ ٱللَّهُ غَفُورًا رَّحِيمًا",
      "en": "O Prophet! Indeed We have made lawful to you your wives whom you have given their dowries, and those whom your right hand owns, of those whom Allah gave you as spoils of war, and the daughters of your paternal uncle, and the daughters of your paternal aunts, and the daughters of your maternal uncle, and the daughters of your maternal aunts who migrated with you, and a faithful woman if she offers herself to the Prophet and the Prophet desires to take her in marriage (a privilege exclusively for you, not for [the rest of] the faithful; We know what We have made lawful for them with respect to their wives and those whom their right hands own, so that there may be no blame on you ), and Allah is all-forgiving, all-merciful.",
      "_n": 50
    },
    {
      "ar": "تُرْجِى مَن تَشَآءُ مِنْهُنَّ وَتُـْٔوِىٓ إِلَيْكَ مَن تَشَآءُ ۖ وَمَنِ ٱبْتَغَيْتَ مِمَّنْ عَزَلْتَ فَلَا جُنَاحَ عَلَيْكَ ۚ ذَٰلِكَ أَدْنَىٰٓ أَن تَقَرَّ أَعْيُنُهُنَّ وَلَا يَحْزَنَّ وَيَرْضَيْنَ بِمَآ ءَاتَيْتَهُنَّ كُلُّهُنَّ ۚ وَٱللَّهُ يَعْلَمُ مَا فِى قُلُوبِكُمْ ۚ وَكَانَ ٱللَّهُ عَلِيمًا حَلِيمًا",
      "en": "You may put off whichever of them you wish and consort with whichever of them you wish, and there is no sin upon you [in receiving again] any [of them] whom you may seek [to consort with] from among those you have set aside [earlier]. That makes it likelier that they will be comforted and not feel unhappy, and all of them will be pleased with what you give them. Allah knows what is in your hearts, and Allah is all-knowing, all-forbearing.",
      "_n": 51
    },
    {
      "ar": "لَّا يَحِلُّ لَكَ ٱلنِّسَآءُ مِنۢ بَعْدُ وَلَآ أَن تَبَدَّلَ بِهِنَّ مِنْ أَزْوَٰجٍ وَلَوْ أَعْجَبَكَ حُسْنُهُنَّ إِلَّا مَا مَلَكَتْ يَمِينُكَ ۗ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَىْءٍ رَّقِيبًا",
      "en": "Beyond that, women are not lawful for you, nor that you should change them for other wives even though their beauty should impress you, except those whom your right hand owns. Allah is watchful over all things.",
      "_n": 52
    },
    {
      "ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَدْخُلُوا۟ بُيُوتَ ٱلنَّبِىِّ إِلَّآ أَن يُؤْذَنَ لَكُمْ إِلَىٰ طَعَامٍ غَيْرَ نَـٰظِرِينَ إِنَىٰهُ وَلَـٰكِنْ إِذَا دُعِيتُمْ فَٱدْخُلُوا۟ فَإِذَا طَعِمْتُمْ فَٱنتَشِرُوا۟ وَلَا مُسْتَـْٔنِسِينَ لِحَدِيثٍ ۚ إِنَّ ذَٰلِكُمْ كَانَ يُؤْذِى ٱلنَّبِىَّ فَيَسْتَحْىِۦ مِنكُمْ ۖ وَٱللَّهُ لَا يَسْتَحْىِۦ مِنَ ٱلْحَقِّ ۚ وَإِذَا سَأَلْتُمُوهُنَّ مَتَـٰعًا فَسْـَٔلُوهُنَّ مِن وَرَآءِ حِجَابٍ ۚ ذَٰلِكُمْ أَطْهَرُ لِقُلُوبِكُمْ وَقُلُوبِهِنَّ ۚ وَمَا كَانَ لَكُمْ أَن تُؤْذُوا۟ رَسُولَ ٱللَّهِ وَلَآ أَن تَنكِحُوٓا۟ أَزْوَٰجَهُۥ مِنۢ بَعْدِهِۦٓ أَبَدًا ۚ إِنَّ ذَٰلِكُمْ كَانَ عِندَ ٱللَّهِ عَظِيمًا",
      "en": "O you who have faith! Do not enter the Prophet’s houses for a meal until you are granted permission, without hanging around for it to be readied. But enter when you are invited, and disperse when you have taken your meal, without cozying up for chats. Such conduct on your part offends the Prophet, and he is ashamed of [asking] you [to leave]; but Allah is not ashamed of [expressing] the truth. When you ask [his] womenfolk for something, do so from behind a curtain. That is more chaste for your hearts and theirs. You should not offend the Apostle of Allah, nor may you ever marry his wives after him. Indeed that would be a grave [sin] with Allah.",
      "_n": 53
    },
    {
      "ar": "إِن تُبْدُوا۟ شَيْـًٔا أَوْ تُخْفُوهُ فَإِنَّ ٱللَّهَ كَانَ بِكُلِّ شَىْءٍ عَلِيمًا",
      "en": "Whether you disclose anything or hide it, Allah indeed knows all things.",
      "_n": 54
    },
    {
      "ar": "لَّا جُنَاحَ عَلَيْهِنَّ فِىٓ ءَابَآئِهِنَّ وَلَآ أَبْنَآئِهِنَّ وَلَآ إِخْوَٰنِهِنَّ وَلَآ أَبْنَآءِ إِخْوَٰنِهِنَّ وَلَآ أَبْنَآءِ أَخَوَٰتِهِنَّ وَلَا نِسَآئِهِنَّ وَلَا مَا مَلَكَتْ أَيْمَـٰنُهُنَّ ۗ وَٱتَّقِينَ ٱللَّهَ ۚ إِنَّ ٱللَّهَ كَانَ عَلَىٰ كُلِّ شَىْءٍ شَهِيدًا",
      "en": "There is no sin on them [in socializing freely] with their fathers, or their sons, or their brothers, or their brothers’ sons, or the sons of their sisters, or their own womenfolk, or what their right hands own. Be wary of Allah. Indeed Allah is witness to all things.",
      "_n": 55
    },
    {
      "ar": "إِنَّ ٱللَّهَ وَمَلَـٰٓئِكَتَهُۥ يُصَلُّونَ عَلَى ٱلنَّبِىِّ ۚ يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ صَلُّوا۟ عَلَيْهِ وَسَلِّمُوا۟ تَسْلِيمًا",
      "en": "Indeed Allah and His angels bless the Prophet; O you who have faith! Invoke blessings on him and invoke Peace upon him in a worthy manner.",
      "_n": 56
    },
    {
      "ar": "إِنَّ ٱلَّذِينَ يُؤْذُونَ ٱللَّهَ وَرَسُولَهُۥ لَعَنَهُمُ ٱللَّهُ فِى ٱلدُّنْيَا وَٱلْـَٔاخِرَةِ وَأَعَدَّ لَهُمْ عَذَابًا مُّهِينًا",
      "en": "Indeed those who offend Allah and His Apostle are cursed by Allah in the world and the Hereafter, and He has prepared a humiliating punishment for them.",
      "_n": 57
    },
    {
      "ar": "وَٱلَّذِينَ يُؤْذُونَ ٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَـٰتِ بِغَيْرِ مَا ٱكْتَسَبُوا۟ فَقَدِ ٱحْتَمَلُوا۟ بُهْتَـٰنًا وَإِثْمًا مُّبِينًا",
      "en": "Those who offend faithful men and women undeservedly, certainly bear the guilt of slander and flagrant sin.",
      "_n": 58
    },
    {
      "ar": "يَـٰٓأَيُّهَا ٱلنَّبِىُّ قُل لِّأَزْوَٰجِكَ وَبَنَاتِكَ وَنِسَآءِ ٱلْمُؤْمِنِينَ يُدْنِينَ عَلَيْهِنَّ مِن جَلَـٰبِيبِهِنَّ ۚ ذَٰلِكَ أَدْنَىٰٓ أَن يُعْرَفْنَ فَلَا يُؤْذَيْنَ ۗ وَكَانَ ٱللَّهُ غَفُورًا رَّحِيمًا",
      "en": "O Prophet! Tell your wives and your daughters and the women of the faithful to draw closely over themselves their chadors [when going out]. That makes it likely for them to be recognized and not be troubled, and Allah is all-forgiving, all-merciful.",
      "_n": 59
    },
    {
      "ar": "لَّئِن لَّمْ يَنتَهِ ٱلْمُنَـٰفِقُونَ وَٱلَّذِينَ فِى قُلُوبِهِم مَّرَضٌ وَٱلْمُرْجِفُونَ فِى ٱلْمَدِينَةِ لَنُغْرِيَنَّكَ بِهِمْ ثُمَّ لَا يُجَاوِرُونَكَ فِيهَآ إِلَّا قَلِيلًا",
      "en": "If the hypocrites and those in whose hearts is a sickness, and the rumourmongers in the city do not desist, We will prompt you [to take action] against them; then they will not be your neighbours in it except briefly.",
      "_n": 60
    },
    {
      "ar": "مَّلْعُونِينَ ۖ أَيْنَمَا ثُقِفُوٓا۟ أُخِذُوا۟ وَقُتِّلُوا۟ تَقْتِيلًا",
      "en": "Accursed, they will be seized wherever they are confronted and slain violently:",
      "_n": 61
    },
    {
      "ar": "سُنَّةَ ٱللَّهِ فِى ٱلَّذِينَ خَلَوْا۟ مِن قَبْلُ ۖ وَلَن تَجِدَ لِسُنَّةِ ٱللَّهِ تَبْدِيلًا",
      "en": "Allah’s precedent with those who passed away before, and you will never find any change in Allah’s precedent.",
      "_n": 62
    },
    {
      "ar": "يَسْـَٔلُكَ ٱلنَّاسُ عَنِ ٱلسَّاعَةِ ۖ قُلْ إِنَّمَا عِلْمُهَا عِندَ ٱللَّهِ ۚ وَمَا يُدْرِيكَ لَعَلَّ ٱلسَّاعَةَ تَكُونُ قَرِيبًا",
      "en": "The people question you concerning the Hour. Say, ‘Its knowledge is only with Allah.’ What do you know, maybe the Hour is near.",
      "_n": 63
    },
    {
      "ar": "إِنَّ ٱللَّهَ لَعَنَ ٱلْكَـٰفِرِينَ وَأَعَدَّ لَهُمْ سَعِيرًا",
      "en": "Indeed Allah has cursed the faithless and prepared for them a blaze,",
      "_n": 64
    },
    {
      "ar": "خَـٰلِدِينَ فِيهَآ أَبَدًا ۖ لَّا يَجِدُونَ وَلِيًّا وَلَا نَصِيرًا",
      "en": "in which they will remain forever, and will not find any guardian or helper.",
      "_n": 65
    },
    {
      "ar": "يَوْمَ تُقَلَّبُ وُجُوهُهُمْ فِى ٱلنَّارِ يَقُولُونَ يَـٰلَيْتَنَآ أَطَعْنَا ٱللَّهَ وَأَطَعْنَا ٱلرَّسُولَا۠",
      "en": "The day when their faces are turned about in the Fire, they will say, ‘We wish we had obeyed Allah and obeyed the Apostle!’",
      "_n": 66
    },
    {
      "ar": "وَقَالُوا۟ رَبَّنَآ إِنَّآ أَطَعْنَا سَادَتَنَا وَكُبَرَآءَنَا فَأَضَلُّونَا ٱلسَّبِيلَا۠",
      "en": "They will say, ‘Our Lord! We obeyed our leaders and elders, and they led us astray from the way.’",
      "_n": 67
    },
    {
      "ar": "رَبَّنَآ ءَاتِهِمْ ضِعْفَيْنِ مِنَ ٱلْعَذَابِ وَٱلْعَنْهُمْ لَعْنًا كَبِيرًا",
      "en": "Our Lord! Give them a double punishment and curse them with a mighty curse.’",
      "_n": 68
    },
    {
      "ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَكُونُوا۟ كَٱلَّذِينَ ءَاذَوْا۟ مُوسَىٰ فَبَرَّأَهُ ٱللَّهُ مِمَّا قَالُوا۟ ۚ وَكَانَ عِندَ ٱللَّهِ وَجِيهًا",
      "en": "O you who have faith! Do not be like those who offended Moses, whereat Allah cleared him of what they alleged, and he was distinguished in Allah’s sight.",
      "_n": 69
    },
    {
      "ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱتَّقُوا۟ ٱللَّهَ وَقُولُوا۟ قَوْلًا سَدِيدًا",
      "en": "O you who have faith! Be wary of Allah, and speak upright words.",
      "_n": 70
    },
    {
      "ar": "يُصْلِحْ لَكُمْ أَعْمَـٰلَكُمْ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ ۗ وَمَن يُطِعِ ٱللَّهَ وَرَسُولَهُۥ فَقَدْ فَازَ فَوْزًا عَظِيمًا",
      "en": "He will rectify your conduct for you and forgive you your sins. Whoever obeys Allah and His Apostle will certainly achieve a great success.",
      "_n": 71
    },
    {
      "ar": "إِنَّا عَرَضْنَا ٱلْأَمَانَةَ عَلَى ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ وَٱلْجِبَالِ فَأَبَيْنَ أَن يَحْمِلْنَهَا وَأَشْفَقْنَ مِنْهَا وَحَمَلَهَا ٱلْإِنسَـٰنُ ۖ إِنَّهُۥ كَانَ ظَلُومًا جَهُولًا",
      "en": "Indeed We presented the Trust to the heavens and the earth and the mountains, but they refused to undertake it and were apprehensive of it; but man undertook it. Indeed he is most unjust and ignorant.",
      "_n": 72
    },
    {
      "ar": "لِّيُعَذِّبَ ٱللَّهُ ٱلْمُنَـٰفِقِينَ وَٱلْمُنَـٰفِقَـٰتِ وَٱلْمُشْرِكِينَ وَٱلْمُشْرِكَـٰتِ وَيَتُوبَ ٱللَّهُ عَلَى ٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَـٰتِ ۗ وَكَانَ ٱللَّهُ غَفُورًا رَّحِيمًۢا",
      "en": "Allah will surely punish the hypocrites, men and women, and the polytheists, men and women, and Allah will turn clemently to the faithful, men and women, and Allah is all-forgiving, all-merciful.",
      "_n": 73
    }
  ],
  "_n": 33,
  "_c": 73
}