{
  "ar": "سبأ",
  "en": "Sheba",
  "_a": "Saba",
  "_l": "Meccan",
  "_v": [
    {
      "ar": "ٱلْحَمْدُ لِلَّهِ ٱلَّذِى لَهُۥ مَا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ وَلَهُ ٱلْحَمْدُ فِى ٱلْـَٔاخِرَةِ ۚ وَهُوَ ٱلْحَكِيمُ ٱلْخَبِيرُ",
      "en": "All praise belongs to Allah to whom belongs whatever is in the heavens and whatever is in the earth. To Him belongs all praise in the Hereafter, and He is the All-wise, the All-aware.",
      "_n": 1
    },
    {
      "ar": "يَعْلَمُ مَا يَلِجُ فِى ٱلْأَرْضِ وَمَا يَخْرُجُ مِنْهَا وَمَا يَنزِلُ مِنَ ٱلسَّمَآءِ وَمَا يَعْرُجُ فِيهَا ۚ وَهُوَ ٱلرَّحِيمُ ٱلْغَفُورُ",
      "en": "He knows whatever enters into the earth and whatever emerges from it, and whatever descends from the sky and whatever ascends into it, and He is the All-merciful, the All-forgiving.",
      "_n": 2
    },
    {
      "ar": "وَقَالَ ٱلَّذِينَ كَفَرُوا۟ لَا تَأْتِينَا ٱلسَّاعَةُ ۖ قُلْ بَلَىٰ وَرَبِّى لَتَأْتِيَنَّكُمْ عَـٰلِمِ ٱلْغَيْبِ ۖ لَا يَعْزُبُ عَنْهُ مِثْقَالُ ذَرَّةٍ فِى ٱلسَّمَـٰوَٰتِ وَلَا فِى ٱلْأَرْضِ وَلَآ أَصْغَرُ مِن ذَٰلِكَ وَلَآ أَكْبَرُ إِلَّا فِى كِتَـٰبٍ مُّبِينٍ",
      "en": "The faithless say, ‘The Hour will not overtake us.’ Say, ‘Yes, indeed it will surely overtake you, by my Lord,’ the Knower of the Unseen; not [even] an atom’s weight escapes Him in the heavens or in the earth, nor [is there] anything smaller than that nor bigger, but it is in a manifest Book,",
      "_n": 3
    },
    {
      "ar": "لِّيَجْزِىَ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ ۚ أُو۟لَـٰٓئِكَ لَهُم مَّغْفِرَةٌ وَرِزْقٌ كَرِيمٌ",
      "en": "that He may reward those who have faith and do righteous deeds.’ For such there will be forgiveness and a noble provision.",
      "_n": 4
    },
    {
      "ar": "وَٱلَّذِينَ سَعَوْ فِىٓ ءَايَـٰتِنَا مُعَـٰجِزِينَ أُو۟لَـٰٓئِكَ لَهُمْ عَذَابٌ مِّن رِّجْزٍ أَلِيمٌ",
      "en": "But those who contend with Our signs seeking to frustrate [their purpose], for such is a painful punishment due to defilement.",
      "_n": 5
    },
    {
      "ar": "وَيَرَى ٱلَّذِينَ أُوتُوا۟ ٱلْعِلْمَ ٱلَّذِىٓ أُنزِلَ إِلَيْكَ مِن رَّبِّكَ هُوَ ٱلْحَقَّ وَيَهْدِىٓ إِلَىٰ صِرَٰطِ ٱلْعَزِيزِ ٱلْحَمِيدِ",
      "en": "Those who have been given knowledge see that what has been sent down to you from your Lord is the truth and [that] it guides to the path of the All-mighty, the All-laudable.",
      "_n": 6
    },
    {
      "ar": "وَقَالَ ٱلَّذِينَ كَفَرُوا۟ هَلْ نَدُلُّكُمْ عَلَىٰ رَجُلٍ يُنَبِّئُكُمْ إِذَا مُزِّقْتُمْ كُلَّ مُمَزَّقٍ إِنَّكُمْ لَفِى خَلْقٍ جَدِيدٍ",
      "en": "The faithless say, ‘Shall we show you a man who will inform you [that] when you have been totally rent to pieces you will indeed have a new creation?",
      "_n": 7
    },
    {
      "ar": "أَفْتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَم بِهِۦ جِنَّةٌۢ ۗ بَلِ ٱلَّذِينَ لَا يُؤْمِنُونَ بِٱلْـَٔاخِرَةِ فِى ٱلْعَذَابِ وَٱلضَّلَـٰلِ ٱلْبَعِيدِ",
      "en": "Has he fabricated a lie against Allah, or is there a madness in him?’ Indeed, those who do not believe in the Hereafter languish in punishment and extreme error.",
      "_n": 8
    },
    {
      "ar": "أَفَلَمْ يَرَوْا۟ إِلَىٰ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُم مِّنَ ٱلسَّمَآءِ وَٱلْأَرْضِ ۚ إِن نَّشَأْ نَخْسِفْ بِهِمُ ٱلْأَرْضَ أَوْ نُسْقِطْ عَلَيْهِمْ كِسَفًا مِّنَ ٱلسَّمَآءِ ۚ إِنَّ فِى ذَٰلِكَ لَـَٔايَةً لِّكُلِّ عَبْدٍ مُّنِيبٍ",
      "en": "Have they not regarded that which is before them and that which is behind them of the sky and the earth? If We like, We can make the earth swallow them, or let a fragment from the sky fall on them. There is indeed a sign in that for every penitent servant.",
      "_n": 9
    },
    {
      "ar": "وَلَقَدْ ءَاتَيْنَا دَاوُۥدَ مِنَّا فَضْلًا ۖ يَـٰجِبَالُ أَوِّبِى مَعَهُۥ وَٱلطَّيْرَ ۖ وَأَلَنَّا لَهُ ٱلْحَدِيدَ",
      "en": "Certainly We gave David our grace: ‘O mountains and birds, chime in with him!’ And We made iron soft for him,",
      "_n": 10
    },
    {
      "ar": "أَنِ ٱعْمَلْ سَـٰبِغَـٰتٍ وَقَدِّرْ فِى ٱلسَّرْدِ ۖ وَٱعْمَلُوا۟ صَـٰلِحًا ۖ إِنِّى بِمَا تَعْمَلُونَ بَصِيرٌ",
      "en": "saying, ‘Make easy coats of mail, and keep the measure in arranging [the links], and act righteously. Indeed I watch what you do.’",
      "_n": 11
    },
    {
      "ar": "وَلِسُلَيْمَـٰنَ ٱلرِّيحَ غُدُوُّهَا شَهْرٌ وَرَوَاحُهَا شَهْرٌ ۖ وَأَسَلْنَا لَهُۥ عَيْنَ ٱلْقِطْرِ ۖ وَمِنَ ٱلْجِنِّ مَن يَعْمَلُ بَيْنَ يَدَيْهِ بِإِذْنِ رَبِّهِۦ ۖ وَمَن يَزِغْ مِنْهُمْ عَنْ أَمْرِنَا نُذِقْهُ مِنْ عَذَابِ ٱلسَّعِيرِ",
      "en": "And for Solomon [We subjected] the wind: its morning course was a month’s journey and its evening course was a month’s journey. We made a fount of [molten] copper flow for him, and [We placed at his service] some of the jinn who would work for him by the permission of his Lord, and if any of them swerved from Our command, We would make him taste the punishment of the Blaze.",
      "_n": 12
    },
    {
      "ar": "يَعْمَلُونَ لَهُۥ مَا يَشَآءُ مِن مَّحَـٰرِيبَ وَتَمَـٰثِيلَ وَجِفَانٍ كَٱلْجَوَابِ وَقُدُورٍ رَّاسِيَـٰتٍ ۚ ٱعْمَلُوٓا۟ ءَالَ دَاوُۥدَ شُكْرًا ۚ وَقَلِيلٌ مِّنْ عِبَادِىَ ٱلشَّكُورُ",
      "en": "They built for him as many temples as he wished, and figures, basins like cisterns, and caldrons fixed [in the ground]. ‘O House of David, act thankfully, and few of My servants are grateful.’",
      "_n": 13
    },
    {
      "ar": "فَلَمَّا قَضَيْنَا عَلَيْهِ ٱلْمَوْتَ مَا دَلَّهُمْ عَلَىٰ مَوْتِهِۦٓ إِلَّا دَآبَّةُ ٱلْأَرْضِ تَأْكُلُ مِنسَأَتَهُۥ ۖ فَلَمَّا خَرَّ تَبَيَّنَتِ ٱلْجِنُّ أَن لَّوْ كَانُوا۟ يَعْلَمُونَ ٱلْغَيْبَ مَا لَبِثُوا۟ فِى ٱلْعَذَابِ ٱلْمُهِينِ",
      "en": "When We decreed death for him, nothing apprised them of his death except a worm which gnawed away at his staff. And when he fell down, [the humans] realized that had the jinn known the Unseen, they would not have remained in a humiliating torment.",
      "_n": 14
    },
    {
      "ar": "لَقَدْ كَانَ لِسَبَإٍ فِى مَسْكَنِهِمْ ءَايَةٌ ۖ جَنَّتَانِ عَن يَمِينٍ وَشِمَالٍ ۖ كُلُوا۟ مِن رِّزْقِ رَبِّكُمْ وَٱشْكُرُوا۟ لَهُۥ ۚ بَلْدَةٌ طَيِّبَةٌ وَرَبٌّ غَفُورٌ",
      "en": "There was certainly a sign for Sheba in their habitation: two gardens, to the right and to the left. ‘Eat of the provision of your Lord and give Him thanks: a good land and an all-forgiving Lord!’",
      "_n": 15
    },
    {
      "ar": "فَأَعْرَضُوا۟ فَأَرْسَلْنَا عَلَيْهِمْ سَيْلَ ٱلْعَرِمِ وَبَدَّلْنَـٰهُم بِجَنَّتَيْهِمْ جَنَّتَيْنِ ذَوَاتَىْ أُكُلٍ خَمْطٍ وَأَثْلٍ وَشَىْءٍ مِّن سِدْرٍ قَلِيلٍ",
      "en": "But they disregarded [the path of Allah], so We unleashed upon them a violent flood and replaced their two gardens with two gardens bearing bitter fruit, tamarisk, and sparse lote trees.",
      "_n": 16
    },
    {
      "ar": "ذَٰلِكَ جَزَيْنَـٰهُم بِمَا كَفَرُوا۟ ۖ وَهَلْ نُجَـٰزِىٓ إِلَّا ٱلْكَفُورَ",
      "en": "We requited them with that for their ingratitude. Do We not requite ingrates?",
      "_n": 17
    },
    {
      "ar": "وَجَعَلْنَا بَيْنَهُمْ وَبَيْنَ ٱلْقُرَى ٱلَّتِى بَـٰرَكْنَا فِيهَا قُرًى ظَـٰهِرَةً وَقَدَّرْنَا فِيهَا ٱلسَّيْرَ ۖ سِيرُوا۟ فِيهَا لَيَالِىَ وَأَيَّامًا ءَامِنِينَ",
      "en": "We had placed between them and the towns which We had blessed hamlets prominent [from the main route], and We had ordained the course through them: ‘Travel through them in safety, night and day.’",
      "_n": 18
    },
    {
      "ar": "فَقَالُوا۟ رَبَّنَا بَـٰعِدْ بَيْنَ أَسْفَارِنَا وَظَلَمُوٓا۟ أَنفُسَهُمْ فَجَعَلْنَـٰهُمْ أَحَادِيثَ وَمَزَّقْنَـٰهُمْ كُلَّ مُمَزَّقٍ ۚ إِنَّ فِى ذَٰلِكَ لَـَٔايَـٰتٍ لِّكُلِّ صَبَّارٍ شَكُورٍ",
      "en": "But they said, ‘Our Lord! Make the stages between our journeys far apart,’ and they wronged themselves. So We turned them into folktales and caused them to disintegrate totally. There are indeed signs in that for every patient and grateful [servant].",
      "_n": 19
    },
    {
      "ar": "وَلَقَدْ صَدَّقَ عَلَيْهِمْ إِبْلِيسُ ظَنَّهُۥ فَٱتَّبَعُوهُ إِلَّا فَرِيقًا مِّنَ ٱلْمُؤْمِنِينَ",
      "en": "Certainly Iblis had his conjecture come true about them. So they followed him—all except a part of the faithful.",
      "_n": 20
    },
    {
      "ar": "وَمَا كَانَ لَهُۥ عَلَيْهِم مِّن سُلْطَـٰنٍ إِلَّا لِنَعْلَمَ مَن يُؤْمِنُ بِٱلْـَٔاخِرَةِ مِمَّنْ هُوَ مِنْهَا فِى شَكٍّ ۗ وَرَبُّكَ عَلَىٰ كُلِّ شَىْءٍ حَفِيظٌ",
      "en": "He had no authority over them, but that We may ascertain those who believe in the Hereafter from those who are in doubt about it, and your Lord is watchful over all things.",
      "_n": 21
    },
    {
      "ar": "قُلِ ٱدْعُوا۟ ٱلَّذِينَ زَعَمْتُم مِّن دُونِ ٱللَّهِ ۖ لَا يَمْلِكُونَ مِثْقَالَ ذَرَّةٍ فِى ٱلسَّمَـٰوَٰتِ وَلَا فِى ٱلْأَرْضِ وَمَا لَهُمْ فِيهِمَا مِن شِرْكٍ وَمَا لَهُۥ مِنْهُم مِّن ظَهِيرٍ",
      "en": "Say, ‘Invoke those whom you claim [to be gods] besides Allah! They do not control [even] an atom’s weight in the heavens or the earth, nor do they have any share in [either of] them, nor is any of them His helper.’",
      "_n": 22
    },
    {
      "ar": "وَلَا تَنفَعُ ٱلشَّفَـٰعَةُ عِندَهُۥٓ إِلَّا لِمَنْ أَذِنَ لَهُۥ ۚ حَتَّىٰٓ إِذَا فُزِّعَ عَن قُلُوبِهِمْ قَالُوا۟ مَاذَا قَالَ رَبُّكُمْ ۖ قَالُوا۟ ٱلْحَقَّ ۖ وَهُوَ ٱلْعَلِىُّ ٱلْكَبِيرُ",
      "en": "Intercession is of no avail with Him, except for those whom He permits. When fear is lifted from their hearts, they say, ‘What did your Lord say?’ They say, ‘The truth, and He is the All-exalted, the All-great.’",
      "_n": 23
    },
    {
      "ar": "قُلْ مَن يَرْزُقُكُم مِّنَ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۖ قُلِ ٱللَّهُ ۖ وَإِنَّآ أَوْ إِيَّاكُمْ لَعَلَىٰ هُدًى أَوْ فِى ضَلَـٰلٍ مُّبِينٍ",
      "en": "Say, ‘Who provides for you from the heavens and the earth?’ Say, ‘Allah! Indeed either we or you are rightly guided or in manifest error.’",
      "_n": 24
    },
    {
      "ar": "قُل لَّا تُسْـَٔلُونَ عَمَّآ أَجْرَمْنَا وَلَا نُسْـَٔلُ عَمَّا تَعْمَلُونَ",
      "en": "Say, ‘You will not be questioned about our guilt, nor shall we be questioned about what you do.’",
      "_n": 25
    },
    {
      "ar": "قُلْ يَجْمَعُ بَيْنَنَا رَبُّنَا ثُمَّ يَفْتَحُ بَيْنَنَا بِٱلْحَقِّ وَهُوَ ٱلْفَتَّاحُ ٱلْعَلِيمُ",
      "en": "Say, ‘Our Lord will bring us together, then He will judge between us with justice, and He is the All-knowing Judge.’",
      "_n": 26
    },
    {
      "ar": "قُلْ أَرُونِىَ ٱلَّذِينَ أَلْحَقْتُم بِهِۦ شُرَكَآءَ ۖ كَلَّا ۚ بَلْ هُوَ ٱللَّهُ ٱلْعَزِيزُ ٱلْحَكِيمُ",
      "en": "Say, ‘Show me those whom you associate with Him as partners.’ No! [They can never show any such partner]. Indeed, He is Allah, the All-mighty, the All-wise.",
      "_n": 27
    },
    {
      "ar": "وَمَآ أَرْسَلْنَـٰكَ إِلَّا كَآفَّةً لِّلنَّاسِ بَشِيرًا وَنَذِيرًا وَلَـٰكِنَّ أَكْثَرَ ٱلنَّاسِ لَا يَعْلَمُونَ",
      "en": "We did not send you except as a bearer of good news and warner to all mankind, but most people do not know.",
      "_n": 28
    },
    {
      "ar": "وَيَقُولُونَ مَتَىٰ هَـٰذَا ٱلْوَعْدُ إِن كُنتُمْ صَـٰدِقِينَ",
      "en": "They say, ‘When will this promise be fulfilled, if you are truthful?’",
      "_n": 29
    },
    {
      "ar": "قُل لَّكُم مِّيعَادُ يَوْمٍ لَّا تَسْتَـْٔخِرُونَ عَنْهُ سَاعَةً وَلَا تَسْتَقْدِمُونَ",
      "en": "Say, ‘Your promised hour is a day that you shall neither defer nor advance by an hour.’",
      "_n": 30
    },
    {
      "ar": "وَقَالَ ٱلَّذِينَ كَفَرُوا۟ لَن نُّؤْمِنَ بِهَـٰذَا ٱلْقُرْءَانِ وَلَا بِٱلَّذِى بَيْنَ يَدَيْهِ ۗ وَلَوْ تَرَىٰٓ إِذِ ٱلظَّـٰلِمُونَ مَوْقُوفُونَ عِندَ رَبِّهِمْ يَرْجِعُ بَعْضُهُمْ إِلَىٰ بَعْضٍ ٱلْقَوْلَ يَقُولُ ٱلَّذِينَ ٱسْتُضْعِفُوا۟ لِلَّذِينَ ٱسْتَكْبَرُوا۟ لَوْلَآ أَنتُمْ لَكُنَّا مُؤْمِنِينَ",
      "en": "The faithless say, ‘We will never believe in this Quran, nor in what was [revealed] before it.’ But if you were to see when the wrongdoers will be made to stop before their Lord casting the blame on one another. Those who were abased will say to those who were arrogant, ‘Had it not been for you, we would surely have been faithful.’",
      "_n": 31
    },
    {
      "ar": "قَالَ ٱلَّذِينَ ٱسْتَكْبَرُوا۟ لِلَّذِينَ ٱسْتُضْعِفُوٓا۟ أَنَحْنُ صَدَدْنَـٰكُمْ عَنِ ٱلْهُدَىٰ بَعْدَ إِذْ جَآءَكُم ۖ بَلْ كُنتُم مُّجْرِمِينَ",
      "en": "Those who were arrogant will say to those who were abased, ‘Did we keep you from guidance after it had come to you? No, you were guilty [yourselves].’",
      "_n": 32
    },
    {
      "ar": "وَقَالَ ٱلَّذِينَ ٱسْتُضْعِفُوا۟ لِلَّذِينَ ٱسْتَكْبَرُوا۟ بَلْ مَكْرُ ٱلَّيْلِ وَٱلنَّهَارِ إِذْ تَأْمُرُونَنَآ أَن نَّكْفُرَ بِٱللَّهِ وَنَجْعَلَ لَهُۥٓ أَندَادًا ۚ وَأَسَرُّوا۟ ٱلنَّدَامَةَ لَمَّا رَأَوُا۟ ٱلْعَذَابَ وَجَعَلْنَا ٱلْأَغْلَـٰلَ فِىٓ أَعْنَاقِ ٱلَّذِينَ كَفَرُوا۟ ۚ هَلْ يُجْزَوْنَ إِلَّا مَا كَانُوا۟ يَعْمَلُونَ",
      "en": "Those who were abased will say to those who were arrogant, ‘No, [it was your] night and day plotting, when you prompted us to forswear Allah and to set up equals to Him.’ They will hide their remorse when they sight the punishment, and We will put iron collars around the necks of the faithless. Shall they not be requited for what they used to do?",
      "_n": 33
    },
    {
      "ar": "وَمَآ أَرْسَلْنَا فِى قَرْيَةٍ مِّن نَّذِيرٍ إِلَّا قَالَ مُتْرَفُوهَآ إِنَّا بِمَآ أُرْسِلْتُم بِهِۦ كَـٰفِرُونَ",
      "en": "We did not send a warner to any town without its affluent ones saying, ‘We indeed disbelieve in what you have been sent with.’",
      "_n": 34
    },
    {
      "ar": "وَقَالُوا۟ نَحْنُ أَكْثَرُ أَمْوَٰلًا وَأَوْلَـٰدًا وَمَا نَحْنُ بِمُعَذَّبِينَ",
      "en": "They say, ‘We have greater wealth and more children, and we will not be punished!’",
      "_n": 35
    },
    {
      "ar": "قُلْ إِنَّ رَبِّى يَبْسُطُ ٱلرِّزْقَ لِمَن يَشَآءُ وَيَقْدِرُ وَلَـٰكِنَّ أَكْثَرَ ٱلنَّاسِ لَا يَعْلَمُونَ",
      "en": "Say, ‘Indeed my Lord expands the provision for whomever He wishes and He tightens it, but most people do not know.’",
      "_n": 36
    },
    {
      "ar": "وَمَآ أَمْوَٰلُكُمْ وَلَآ أَوْلَـٰدُكُم بِٱلَّتِى تُقَرِّبُكُمْ عِندَنَا زُلْفَىٰٓ إِلَّا مَنْ ءَامَنَ وَعَمِلَ صَـٰلِحًا فَأُو۟لَـٰٓئِكَ لَهُمْ جَزَآءُ ٱلضِّعْفِ بِمَا عَمِلُوا۟ وَهُمْ فِى ٱلْغُرُفَـٰتِ ءَامِنُونَ",
      "en": "It is not your wealth, nor your children, that will bring you close to Us in nearness, excepting those who have faith and act righteously. It is they for whom there will be a twofold reward for what they did, and they will be secure in lofty abodes.",
      "_n": 37
    },
    {
      "ar": "وَٱلَّذِينَ يَسْعَوْنَ فِىٓ ءَايَـٰتِنَا مُعَـٰجِزِينَ أُو۟لَـٰٓئِكَ فِى ٱلْعَذَابِ مُحْضَرُونَ",
      "en": "As for those who contend with Our signs seeking to frustrate [their purpose], they will be brought to the punishment.",
      "_n": 38
    },
    {
      "ar": "قُلْ إِنَّ رَبِّى يَبْسُطُ ٱلرِّزْقَ لِمَن يَشَآءُ مِنْ عِبَادِهِۦ وَيَقْدِرُ لَهُۥ ۚ وَمَآ أَنفَقْتُم مِّن شَىْءٍ فَهُوَ يُخْلِفُهُۥ ۖ وَهُوَ خَيْرُ ٱلرَّٰزِقِينَ",
      "en": "Say, ‘Indeed my Lord expands the provision for whomever of His servants that He wishes and tightens it, and He will repay whatever you may spend, and He is the best of providers.’",
      "_n": 39
    },
    {
      "ar": "وَيَوْمَ يَحْشُرُهُمْ جَمِيعًا ثُمَّ يَقُولُ لِلْمَلَـٰٓئِكَةِ أَهَـٰٓؤُلَآءِ إِيَّاكُمْ كَانُوا۟ يَعْبُدُونَ",
      "en": "On the day He will muster them all together, He will say to the angels, ‘Was it you that these used to worship?’",
      "_n": 40
    },
    {
      "ar": "قَالُوا۟ سُبْحَـٰنَكَ أَنتَ وَلِيُّنَا مِن دُونِهِم ۖ بَلْ كَانُوا۟ يَعْبُدُونَ ٱلْجِنَّ ۖ أَكْثَرُهُم بِهِم مُّؤْمِنُونَ",
      "en": "They will say, ‘Immaculate are You! You are our wali, not they! No, they used to worship the jinn; most of them had faith in them.’",
      "_n": 41
    },
    {
      "ar": "فَٱلْيَوْمَ لَا يَمْلِكُ بَعْضُكُمْ لِبَعْضٍ نَّفْعًا وَلَا ضَرًّا وَنَقُولُ لِلَّذِينَ ظَلَمُوا۟ ذُوقُوا۟ عَذَابَ ٱلنَّارِ ٱلَّتِى كُنتُم بِهَا تُكَذِّبُونَ",
      "en": "‘Today you have no power to benefit or harm one another,’ and We shall say to those who did wrong, ‘Taste the punishment of the Fire which you used to deny.’",
      "_n": 42
    },
    {
      "ar": "وَإِذَا تُتْلَىٰ عَلَيْهِمْ ءَايَـٰتُنَا بَيِّنَـٰتٍ قَالُوا۟ مَا هَـٰذَآ إِلَّا رَجُلٌ يُرِيدُ أَن يَصُدَّكُمْ عَمَّا كَانَ يَعْبُدُ ءَابَآؤُكُمْ وَقَالُوا۟ مَا هَـٰذَآ إِلَّآ إِفْكٌ مُّفْتَرًى ۚ وَقَالَ ٱلَّذِينَ كَفَرُوا۟ لِلْحَقِّ لَمَّا جَآءَهُمْ إِنْ هَـٰذَآ إِلَّا سِحْرٌ مُّبِينٌ",
      "en": "When Our manifest signs are recited to them, they say, ‘This is just a man who desires to keep you from what your fathers used to worship.’ And they say, ‘This is nothing but a fabricated lie.’ The faithless say of the truth when it comes to them: ‘This is nothing but plain magic,’",
      "_n": 43
    },
    {
      "ar": "وَمَآ ءَاتَيْنَـٰهُم مِّن كُتُبٍ يَدْرُسُونَهَا ۖ وَمَآ أَرْسَلْنَآ إِلَيْهِمْ قَبْلَكَ مِن نَّذِيرٍ",
      "en": "though We did not give them any scriptures that they might have studied, nor did We send them any warner before you.",
      "_n": 44
    },
    {
      "ar": "وَكَذَّبَ ٱلَّذِينَ مِن قَبْلِهِمْ وَمَا بَلَغُوا۟ مِعْشَارَ مَآ ءَاتَيْنَـٰهُمْ فَكَذَّبُوا۟ رُسُلِى ۖ فَكَيْفَ كَانَ نَكِيرِ",
      "en": "Those who were before them had also denied—and these have not attained one-tenth of what We had given them—they impugned My apostles, so how was My rebuttal!",
      "_n": 45
    },
    {
      "ar": "قُلْ إِنَّمَآ أَعِظُكُم بِوَٰحِدَةٍ ۖ أَن تَقُومُوا۟ لِلَّهِ مَثْنَىٰ وَفُرَٰدَىٰ ثُمَّ تَتَفَكَّرُوا۟ ۚ مَا بِصَاحِبِكُم مِّن جِنَّةٍ ۚ إِنْ هُوَ إِلَّا نَذِيرٌ لَّكُم بَيْنَ يَدَىْ عَذَابٍ شَدِيدٍ",
      "en": "Say, ‘I give you just a single advice: that you rise up for Allah’s sake, in pairs or singly, and then reflect: there is no madness in your companion; he is just a warner to you before [the befalling of] a severe punishment.’",
      "_n": 46
    },
    {
      "ar": "قُلْ مَا سَأَلْتُكُم مِّنْ أَجْرٍ فَهُوَ لَكُمْ ۖ إِنْ أَجْرِىَ إِلَّا عَلَى ٱللَّهِ ۖ وَهُوَ عَلَىٰ كُلِّ شَىْءٍ شَهِيدٌ",
      "en": "Say, ‘Whatever reward I may have asked you is for your own good. My [true] reward lies only with Allah, and He is witness to all things.’",
      "_n": 47
    },
    {
      "ar": "قُلْ إِنَّ رَبِّى يَقْذِفُ بِٱلْحَقِّ عَلَّـٰمُ ٱلْغُيُوبِ",
      "en": "Say, ‘Indeed my Lord hurls the truth. [He is] the knower of all that is Unseen.’",
      "_n": 48
    },
    {
      "ar": "قُلْ جَآءَ ٱلْحَقُّ وَمَا يُبْدِئُ ٱلْبَـٰطِلُ وَمَا يُعِيدُ",
      "en": "Say, ‘The truth has come, and falsehood neither originates nor restores [anything].’",
      "_n": 49
    },
    {
      "ar": "قُلْ إِن ضَلَلْتُ فَإِنَّمَآ أَضِلُّ عَلَىٰ نَفْسِى ۖ وَإِنِ ٱهْتَدَيْتُ فَبِمَا يُوحِىٓ إِلَىَّ رَبِّىٓ ۚ إِنَّهُۥ سَمِيعٌ قَرِيبٌ",
      "en": "Say, ‘If I go astray, my going astray is only to my own harm, and if I am rightly guided that is because of what my Lord has revealed to me. Indeed He is all-hearing and nearmost.’",
      "_n": 50
    },
    {
      "ar": "وَلَوْ تَرَىٰٓ إِذْ فَزِعُوا۟ فَلَا فَوْتَ وَأُخِذُوا۟ مِن مَّكَانٍ قَرِيبٍ",
      "en": "Were you to see them when they will be stricken with terror, without any escape, and are seized from a close quarter.",
      "_n": 51
    },
    {
      "ar": "وَقَالُوٓا۟ ءَامَنَّا بِهِۦ وَأَنَّىٰ لَهُمُ ٱلتَّنَاوُشُ مِن مَّكَانٍۭ بَعِيدٍ",
      "en": "They will say, ‘We believe in it [now]!’ But how can they attain it from a far-off place,",
      "_n": 52
    },
    {
      "ar": "وَقَدْ كَفَرُوا۟ بِهِۦ مِن قَبْلُ ۖ وَيَقْذِفُونَ بِٱلْغَيْبِ مِن مَّكَانٍۭ بَعِيدٍ",
      "en": "when they denied it in the past—shooting at something invisible from a far-off place—",
      "_n": 53
    },
    {
      "ar": "وَحِيلَ بَيْنَهُمْ وَبَيْنَ مَا يَشْتَهُونَ كَمَا فُعِلَ بِأَشْيَاعِهِم مِّن قَبْلُ ۚ إِنَّهُمْ كَانُوا۟ فِى شَكٍّ مُّرِيبٍۭ",
      "en": "and a barrier is set between them and what they desire, as was done aforetime with their likes, who had remained in grave doubt?",
      "_n": 54
    }
  ],
  "_n": 34,
  "_c": 54
}