{
  "ar": "ص",
  "en": "The letter Saad",
  "_a": "Saad",
  "_l": "Meccan",
  "_v": [
    {
      "ar": "صٓ ۚ وَٱلْقُرْءَانِ ذِى ٱلذِّكْرِ",
      "en": "Suad. By the Quran bearing the Reminder,",
      "_n": 1
    },
    {
      "ar": "بَلِ ٱلَّذِينَ كَفَرُوا۟ فِى عِزَّةٍ وَشِقَاقٍ",
      "en": "the faithless indeed dwell in conceit and defiance.",
      "_n": 2
    },
    {
      "ar": "كَمْ أَهْلَكْنَا مِن قَبْلِهِم مِّن قَرْنٍ فَنَادَوا۟ وَّلَاتَ حِينَ مَنَاصٍ",
      "en": "How many a generation We have destroyed before them! They cried out [for help], but gone was the time for escape.",
      "_n": 3
    },
    {
      "ar": "وَعَجِبُوٓا۟ أَن جَآءَهُم مُّنذِرٌ مِّنْهُمْ ۖ وَقَالَ ٱلْكَـٰفِرُونَ هَـٰذَا سَـٰحِرٌ كَذَّابٌ",
      "en": "They consider it odd that there should come to them a warner from among themselves, and the faithless say, ‘This is a magician, a mendacious liar.’",
      "_n": 4
    },
    {
      "ar": "أَجَعَلَ ٱلْـَٔالِهَةَ إِلَـٰهًا وَٰحِدًا ۖ إِنَّ هَـٰذَا لَشَىْءٌ عُجَابٌ",
      "en": "‘Has he reduced the gods to one god? This is indeed an odd thing!’",
      "_n": 5
    },
    {
      "ar": "وَٱنطَلَقَ ٱلْمَلَأُ مِنْهُمْ أَنِ ٱمْشُوا۟ وَٱصْبِرُوا۟ عَلَىٰٓ ءَالِهَتِكُمْ ۖ إِنَّ هَـٰذَا لَشَىْءٌ يُرَادُ",
      "en": "Their elite go about [urging others]: ‘Go and stand by your gods! This is indeed the desirable thing [to do].",
      "_n": 6
    },
    {
      "ar": "مَا سَمِعْنَا بِهَـٰذَا فِى ٱلْمِلَّةِ ٱلْـَٔاخِرَةِ إِنْ هَـٰذَآ إِلَّا ٱخْتِلَـٰقٌ",
      "en": "We did not hear of this in the latter-day creed. This is nothing but a fabrication.",
      "_n": 7
    },
    {
      "ar": "أَءُنزِلَ عَلَيْهِ ٱلذِّكْرُ مِنۢ بَيْنِنَا ۚ بَلْ هُمْ فِى شَكٍّ مِّن ذِكْرِى ۖ بَل لَّمَّا يَذُوقُوا۟ عَذَابِ",
      "en": "Has the Reminder been sent down to him out of [all of] us?’ Indeed, they are in doubt concerning My Reminder. Indeed, they have not yet tasted My punishment.",
      "_n": 8
    },
    {
      "ar": "أَمْ عِندَهُمْ خَزَآئِنُ رَحْمَةِ رَبِّكَ ٱلْعَزِيزِ ٱلْوَهَّابِ",
      "en": "Do they possess the treasuries of the mercy of your Lord, the All-mighty, the All-munificent?",
      "_n": 9
    },
    {
      "ar": "أَمْ لَهُم مُّلْكُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ وَمَا بَيْنَهُمَا ۖ فَلْيَرْتَقُوا۟ فِى ٱلْأَسْبَـٰبِ",
      "en": "Do they own the kingdom of the heavens and the earth and whatever is between them? [If so,] let them ascend [to the higher spheres] by the means [of ascension].",
      "_n": 10
    },
    {
      "ar": "جُندٌ مَّا هُنَالِكَ مَهْزُومٌ مِّنَ ٱلْأَحْزَابِ",
      "en": "[They are but] a host routed out there of the factions.",
      "_n": 11
    },
    {
      "ar": "كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَعَادٌ وَفِرْعَوْنُ ذُو ٱلْأَوْتَادِ",
      "en": "Before them Noah’s people impugned [their apostle] and [so did the people of] ‘Ad, and Pharaoh, the Impaler [of his victims],",
      "_n": 12
    },
    {
      "ar": "وَثَمُودُ وَقَوْمُ لُوطٍ وَأَصْحَـٰبُ لْـَٔيْكَةِ ۚ أُو۟لَـٰٓئِكَ ٱلْأَحْزَابُ",
      "en": "and Thamud, and the people of Lot, and the inhabitants of Aykah: those were the factions.",
      "_n": 13
    },
    {
      "ar": "إِن كُلٌّ إِلَّا كَذَّبَ ٱلرُّسُلَ فَحَقَّ عِقَابِ",
      "en": "There was not any one but such as impugned the apostles; so My retribution became due [against them].",
      "_n": 14
    },
    {
      "ar": "وَمَا يَنظُرُ هَـٰٓؤُلَآءِ إِلَّا صَيْحَةً وَٰحِدَةً مَّا لَهَا مِن فَوَاقٍ",
      "en": "These [too] do not await but a single Cry, which will not grant [them] any respite.",
      "_n": 15
    },
    {
      "ar": "وَقَالُوا۟ رَبَّنَا عَجِّل لَّنَا قِطَّنَا قَبْلَ يَوْمِ ٱلْحِسَابِ",
      "en": "They say, ‘Our Lord! Hasten on for us our share before the Day of Reckoning.’",
      "_n": 16
    },
    {
      "ar": "ٱصْبِرْ عَلَىٰ مَا يَقُولُونَ وَٱذْكُرْ عَبْدَنَا دَاوُۥدَ ذَا ٱلْأَيْدِ ۖ إِنَّهُۥٓ أَوَّابٌ",
      "en": "Be patient over what they say, and remember Our servant, David, [the man] of strength. Indeed he was a penitent [soul].",
      "_n": 17
    },
    {
      "ar": "إِنَّا سَخَّرْنَا ٱلْجِبَالَ مَعَهُۥ يُسَبِّحْنَ بِٱلْعَشِىِّ وَٱلْإِشْرَاقِ",
      "en": "We disposed the mountains to glorify [Allah] with him at evening and dawn,",
      "_n": 18
    },
    {
      "ar": "وَٱلطَّيْرَ مَحْشُورَةً ۖ كُلٌّ لَّهُۥٓ أَوَّابٌ",
      "en": "and the birds [as well], mustered [in flocks]; all echoing him [in a chorus].",
      "_n": 19
    },
    {
      "ar": "وَشَدَدْنَا مُلْكَهُۥ وَءَاتَيْنَـٰهُ ٱلْحِكْمَةَ وَفَصْلَ ٱلْخِطَابِ",
      "en": "We consolidated his kingdom and gave him wisdom and conclusive speech.",
      "_n": 20
    },
    {
      "ar": "وَهَلْ أَتَىٰكَ نَبَؤُا۟ ٱلْخَصْمِ إِذْ تَسَوَّرُوا۟ ٱلْمِحْرَابَ",
      "en": "Has there not come to you the account of the contenders, when they scaled the wall into the sanctuary?",
      "_n": 21
    },
    {
      "ar": "إِذْ دَخَلُوا۟ عَلَىٰ دَاوُۥدَ فَفَزِعَ مِنْهُمْ ۖ قَالُوا۟ لَا تَخَفْ ۖ خَصْمَانِ بَغَىٰ بَعْضُنَا عَلَىٰ بَعْضٍ فَٱحْكُم بَيْنَنَا بِٱلْحَقِّ وَلَا تُشْطِطْ وَٱهْدِنَآ إِلَىٰ سَوَآءِ ٱلصِّرَٰطِ",
      "en": "When they entered into the presence of David, he was alarmed by them. They said, ‘Do not be afraid. [We are only] two contenders: one of us has bullied the other. So judge justly between us, and do not exceed [the bounds of justice], and show us the right path.’",
      "_n": 22
    },
    {
      "ar": "إِنَّ هَـٰذَآ أَخِى لَهُۥ تِسْعٌ وَتِسْعُونَ نَعْجَةً وَلِىَ نَعْجَةٌ وَٰحِدَةٌ فَقَالَ أَكْفِلْنِيهَا وَعَزَّنِى فِى ٱلْخِطَابِ",
      "en": "‘This brother of mine has ninety-nine ewes, while I have only a single ewe, and [yet] he says, ‘Commit it to my care,’ and he browbeats me in speech.’",
      "_n": 23
    },
    {
      "ar": "قَالَ لَقَدْ ظَلَمَكَ بِسُؤَالِ نَعْجَتِكَ إِلَىٰ نِعَاجِهِۦ ۖ وَإِنَّ كَثِيرًا مِّنَ ٱلْخُلَطَآءِ لَيَبْغِى بَعْضُهُمْ عَلَىٰ بَعْضٍ إِلَّا ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ وَقَلِيلٌ مَّا هُمْ ۗ وَظَنَّ دَاوُۥدُ أَنَّمَا فَتَنَّـٰهُ فَٱسْتَغْفَرَ رَبَّهُۥ وَخَرَّ رَاكِعًا وَأَنَابَ ۩",
      "en": "He said, ‘He has certainly wronged you by asking your ewe in addition to his own ewes, and indeed many partners bully one another, except such as have faith and do righteous deeds, and few are they.’ Then David knew that We had tested him, whereat he pleaded with his Lord for forgiveness, and fell down in prostration and repented.",
      "_n": 24
    },
    {
      "ar": "فَغَفَرْنَا لَهُۥ ذَٰلِكَ ۖ وَإِنَّ لَهُۥ عِندَنَا لَزُلْفَىٰ وَحُسْنَ مَـَٔابٍ",
      "en": "So We forgave him that, and indeed he has [a station of] nearness with Us and a good destination.",
      "_n": 25
    },
    {
      "ar": "يَـٰدَاوُۥدُ إِنَّا جَعَلْنَـٰكَ خَلِيفَةً فِى ٱلْأَرْضِ فَٱحْكُم بَيْنَ ٱلنَّاسِ بِٱلْحَقِّ وَلَا تَتَّبِعِ ٱلْهَوَىٰ فَيُضِلَّكَ عَن سَبِيلِ ٱللَّهِ ۚ إِنَّ ٱلَّذِينَ يَضِلُّونَ عَن سَبِيلِ ٱللَّهِ لَهُمْ عَذَابٌ شَدِيدٌۢ بِمَا نَسُوا۟ يَوْمَ ٱلْحِسَابِ",
      "en": "‘O David! Indeed, We have made you a vicegerent on the earth. So judge between people with justice, and do not follow your desires, or they will lead you astray from the way of Allah. Indeed there is a severe punishment for those who stray from the way of Allah, because of their forgetting the Day of Reckoning.’",
      "_n": 26
    },
    {
      "ar": "وَمَا خَلَقْنَا ٱلسَّمَآءَ وَٱلْأَرْضَ وَمَا بَيْنَهُمَا بَـٰطِلًا ۚ ذَٰلِكَ ظَنُّ ٱلَّذِينَ كَفَرُوا۟ ۚ فَوَيْلٌ لِّلَّذِينَ كَفَرُوا۟ مِنَ ٱلنَّارِ",
      "en": "We did not create the sky and the earth and whatever is between them in vain. That is a conjecture of the faithless. So woe to the faithless for the Fire!",
      "_n": 27
    },
    {
      "ar": "أَمْ نَجْعَلُ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ كَٱلْمُفْسِدِينَ فِى ٱلْأَرْضِ أَمْ نَجْعَلُ ٱلْمُتَّقِينَ كَٱلْفُجَّارِ",
      "en": "Shall We treat those who have faith and do righteous deeds like those who cause corruption on the earth? Shall We treat the Godwary like the vicious?",
      "_n": 28
    },
    {
      "ar": "كِتَـٰبٌ أَنزَلْنَـٰهُ إِلَيْكَ مُبَـٰرَكٌ لِّيَدَّبَّرُوٓا۟ ءَايَـٰتِهِۦ وَلِيَتَذَكَّرَ أُو۟لُوا۟ ٱلْأَلْبَـٰبِ",
      "en": "[This is] a blessed Book that We have sent down to you, so that they may contemplate its signs, and that those who possess intellect may take admonition.",
      "_n": 29
    },
    {
      "ar": "وَوَهَبْنَا لِدَاوُۥدَ سُلَيْمَـٰنَ ۚ نِعْمَ ٱلْعَبْدُ ۖ إِنَّهُۥٓ أَوَّابٌ",
      "en": "And to David We gave Solomon—what an excellent servant he was! Indeed, he was a penitent [soul].",
      "_n": 30
    },
    {
      "ar": "إِذْ عُرِضَ عَلَيْهِ بِٱلْعَشِىِّ ٱلصَّـٰفِنَـٰتُ ٱلْجِيَادُ",
      "en": "One evening when there were displayed before him prancing steeds,",
      "_n": 31
    },
    {
      "ar": "فَقَالَ إِنِّىٓ أَحْبَبْتُ حُبَّ ٱلْخَيْرِ عَن ذِكْرِ رَبِّى حَتَّىٰ تَوَارَتْ بِٱلْحِجَابِ",
      "en": "he said, ‘Indeed I have preferred the love of [worldly] niceties to the remembrance of my Lord until [the sun] disappeared behind the [night’s] veil.’",
      "_n": 32
    },
    {
      "ar": "رُدُّوهَا عَلَىَّ ۖ فَطَفِقَ مَسْحًۢا بِٱلسُّوقِ وَٱلْأَعْنَاقِ",
      "en": "‘Bring it back for me!’ Then he [and others] began to wipe [their] legs and necks.",
      "_n": 33
    },
    {
      "ar": "وَلَقَدْ فَتَنَّا سُلَيْمَـٰنَ وَأَلْقَيْنَا عَلَىٰ كُرْسِيِّهِۦ جَسَدًا ثُمَّ أَنَابَ",
      "en": "Certainly We tried Solomon, and cast a [lifeless] body on his throne. Thereupon he was penitent.",
      "_n": 34
    },
    {
      "ar": "قَالَ رَبِّ ٱغْفِرْ لِى وَهَبْ لِى مُلْكًا لَّا يَنۢبَغِى لِأَحَدٍ مِّنۢ بَعْدِىٓ ۖ إِنَّكَ أَنتَ ٱلْوَهَّابُ",
      "en": "He said, ‘My Lord! Forgive me, and grant me a kingdom that will not befit anyone except me. Indeed You are the All-munificent.’",
      "_n": 35
    },
    {
      "ar": "فَسَخَّرْنَا لَهُ ٱلرِّيحَ تَجْرِى بِأَمْرِهِۦ رُخَآءً حَيْثُ أَصَابَ",
      "en": "So We disposed the wind for him, blowing softly wherever he intended by his command,",
      "_n": 36
    },
    {
      "ar": "وَٱلشَّيَـٰطِينَ كُلَّ بَنَّآءٍ وَغَوَّاصٍ",
      "en": "and every builder and diver from the demons,",
      "_n": 37
    },
    {
      "ar": "وَءَاخَرِينَ مُقَرَّنِينَ فِى ٱلْأَصْفَادِ",
      "en": "and others [too] bound together in chains.",
      "_n": 38
    },
    {
      "ar": "هَـٰذَا عَطَآؤُنَا فَٱمْنُنْ أَوْ أَمْسِكْ بِغَيْرِ حِسَابٍ",
      "en": "‘This is Our bounty: so withhold or bestow without any reckoning.’",
      "_n": 39
    },
    {
      "ar": "وَإِنَّ لَهُۥ عِندَنَا لَزُلْفَىٰ وَحُسْنَ مَـَٔابٍ",
      "en": "Indeed he has [a station of] nearness with Us and a good destination.",
      "_n": 40
    },
    {
      "ar": "وَٱذْكُرْ عَبْدَنَآ أَيُّوبَ إِذْ نَادَىٰ رَبَّهُۥٓ أَنِّى مَسَّنِىَ ٱلشَّيْطَـٰنُ بِنُصْبٍ وَعَذَابٍ",
      "en": "And remember Our servant Job [in the Quran]. When he called out to his Lord, ‘The devil has visited on me hardship and torment,’",
      "_n": 41
    },
    {
      "ar": "ٱرْكُضْ بِرِجْلِكَ ۖ هَـٰذَا مُغْتَسَلٌۢ بَارِدٌ وَشَرَابٌ",
      "en": "[We told him:] ‘Stamp your foot on the ground; this [ensuing spring] will be a cooling bath and drink.’",
      "_n": 42
    },
    {
      "ar": "وَوَهَبْنَا لَهُۥٓ أَهْلَهُۥ وَمِثْلَهُم مَّعَهُمْ رَحْمَةً مِّنَّا وَذِكْرَىٰ لِأُو۟لِى ٱلْأَلْبَـٰبِ",
      "en": "We gave [back] his family to him along with others like them, as a mercy from Us and an admonition for those who possess intellect.",
      "_n": 43
    },
    {
      "ar": "وَخُذْ بِيَدِكَ ضِغْثًا فَٱضْرِب بِّهِۦ وَلَا تَحْنَثْ ۗ إِنَّا وَجَدْنَـٰهُ صَابِرًا ۚ نِّعْمَ ٱلْعَبْدُ ۖ إِنَّهُۥٓ أَوَّابٌ",
      "en": "[We told him:] ‘Take a faggot in your hand and then strike [your wife] with it, but do not break [your] oath.’ Indeed, We found him to be patient. What an excellent servant! Indeed he was a penitent [soul].",
      "_n": 44
    },
    {
      "ar": "وَٱذْكُرْ عِبَـٰدَنَآ إِبْرَٰهِيمَ وَإِسْحَـٰقَ وَيَعْقُوبَ أُو۟لِى ٱلْأَيْدِى وَٱلْأَبْصَـٰرِ",
      "en": "And remember Our servants, Abraham, Isaac and Jacob, men of strength and insight.",
      "_n": 45
    },
    {
      "ar": "إِنَّآ أَخْلَصْنَـٰهُم بِخَالِصَةٍ ذِكْرَى ٱلدَّارِ",
      "en": "Indeed We purified them with exclusive remembrance of the abode [of the Hereafter].",
      "_n": 46
    },
    {
      "ar": "وَإِنَّهُمْ عِندَنَا لَمِنَ ٱلْمُصْطَفَيْنَ ٱلْأَخْيَارِ",
      "en": "Indeed they are surely with Us among the elect of the best.",
      "_n": 47
    },
    {
      "ar": "وَٱذْكُرْ إِسْمَـٰعِيلَ وَٱلْيَسَعَ وَذَا ٱلْكِفْلِ ۖ وَكُلٌّ مِّنَ ٱلْأَخْيَارِ",
      "en": "And remember Ishmael, Elisha and Dhu’l-Kifl—each [of whom was] among the elect.",
      "_n": 48
    },
    {
      "ar": "هَـٰذَا ذِكْرٌ ۚ وَإِنَّ لِلْمُتَّقِينَ لَحُسْنَ مَـَٔابٍ",
      "en": "This is a Reminder, and indeed the Godwary have a good destination:",
      "_n": 49
    },
    {
      "ar": "جَنَّـٰتِ عَدْنٍ مُّفَتَّحَةً لَّهُمُ ٱلْأَبْوَٰبُ",
      "en": "the Gardens of Eden, whose gates will be flung open for them.",
      "_n": 50
    },
    {
      "ar": "مُتَّكِـِٔينَ فِيهَا يَدْعُونَ فِيهَا بِفَـٰكِهَةٍ كَثِيرَةٍ وَشَرَابٍ",
      "en": "Reclining therein [on couches], they will call for abundant fruits and drinks,",
      "_n": 51
    },
    {
      "ar": "وَعِندَهُمْ قَـٰصِرَٰتُ ٱلطَّرْفِ أَتْرَابٌ",
      "en": "and there will be with them maidens of restrained glances, of a like age.",
      "_n": 52
    },
    {
      "ar": "هَـٰذَا مَا تُوعَدُونَ لِيَوْمِ ٱلْحِسَابِ",
      "en": "This is what you are promised on the Day of Reckoning.",
      "_n": 53
    },
    {
      "ar": "إِنَّ هَـٰذَا لَرِزْقُنَا مَا لَهُۥ مِن نَّفَادٍ",
      "en": "This is Our provision, which will never be exhausted.",
      "_n": 54
    },
    {
      "ar": "هَـٰذَا ۚ وَإِنَّ لِلطَّـٰغِينَ لَشَرَّ مَـَٔابٍ",
      "en": "This [will be for the righteous], and as for the rebellious there will surely be a bad destination:",
      "_n": 55
    },
    {
      "ar": "جَهَنَّمَ يَصْلَوْنَهَا فَبِئْسَ ٱلْمِهَادُ",
      "en": "hell, which they shall enter, an evil resting place.",
      "_n": 56
    },
    {
      "ar": "هَـٰذَا فَلْيَذُوقُوهُ حَمِيمٌ وَغَسَّاقٌ",
      "en": "[They will be told, ‘This is scalding water and pus; let them taste it,",
      "_n": 57
    },
    {
      "ar": "وَءَاخَرُ مِن شَكْلِهِۦٓ أَزْوَٰجٌ",
      "en": "and other kinds [of torments] resembling it.’",
      "_n": 58
    },
    {
      "ar": "هَـٰذَا فَوْجٌ مُّقْتَحِمٌ مَّعَكُمْ ۖ لَا مَرْحَبًۢا بِهِمْ ۚ إِنَّهُمْ صَالُوا۟ ٱلنَّارِ",
      "en": "[The leaders of the faithless will be told,] ‘This is a group [of your followers] plunging [into hell] along with you.’ [They will repond,] ‘May wretchedness be their lot! For they will enter the Fire.’",
      "_n": 59
    },
    {
      "ar": "قَالُوا۟ بَلْ أَنتُمْ لَا مَرْحَبًۢا بِكُمْ ۖ أَنتُمْ قَدَّمْتُمُوهُ لَنَا ۖ فَبِئْسَ ٱلْقَرَارُ",
      "en": "They will say, ‘No, may wretchedness be your lot! You prepared this [hell] for us. What an evil abode!’",
      "_n": 60
    },
    {
      "ar": "قَالُوا۟ رَبَّنَا مَن قَدَّمَ لَنَا هَـٰذَا فَزِدْهُ عَذَابًا ضِعْفًا فِى ٱلنَّارِ",
      "en": "They will say, ‘Our Lord! Whoever has prepared this for us, double his punishment in the Fire!’",
      "_n": 61
    },
    {
      "ar": "وَقَالُوا۟ مَا لَنَا لَا نَرَىٰ رِجَالًا كُنَّا نَعُدُّهُم مِّنَ ٱلْأَشْرَارِ",
      "en": "And they will say, ‘Why is it that we do not see [here] men whom we used to count among the bad ones,",
      "_n": 62
    },
    {
      "ar": "أَتَّخَذْنَـٰهُمْ سِخْرِيًّا أَمْ زَاغَتْ عَنْهُمُ ٱلْأَبْصَـٰرُ",
      "en": "ridiculing them, or do [our] eyes miss them [here]?’",
      "_n": 63
    },
    {
      "ar": "إِنَّ ذَٰلِكَ لَحَقٌّ تَخَاصُمُ أَهْلِ ٱلنَّارِ",
      "en": "That is indeed a true account of the contentions of the inmates of the Fire.",
      "_n": 64
    },
    {
      "ar": "قُلْ إِنَّمَآ أَنَا۠ مُنذِرٌ ۖ وَمَا مِنْ إِلَـٰهٍ إِلَّا ٱللَّهُ ٱلْوَٰحِدُ ٱلْقَهَّارُ",
      "en": "Say, ‘I am just a warner, and there is no god except Allah, the One, the All-paramount,",
      "_n": 65
    },
    {
      "ar": "رَبُّ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ وَمَا بَيْنَهُمَا ٱلْعَزِيزُ ٱلْغَفَّـٰرُ",
      "en": "the Lord of the heavens and the earth and whatever is between them, the All-mighty, the All-forgiver.’",
      "_n": 66
    },
    {
      "ar": "قُلْ هُوَ نَبَؤٌا۟ عَظِيمٌ",
      "en": "Say, ‘It is a great prophesy,",
      "_n": 67
    },
    {
      "ar": "أَنتُمْ عَنْهُ مُعْرِضُونَ",
      "en": "of which you are disregardful.",
      "_n": 68
    },
    {
      "ar": "مَا كَانَ لِىَ مِنْ عِلْمٍۭ بِٱلْمَلَإِ ٱلْأَعْلَىٰٓ إِذْ يَخْتَصِمُونَ",
      "en": "I have no knowledge of the Supernal Elite when they contend.",
      "_n": 69
    },
    {
      "ar": "إِن يُوحَىٰٓ إِلَىَّ إِلَّآ أَنَّمَآ أَنَا۠ نَذِيرٌ مُّبِينٌ",
      "en": "All that is revealed to me is that I am just a manifest warner.’",
      "_n": 70
    },
    {
      "ar": "إِذْ قَالَ رَبُّكَ لِلْمَلَـٰٓئِكَةِ إِنِّى خَـٰلِقٌۢ بَشَرًا مِّن طِينٍ",
      "en": "When your Lord said to the angels, ‘Indeed I am about to create a human being out of clay.",
      "_n": 71
    },
    {
      "ar": "فَإِذَا سَوَّيْتُهُۥ وَنَفَخْتُ فِيهِ مِن رُّوحِى فَقَعُوا۟ لَهُۥ سَـٰجِدِينَ",
      "en": "So when I have proportioned him and breathed into him of My spirit, then fall down in prostration before him.’",
      "_n": 72
    },
    {
      "ar": "فَسَجَدَ ٱلْمَلَـٰٓئِكَةُ كُلُّهُمْ أَجْمَعُونَ",
      "en": "Thereat the angels prostrated, all of them together,",
      "_n": 73
    },
    {
      "ar": "إِلَّآ إِبْلِيسَ ٱسْتَكْبَرَ وَكَانَ مِنَ ٱلْكَـٰفِرِينَ",
      "en": "but not Iblis; he acted arrogantly and he was one of the faithless.",
      "_n": 74
    },
    {
      "ar": "قَالَ يَـٰٓإِبْلِيسُ مَا مَنَعَكَ أَن تَسْجُدَ لِمَا خَلَقْتُ بِيَدَىَّ ۖ أَسْتَكْبَرْتَ أَمْ كُنتَ مِنَ ٱلْعَالِينَ",
      "en": "He said, ‘O Iblis! What keeps you from prostrating before that which I have created with My [own] two hands? Are you arrogant, or are you one of the exalted ones?’",
      "_n": 75
    },
    {
      "ar": "قَالَ أَنَا۠ خَيْرٌ مِّنْهُ ۖ خَلَقْتَنِى مِن نَّارٍ وَخَلَقْتَهُۥ مِن طِينٍ",
      "en": "‘I am better than him,’ he said. ‘You created me from fire and You created him from clay.’",
      "_n": 76
    },
    {
      "ar": "قَالَ فَٱخْرُجْ مِنْهَا فَإِنَّكَ رَجِيمٌ",
      "en": "He said, ‘Begone hence, for you are indeed an outcast,",
      "_n": 77
    },
    {
      "ar": "وَإِنَّ عَلَيْكَ لَعْنَتِىٓ إِلَىٰ يَوْمِ ٱلدِّينِ",
      "en": "and indeed My curse will be on you till the Day of Retribution.’",
      "_n": 78
    },
    {
      "ar": "قَالَ رَبِّ فَأَنظِرْنِىٓ إِلَىٰ يَوْمِ يُبْعَثُونَ",
      "en": "He said, ‘My Lord! Respite me till the day they will be resurrected.’",
      "_n": 79
    },
    {
      "ar": "قَالَ فَإِنَّكَ مِنَ ٱلْمُنظَرِينَ",
      "en": "Said He, ‘You are indeed among the reprieved",
      "_n": 80
    },
    {
      "ar": "إِلَىٰ يَوْمِ ٱلْوَقْتِ ٱلْمَعْلُومِ",
      "en": "until the day of the known time.’",
      "_n": 81
    },
    {
      "ar": "قَالَ فَبِعِزَّتِكَ لَأُغْوِيَنَّهُمْ أَجْمَعِينَ",
      "en": "He said, ‘By Your might, I will surely pervert them,",
      "_n": 82
    },
    {
      "ar": "إِلَّا عِبَادَكَ مِنْهُمُ ٱلْمُخْلَصِينَ",
      "en": "except Your exclusive servants among them.’",
      "_n": 83
    },
    {
      "ar": "قَالَ فَٱلْحَقُّ وَٱلْحَقَّ أَقُولُ",
      "en": "Said He, ‘The truth is that—and I speak the truth—",
      "_n": 84
    },
    {
      "ar": "لَأَمْلَأَنَّ جَهَنَّمَ مِنكَ وَمِمَّن تَبِعَكَ مِنْهُمْ أَجْمَعِينَ",
      "en": "I will surely fill hell with you and all those who follow you.’",
      "_n": 85
    },
    {
      "ar": "قُلْ مَآ أَسْـَٔلُكُمْ عَلَيْهِ مِنْ أَجْرٍ وَمَآ أَنَا۠ مِنَ ٱلْمُتَكَلِّفِينَ",
      "en": "Say, ‘I do not ask you any reward for it, and I am no impostor.",
      "_n": 86
    },
    {
      "ar": "إِنْ هُوَ إِلَّا ذِكْرٌ لِّلْعَـٰلَمِينَ",
      "en": "It is just a reminder for all the nations,",
      "_n": 87
    },
    {
      "ar": "وَلَتَعْلَمُنَّ نَبَأَهُۥ بَعْدَ حِينٍۭ",
      "en": "and you will surely learn its tidings in due time.’",
      "_n": 88
    }
  ],
  "_n": 38,
  "_c": 88
}