{
  "ar": "الزمر",
  "en": "The Groups",
  "_a": "Az-Zumar",
  "_l": "Meccan",
  "_v": [
    {
      "ar": "تَنزِيلُ ٱلْكِتَـٰبِ مِنَ ٱللَّهِ ٱلْعَزِيزِ ٱلْحَكِيمِ",
      "en": "The [gradual] sending down of the Book is from Allah, the All-mighty, the All-wise.",
      "_n": 1
    },
    {
      "ar": "إِنَّآ أَنزَلْنَآ إِلَيْكَ ٱلْكِتَـٰبَ بِٱلْحَقِّ فَٱعْبُدِ ٱللَّهَ مُخْلِصًا لَّهُ ٱلدِّينَ",
      "en": "Indeed We have sent down the Book to you with the truth; so worship Allah, putting exclusive faith in Him.",
      "_n": 2
    },
    {
      "ar": "أَلَا لِلَّهِ ٱلدِّينُ ٱلْخَالِصُ ۚ وَٱلَّذِينَ ٱتَّخَذُوا۟ مِن دُونِهِۦٓ أَوْلِيَآءَ مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَآ إِلَى ٱللَّهِ زُلْفَىٰٓ إِنَّ ٱللَّهَ يَحْكُمُ بَيْنَهُمْ فِى مَا هُمْ فِيهِ يَخْتَلِفُونَ ۗ إِنَّ ٱللَّهَ لَا يَهْدِى مَنْ هُوَ كَـٰذِبٌ كَفَّارٌ",
      "en": "Indeed, only exclusive faith is worthy of Allah, and those who take other as awliya besides Him [claiming,] ‘We only worship them so that they may bring us near to Allah,’ Allah will judge between them concerning that about which they differ. Indeed Allah does not guide someone who is a liar and an ingrate.",
      "_n": 3
    },
    {
      "ar": "لَّوْ أَرَادَ ٱللَّهُ أَن يَتَّخِذَ وَلَدًا لَّٱصْطَفَىٰ مِمَّا يَخْلُقُ مَا يَشَآءُ ۚ سُبْحَـٰنَهُۥ ۖ هُوَ ٱللَّهُ ٱلْوَٰحِدُ ٱلْقَهَّارُ",
      "en": "Had Allah intended to take a son, He could have chosen from those He has created whatever He wished. Immaculate is He! He is Allah, the One, the All-paramount.",
      "_n": 4
    },
    {
      "ar": "خَلَقَ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ بِٱلْحَقِّ ۖ يُكَوِّرُ ٱلَّيْلَ عَلَى ٱلنَّهَارِ وَيُكَوِّرُ ٱلنَّهَارَ عَلَى ٱلَّيْلِ ۖ وَسَخَّرَ ٱلشَّمْسَ وَٱلْقَمَرَ ۖ كُلٌّ يَجْرِى لِأَجَلٍ مُّسَمًّى ۗ أَلَا هُوَ ٱلْعَزِيزُ ٱلْغَفَّـٰرُ",
      "en": "He created the heavens and the earth with consummate wisdom. He winds the night over the day, and winds the day over the night, and He has disposed the sun and the moon, each moving for a specified term. Indeed, He is the All-mighty, the All-forgiver!",
      "_n": 5
    },
    {
      "ar": "خَلَقَكُم مِّن نَّفْسٍ وَٰحِدَةٍ ثُمَّ جَعَلَ مِنْهَا زَوْجَهَا وَأَنزَلَ لَكُم مِّنَ ٱلْأَنْعَـٰمِ ثَمَـٰنِيَةَ أَزْوَٰجٍ ۚ يَخْلُقُكُمْ فِى بُطُونِ أُمَّهَـٰتِكُمْ خَلْقًا مِّنۢ بَعْدِ خَلْقٍ فِى ظُلُمَـٰتٍ ثَلَـٰثٍ ۚ ذَٰلِكُمُ ٱللَّهُ رَبُّكُمْ لَهُ ٱلْمُلْكُ ۖ لَآ إِلَـٰهَ إِلَّا هُوَ ۖ فَأَنَّىٰ تُصْرَفُونَ",
      "en": "He created you from a single soul, then made from it its mate, and He has sent down for you eight mates of the cattle. He creates you in the wombs of your mothers, creation after creation, in a threefold darkness. That is Allah, your Lord! To Him belongs all sovereignty. There is no god except Him. Then where are you being led away?",
      "_n": 6
    },
    {
      "ar": "إِن تَكْفُرُوا۟ فَإِنَّ ٱللَّهَ غَنِىٌّ عَنكُمْ ۖ وَلَا يَرْضَىٰ لِعِبَادِهِ ٱلْكُفْرَ ۖ وَإِن تَشْكُرُوا۟ يَرْضَهُ لَكُمْ ۗ وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ ۗ ثُمَّ إِلَىٰ رَبِّكُم مَّرْجِعُكُمْ فَيُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ ۚ إِنَّهُۥ عَلِيمٌۢ بِذَاتِ ٱلصُّدُورِ",
      "en": "If you are ungrateful, Allah has indeed no need of you, though He does not approve ingratitude for His servants; and if you give thanks, He approves that for you. No bearer shall bear another’s burden; then your return will be to your Lord, whereat He will inform you concerning what you used to do. Indeed, He knows best what is in the breasts.",
      "_n": 7
    },
    {
      "ar": "وَإِذَا مَسَّ ٱلْإِنسَـٰنَ ضُرٌّ دَعَا رَبَّهُۥ مُنِيبًا إِلَيْهِ ثُمَّ إِذَا خَوَّلَهُۥ نِعْمَةً مِّنْهُ نَسِىَ مَا كَانَ يَدْعُوٓا۟ إِلَيْهِ مِن قَبْلُ وَجَعَلَ لِلَّهِ أَندَادًا لِّيُضِلَّ عَن سَبِيلِهِۦ ۚ قُلْ تَمَتَّعْ بِكُفْرِكَ قَلِيلًا ۖ إِنَّكَ مِنْ أَصْحَـٰبِ ٱلنَّارِ",
      "en": "When distress befalls man, he supplicates his Lord, turning to Him penitently. Then, when He grants him a blessing from Himself, he forgets that for which he had supplicated Him earlier and sets up equals to Allah, that he may lead [people] astray from His way. Say, ‘Revel in your ingratitude for a while. Indeed you are among the inmates of the Fire.’",
      "_n": 8
    },
    {
      "ar": "أَمَّنْ هُوَ قَـٰنِتٌ ءَانَآءَ ٱلَّيْلِ سَاجِدًا وَقَآئِمًا يَحْذَرُ ٱلْـَٔاخِرَةَ وَيَرْجُوا۟ رَحْمَةَ رَبِّهِۦ ۗ قُلْ هَلْ يَسْتَوِى ٱلَّذِينَ يَعْلَمُونَ وَٱلَّذِينَ لَا يَعْلَمُونَ ۗ إِنَّمَا يَتَذَكَّرُ أُو۟لُوا۟ ٱلْأَلْبَـٰبِ",
      "en": "Is he who supplicates in the watches of the night, prostrating and standing, apprehensive of the Hereafter and expecting the mercy of his Lord...? Say, ‘Are those who know equal to those who do not know?’ Only those who possess intellect take admonition.",
      "_n": 9
    },
    {
      "ar": "قُلْ يَـٰعِبَادِ ٱلَّذِينَ ءَامَنُوا۟ ٱتَّقُوا۟ رَبَّكُمْ ۚ لِلَّذِينَ أَحْسَنُوا۟ فِى هَـٰذِهِ ٱلدُّنْيَا حَسَنَةٌ ۗ وَأَرْضُ ٱللَّهِ وَٰسِعَةٌ ۗ إِنَّمَا يُوَفَّى ٱلصَّـٰبِرُونَ أَجْرَهُم بِغَيْرِ حِسَابٍ",
      "en": "Say, ‘[Allah declares:] “O My servants who have faith! Be wary of your Lord. For those who do good in this world there will be a good [reward], and Allah’s earth is vast. Indeed the patient will be paid in full their reward without any reckoning.” ’",
      "_n": 10
    },
    {
      "ar": "قُلْ إِنِّىٓ أُمِرْتُ أَنْ أَعْبُدَ ٱللَّهَ مُخْلِصًا لَّهُ ٱلدِّينَ",
      "en": "Say, ‘I have been commanded to worship Allah with exclusive faith in Him,",
      "_n": 11
    },
    {
      "ar": "وَأُمِرْتُ لِأَنْ أَكُونَ أَوَّلَ ٱلْمُسْلِمِينَ",
      "en": "and I have been commanded to be the foremost of those who submit [to Him].’",
      "_n": 12
    },
    {
      "ar": "قُلْ إِنِّىٓ أَخَافُ إِنْ عَصَيْتُ رَبِّى عَذَابَ يَوْمٍ عَظِيمٍ",
      "en": "Say, ‘Indeed, should I disobey my Lord, I fear the punishment of a tremendous day.’",
      "_n": 13
    },
    {
      "ar": "قُلِ ٱللَّهَ أَعْبُدُ مُخْلِصًا لَّهُۥ دِينِى",
      "en": "Say, ‘I worship [only] Allah, putting my exclusive faith in Him.",
      "_n": 14
    },
    {
      "ar": "فَٱعْبُدُوا۟ مَا شِئْتُم مِّن دُونِهِۦ ۗ قُلْ إِنَّ ٱلْخَـٰسِرِينَ ٱلَّذِينَ خَسِرُوٓا۟ أَنفُسَهُمْ وَأَهْلِيهِمْ يَوْمَ ٱلْقِيَـٰمَةِ ۗ أَلَا ذَٰلِكَ هُوَ ٱلْخُسْرَانُ ٱلْمُبِينُ",
      "en": "You worship whatever you wish besides Him.’ Say, ‘The losers are those who ruin themselves and their families on the Day of Resurrection.’ Indeed, that is a manifest loss!",
      "_n": 15
    },
    {
      "ar": "لَهُم مِّن فَوْقِهِمْ ظُلَلٌ مِّنَ ٱلنَّارِ وَمِن تَحْتِهِمْ ظُلَلٌ ۚ ذَٰلِكَ يُخَوِّفُ ٱللَّهُ بِهِۦ عِبَادَهُۥ ۚ يَـٰعِبَادِ فَٱتَّقُونِ",
      "en": "There will be canopies of fire above them, and [similar] canopies beneath them. With that Allah deters His servants. So, My servants, be wary of Me!",
      "_n": 16
    },
    {
      "ar": "وَٱلَّذِينَ ٱجْتَنَبُوا۟ ٱلطَّـٰغُوتَ أَن يَعْبُدُوهَا وَأَنَابُوٓا۟ إِلَى ٱللَّهِ لَهُمُ ٱلْبُشْرَىٰ ۚ فَبَشِّرْ عِبَادِ",
      "en": "As for those who stay clear of the worship of fake deities and turn penitently to Allah, there is good news for them. So give good news to My servants",
      "_n": 17
    },
    {
      "ar": "ٱلَّذِينَ يَسْتَمِعُونَ ٱلْقَوْلَ فَيَتَّبِعُونَ أَحْسَنَهُۥٓ ۚ أُو۟لَـٰٓئِكَ ٱلَّذِينَ هَدَىٰهُمُ ٱللَّهُ ۖ وَأُو۟لَـٰٓئِكَ هُمْ أُو۟لُوا۟ ٱلْأَلْبَـٰبِ",
      "en": "who listen to the word [of Allah] and follow the best [interpretation] of it. They are the ones whom Allah has guided, and it is they who possess intellect.",
      "_n": 18
    },
    {
      "ar": "أَفَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ ٱلْعَذَابِ أَفَأَنتَ تُنقِذُ مَن فِى ٱلنَّارِ",
      "en": "Can he against whom the word of punishment has become due…? Can you rescue someone who is in the Fire?",
      "_n": 19
    },
    {
      "ar": "لَـٰكِنِ ٱلَّذِينَ ٱتَّقَوْا۟ رَبَّهُمْ لَهُمْ غُرَفٌ مِّن فَوْقِهَا غُرَفٌ مَّبْنِيَّةٌ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ ۖ وَعْدَ ٱللَّهِ ۖ لَا يُخْلِفُ ٱللَّهُ ٱلْمِيعَادَ",
      "en": "But as for those who are wary of their Lord, for them there will be lofty abodes with [other] lofty abodes built above them, with streams running beneath them—a promise of Allah. Allah does not break His promise.",
      "_n": 20
    },
    {
      "ar": "أَلَمْ تَرَ أَنَّ ٱللَّهَ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءً فَسَلَكَهُۥ يَنَـٰبِيعَ فِى ٱلْأَرْضِ ثُمَّ يُخْرِجُ بِهِۦ زَرْعًا مُّخْتَلِفًا أَلْوَٰنُهُۥ ثُمَّ يَهِيجُ فَتَرَىٰهُ مُصْفَرًّا ثُمَّ يَجْعَلُهُۥ حُطَـٰمًا ۚ إِنَّ فِى ذَٰلِكَ لَذِكْرَىٰ لِأُو۟لِى ٱلْأَلْبَـٰبِ",
      "en": "Have you not seen that Allah sends down water from the sky, then He conducts it through the ground as springs. Then He brings forth with it crops of diverse hues. Then they wither and you see them turn yellow. Then He turns them into chaff. There is indeed a lesson in that for those who possess intellect.",
      "_n": 21
    },
    {
      "ar": "أَفَمَن شَرَحَ ٱللَّهُ صَدْرَهُۥ لِلْإِسْلَـٰمِ فَهُوَ عَلَىٰ نُورٍ مِّن رَّبِّهِۦ ۚ فَوَيْلٌ لِّلْقَـٰسِيَةِ قُلُوبُهُم مِّن ذِكْرِ ٱللَّهِ ۚ أُو۟لَـٰٓئِكَ فِى ضَلَـٰلٍ مُّبِينٍ",
      "en": "Is someone whose breast Allah has opened to Islam so that he follows a light from His Lord…? So woe to those whose hearts have been hardened to the remembrance of Allah. They are in manifest error.",
      "_n": 22
    },
    {
      "ar": "ٱللَّهُ نَزَّلَ أَحْسَنَ ٱلْحَدِيثِ كِتَـٰبًا مُّتَشَـٰبِهًا مَّثَانِىَ تَقْشَعِرُّ مِنْهُ جُلُودُ ٱلَّذِينَ يَخْشَوْنَ رَبَّهُمْ ثُمَّ تَلِينُ جُلُودُهُمْ وَقُلُوبُهُمْ إِلَىٰ ذِكْرِ ٱللَّهِ ۚ ذَٰلِكَ هُدَى ٱللَّهِ يَهْدِى بِهِۦ مَن يَشَآءُ ۚ وَمَن يُضْلِلِ ٱللَّهُ فَمَا لَهُۥ مِنْ هَادٍ",
      "en": "Allah has sent down the best of discourses, a scripture [composed] of similar motifs, whereat shiver the skins of those who fear their Lord, then their skins and hearts relax at Allah’s remembrance. That is Allah’s guidance, by which He guides whomever He wishes; and whomever Allah leads astray, has no guide.",
      "_n": 23
    },
    {
      "ar": "أَفَمَن يَتَّقِى بِوَجْهِهِۦ سُوٓءَ ٱلْعَذَابِ يَوْمَ ٱلْقِيَـٰمَةِ ۚ وَقِيلَ لِلظَّـٰلِمِينَ ذُوقُوا۟ مَا كُنتُمْ تَكْسِبُونَ",
      "en": "What! Is someone who fends off with his face the terrible punishment [meted out to him] on the Day of Resurrection…? And the wrongdoers will be told, ‘Taste what you used to earn.’",
      "_n": 24
    },
    {
      "ar": "كَذَّبَ ٱلَّذِينَ مِن قَبْلِهِمْ فَأَتَىٰهُمُ ٱلْعَذَابُ مِنْ حَيْثُ لَا يَشْعُرُونَ",
      "en": "Those who were before them impugned [the apostles], whereat the punishment overtook them whence they were not aware.",
      "_n": 25
    },
    {
      "ar": "فَأَذَاقَهُمُ ٱللَّهُ ٱلْخِزْىَ فِى ٱلْحَيَوٰةِ ٱلدُّنْيَا ۖ وَلَعَذَابُ ٱلْـَٔاخِرَةِ أَكْبَرُ ۚ لَوْ كَانُوا۟ يَعْلَمُونَ",
      "en": "So Allah made them taste disgrace in the life of the world, and the punishment of the Hereafter will surely be greater, if they knew.",
      "_n": 26
    },
    {
      "ar": "وَلَقَدْ ضَرَبْنَا لِلنَّاسِ فِى هَـٰذَا ٱلْقُرْءَانِ مِن كُلِّ مَثَلٍ لَّعَلَّهُمْ يَتَذَكَّرُونَ",
      "en": "We have drawn for mankind in this Quran every [kind of] example, so that they may take admonition:",
      "_n": 27
    },
    {
      "ar": "قُرْءَانًا عَرَبِيًّا غَيْرَ ذِى عِوَجٍ لَّعَلَّهُمْ يَتَّقُونَ",
      "en": "an Arabic Quran, without any deviousness, so that they may be Godwary.",
      "_n": 28
    },
    {
      "ar": "ضَرَبَ ٱللَّهُ مَثَلًا رَّجُلًا فِيهِ شُرَكَآءُ مُتَشَـٰكِسُونَ وَرَجُلًا سَلَمًا لِّرَجُلٍ هَلْ يَسْتَوِيَانِ مَثَلًا ۚ ٱلْحَمْدُ لِلَّهِ ۚ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ",
      "en": "Allah draws an example: a man jointly owned by several contending masters, and a man belonging entirely to one man: are the two equal in comparison? All praise belongs to Allah! But most of them do not know.",
      "_n": 29
    },
    {
      "ar": "إِنَّكَ مَيِّتٌ وَإِنَّهُم مَّيِّتُونَ",
      "en": "You will die, and they [too] will die.",
      "_n": 30
    },
    {
      "ar": "ثُمَّ إِنَّكُمْ يَوْمَ ٱلْقِيَـٰمَةِ عِندَ رَبِّكُمْ تَخْتَصِمُونَ",
      "en": "Then on the Day of Resurrection you will contend before your Lord.",
      "_n": 31
    },
    {
      "ar": "فَمَنْ أَظْلَمُ مِمَّن كَذَبَ عَلَى ٱللَّهِ وَكَذَّبَ بِٱلصِّدْقِ إِذْ جَآءَهُۥٓ ۚ أَلَيْسَ فِى جَهَنَّمَ مَثْوًى لِّلْكَـٰفِرِينَ",
      "en": "So who is a greater wrongdoer than him who attributes a falsehood to Allah, and denies the truth when it reaches him? Is not the [final] abode of the faithless in hell?",
      "_n": 32
    },
    {
      "ar": "وَٱلَّذِى جَآءَ بِٱلصِّدْقِ وَصَدَّقَ بِهِۦٓ ۙ أُو۟لَـٰٓئِكَ هُمُ ٱلْمُتَّقُونَ",
      "en": "He who brings the truth and he who confirms it—it is they who are the Godwary.",
      "_n": 33
    },
    {
      "ar": "لَهُم مَّا يَشَآءُونَ عِندَ رَبِّهِمْ ۚ ذَٰلِكَ جَزَآءُ ٱلْمُحْسِنِينَ",
      "en": "They will have what they wish with their Lord—that is the reward of the virtuous—",
      "_n": 34
    },
    {
      "ar": "لِيُكَفِّرَ ٱللَّهُ عَنْهُمْ أَسْوَأَ ٱلَّذِى عَمِلُوا۟ وَيَجْزِيَهُمْ أَجْرَهُم بِأَحْسَنِ ٱلَّذِى كَانُوا۟ يَعْمَلُونَ",
      "en": "that Allah may absolve them of the worst of what they did, and pay them their reward by the best of what they used to do.",
      "_n": 35
    },
    {
      "ar": "أَلَيْسَ ٱللَّهُ بِكَافٍ عَبْدَهُۥ ۖ وَيُخَوِّفُونَكَ بِٱلَّذِينَ مِن دُونِهِۦ ۚ وَمَن يُضْلِلِ ٱللَّهُ فَمَا لَهُۥ مِنْ هَادٍ",
      "en": "Does not Allah suffice [to defend] His servant? They would frighten you of others than Him. Yet whomever Allah leads astray, has no guide,",
      "_n": 36
    },
    {
      "ar": "وَمَن يَهْدِ ٱللَّهُ فَمَا لَهُۥ مِن مُّضِلٍّ ۗ أَلَيْسَ ٱللَّهُ بِعَزِيزٍ ذِى ٱنتِقَامٍ",
      "en": "and whomever Allah guides, there is no one who can lead him astray. Is not Allah an all-mighty avenger?",
      "_n": 37
    },
    {
      "ar": "وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ لَيَقُولُنَّ ٱللَّهُ ۚ قُلْ أَفَرَءَيْتُم مَّا تَدْعُونَ مِن دُونِ ٱللَّهِ إِنْ أَرَادَنِىَ ٱللَّهُ بِضُرٍّ هَلْ هُنَّ كَـٰشِفَـٰتُ ضُرِّهِۦٓ أَوْ أَرَادَنِى بِرَحْمَةٍ هَلْ هُنَّ مُمْسِكَـٰتُ رَحْمَتِهِۦ ۚ قُلْ حَسْبِىَ ٱللَّهُ ۖ عَلَيْهِ يَتَوَكَّلُ ٱلْمُتَوَكِّلُونَ",
      "en": "If you ask them, ‘Who created the heavens and the earth?’ they will surely say, ‘Allah.’ Say, ‘Have you considered what you invoke besides Allah? Should Allah desire some distress for me, can they remove the distress visited by Him? Or should He desire some mercy for me, can they withhold His mercy?’ Say, ‘Allah is sufficient for me. In Him let all the trusting put their trust.’",
      "_n": 38
    },
    {
      "ar": "قُلْ يَـٰقَوْمِ ٱعْمَلُوا۟ عَلَىٰ مَكَانَتِكُمْ إِنِّى عَـٰمِلٌ ۖ فَسَوْفَ تَعْلَمُونَ",
      "en": "Say, ‘O my people! Act according to your ability. I too am acting. Soon you will know",
      "_n": 39
    },
    {
      "ar": "مَن يَأْتِيهِ عَذَابٌ يُخْزِيهِ وَيَحِلُّ عَلَيْهِ عَذَابٌ مُّقِيمٌ",
      "en": "who will be overtaken by a punishment that will disgrace him, and on whom a lasting punishment will descend.’",
      "_n": 40
    },
    {
      "ar": "إِنَّآ أَنزَلْنَا عَلَيْكَ ٱلْكِتَـٰبَ لِلنَّاسِ بِٱلْحَقِّ ۖ فَمَنِ ٱهْتَدَىٰ فَلِنَفْسِهِۦ ۖ وَمَن ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيْهَا ۖ وَمَآ أَنتَ عَلَيْهِم بِوَكِيلٍ",
      "en": "Indeed We have sent down the Book to you with the truth for [the deliverance of] mankind. So whoever is guided is guided for his own sake, and whoever goes astray, goes astray to his own detriment, and it is not your duty to watch over them.",
      "_n": 41
    },
    {
      "ar": "ٱللَّهُ يَتَوَفَّى ٱلْأَنفُسَ حِينَ مَوْتِهَا وَٱلَّتِى لَمْ تَمُتْ فِى مَنَامِهَا ۖ فَيُمْسِكُ ٱلَّتِى قَضَىٰ عَلَيْهَا ٱلْمَوْتَ وَيُرْسِلُ ٱلْأُخْرَىٰٓ إِلَىٰٓ أَجَلٍ مُّسَمًّى ۚ إِنَّ فِى ذَٰلِكَ لَـَٔايَـٰتٍ لِّقَوْمٍ يَتَفَكَّرُونَ",
      "en": "Allah takes the souls at the time of their death, and those who have not died, in their sleep. Then He retains those for whom He has ordained death and releases the others until a specified time. There are indeed signs in that for a people who reflect.",
      "_n": 42
    },
    {
      "ar": "أَمِ ٱتَّخَذُوا۟ مِن دُونِ ٱللَّهِ شُفَعَآءَ ۚ قُلْ أَوَلَوْ كَانُوا۟ لَا يَمْلِكُونَ شَيْـًٔا وَلَا يَعْقِلُونَ",
      "en": "Have they taken intercessors besides Allah? Say, ‘What! Even though they do not control anything, and cannot reason?!’",
      "_n": 43
    },
    {
      "ar": "قُل لِّلَّهِ ٱلشَّفَـٰعَةُ جَمِيعًا ۖ لَّهُۥ مُلْكُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۖ ثُمَّ إِلَيْهِ تُرْجَعُونَ",
      "en": "Say, ‘All intercession rests with Allah. To Him belongs the kingdom of the heavens and the earth; then you will be brought back to Him.’",
      "_n": 44
    },
    {
      "ar": "وَإِذَا ذُكِرَ ٱللَّهُ وَحْدَهُ ٱشْمَأَزَّتْ قُلُوبُ ٱلَّذِينَ لَا يُؤْمِنُونَ بِٱلْـَٔاخِرَةِ ۖ وَإِذَا ذُكِرَ ٱلَّذِينَ مِن دُونِهِۦٓ إِذَا هُمْ يَسْتَبْشِرُونَ",
      "en": "When Allah is mentioned alone, [thereat] shrink away the hearts of those who do not believe in the Hereafter, but when others are mentioned besides Him, behold, they rejoice!",
      "_n": 45
    },
    {
      "ar": "قُلِ ٱللَّهُمَّ فَاطِرَ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ عَـٰلِمَ ٱلْغَيْبِ وَٱلشَّهَـٰدَةِ أَنتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِى مَا كَانُوا۟ فِيهِ يَخْتَلِفُونَ",
      "en": "Say, ‘O Allah! Originator of the heavens and the earth, Knower of the sensible and the Unseen, You will judge between Your servants concerning that about which they used to differ.’",
      "_n": 46
    },
    {
      "ar": "وَلَوْ أَنَّ لِلَّذِينَ ظَلَمُوا۟ مَا فِى ٱلْأَرْضِ جَمِيعًا وَمِثْلَهُۥ مَعَهُۥ لَٱفْتَدَوْا۟ بِهِۦ مِن سُوٓءِ ٱلْعَذَابِ يَوْمَ ٱلْقِيَـٰمَةِ ۚ وَبَدَا لَهُم مِّنَ ٱللَّهِ مَا لَمْ يَكُونُوا۟ يَحْتَسِبُونَ",
      "en": "Even if the wrongdoers possessed all that is on the earth, and as much of it besides, they would offer it on the Day of Resurrection to redeem themselves with it from a terrible punishment, and there will appear to them from Allah what they had never reckoned.",
      "_n": 47
    },
    {
      "ar": "وَبَدَا لَهُمْ سَيِّـَٔاتُ مَا كَسَبُوا۟ وَحَاقَ بِهِم مَّا كَانُوا۟ بِهِۦ يَسْتَهْزِءُونَ",
      "en": "The evils of what they had earned will appear to them, and they will be besieged by what they used to deride.",
      "_n": 48
    },
    {
      "ar": "فَإِذَا مَسَّ ٱلْإِنسَـٰنَ ضُرٌّ دَعَانَا ثُمَّ إِذَا خَوَّلْنَـٰهُ نِعْمَةً مِّنَّا قَالَ إِنَّمَآ أُوتِيتُهُۥ عَلَىٰ عِلْمٍۭ ۚ بَلْ هِىَ فِتْنَةٌ وَلَـٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ",
      "en": "When distress befalls man, he supplicates Us. Then, when We grant him a blessing from Us, he says, ‘I was given it by virtue of [my] knowledge.’ Indeed, it is a test, but most of them do not know.",
      "_n": 49
    },
    {
      "ar": "قَدْ قَالَهَا ٱلَّذِينَ مِن قَبْلِهِمْ فَمَآ أَغْنَىٰ عَنْهُم مَّا كَانُوا۟ يَكْسِبُونَ",
      "en": "Those who were before them [also] said that, but what they used to earn did not avail them.",
      "_n": 50
    },
    {
      "ar": "فَأَصَابَهُمْ سَيِّـَٔاتُ مَا كَسَبُوا۟ ۚ وَٱلَّذِينَ ظَلَمُوا۟ مِنْ هَـٰٓؤُلَآءِ سَيُصِيبُهُمْ سَيِّـَٔاتُ مَا كَسَبُوا۟ وَمَا هُم بِمُعْجِزِينَ",
      "en": "So the evils of what they had earned visited them, and as for the wrongdoers among these, the evils of what they earn shall be visited on them and they will not frustrate [Allah].",
      "_n": 51
    },
    {
      "ar": "أَوَلَمْ يَعْلَمُوٓا۟ أَنَّ ٱللَّهَ يَبْسُطُ ٱلرِّزْقَ لِمَن يَشَآءُ وَيَقْدِرُ ۚ إِنَّ فِى ذَٰلِكَ لَـَٔايَـٰتٍ لِّقَوْمٍ يُؤْمِنُونَ",
      "en": "Do they not know that Allah expands the provision for whomever He wishes and tightens it [for whomever He wishes]? There are indeed signs in that for a people who have faith.",
      "_n": 52
    },
    {
      "ar": "قُلْ يَـٰعِبَادِىَ ٱلَّذِينَ أَسْرَفُوا۟ عَلَىٰٓ أَنفُسِهِمْ لَا تَقْنَطُوا۟ مِن رَّحْمَةِ ٱللَّهِ ۚ إِنَّ ٱللَّهَ يَغْفِرُ ٱلذُّنُوبَ جَمِيعًا ۚ إِنَّهُۥ هُوَ ٱلْغَفُورُ ٱلرَّحِيمُ",
      "en": "Say [that Allah declares,] ‘O My servants who have committed excesses against their own souls, do not despair of the mercy of Allah. Indeed Allah will forgive all sins. Indeed, He is the All-forgiving, the All-merciful.",
      "_n": 53
    },
    {
      "ar": "وَأَنِيبُوٓا۟ إِلَىٰ رَبِّكُمْ وَأَسْلِمُوا۟ لَهُۥ مِن قَبْلِ أَن يَأْتِيَكُمُ ٱلْعَذَابُ ثُمَّ لَا تُنصَرُونَ",
      "en": "Turn penitently to Him and submit to Him before the punishment overtakes you, whereupon you will not be helped.",
      "_n": 54
    },
    {
      "ar": "وَٱتَّبِعُوٓا۟ أَحْسَنَ مَآ أُنزِلَ إِلَيْكُم مِّن رَّبِّكُم مِّن قَبْلِ أَن يَأْتِيَكُمُ ٱلْعَذَابُ بَغْتَةً وَأَنتُمْ لَا تَشْعُرُونَ",
      "en": "Follow the best of what has been sent down to you from your Lord, before the punishment overtakes you suddenly while you are unaware.’",
      "_n": 55
    },
    {
      "ar": "أَن تَقُولَ نَفْسٌ يَـٰحَسْرَتَىٰ عَلَىٰ مَا فَرَّطتُ فِى جَنۢبِ ٱللَّهِ وَإِن كُنتُ لَمِنَ ٱلسَّـٰخِرِينَ",
      "en": "Lest anyone should say, ‘Alas for my negligence in the vicinage of Allah! Indeed I was among those who ridiculed.’",
      "_n": 56
    },
    {
      "ar": "أَوْ تَقُولَ لَوْ أَنَّ ٱللَّهَ هَدَىٰنِى لَكُنتُ مِنَ ٱلْمُتَّقِينَ",
      "en": "Or say, ‘Had Allah guided me I would have surely been among the Godwary!’",
      "_n": 57
    },
    {
      "ar": "أَوْ تَقُولَ حِينَ تَرَى ٱلْعَذَابَ لَوْ أَنَّ لِى كَرَّةً فَأَكُونَ مِنَ ٱلْمُحْسِنِينَ",
      "en": "Or say, when he sights the punishment, ‘If only there were a second chance for me, I would be among the virtuous!’",
      "_n": 58
    },
    {
      "ar": "بَلَىٰ قَدْ جَآءَتْكَ ءَايَـٰتِى فَكَذَّبْتَ بِهَا وَٱسْتَكْبَرْتَ وَكُنتَ مِنَ ٱلْكَـٰفِرِينَ",
      "en": "[They will be told,] ‘Yes, My signs certainly came to you, but you denied them and acted arrogantly and you were among the faithless.’",
      "_n": 59
    },
    {
      "ar": "وَيَوْمَ ٱلْقِيَـٰمَةِ تَرَى ٱلَّذِينَ كَذَبُوا۟ عَلَى ٱللَّهِ وُجُوهُهُم مُّسْوَدَّةٌ ۚ أَلَيْسَ فِى جَهَنَّمَ مَثْوًى لِّلْمُتَكَبِّرِينَ",
      "en": "On the Day of Resurrection you will see those who attributed lies to Allah with their faces blackened. Is not the [final] abode of the arrogant in hell?",
      "_n": 60
    },
    {
      "ar": "وَيُنَجِّى ٱللَّهُ ٱلَّذِينَ ٱتَّقَوْا۟ بِمَفَازَتِهِمْ لَا يَمَسُّهُمُ ٱلسُّوٓءُ وَلَا هُمْ يَحْزَنُونَ",
      "en": "Allah will deliver those who were Godwary with their salvation. No ill shall touch them, nor will they grieve.",
      "_n": 61
    },
    {
      "ar": "ٱللَّهُ خَـٰلِقُ كُلِّ شَىْءٍ ۖ وَهُوَ عَلَىٰ كُلِّ شَىْءٍ وَكِيلٌ",
      "en": "Allah is creator of all things, and He watches over all things.",
      "_n": 62
    },
    {
      "ar": "لَّهُۥ مَقَالِيدُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۗ وَٱلَّذِينَ كَفَرُوا۟ بِـَٔايَـٰتِ ٱللَّهِ أُو۟لَـٰٓئِكَ هُمُ ٱلْخَـٰسِرُونَ",
      "en": "To Him belong the keys of the heavens and the earth, and those who disbelieve in the signs of Allah—it is they who are the losers.",
      "_n": 63
    },
    {
      "ar": "قُلْ أَفَغَيْرَ ٱللَّهِ تَأْمُرُوٓنِّىٓ أَعْبُدُ أَيُّهَا ٱلْجَـٰهِلُونَ",
      "en": "Say, ‘Will you, then, bid me to worship other than Allah, O you ignorant ones?!’",
      "_n": 64
    },
    {
      "ar": "وَلَقَدْ أُوحِىَ إِلَيْكَ وَإِلَى ٱلَّذِينَ مِن قَبْلِكَ لَئِنْ أَشْرَكْتَ لَيَحْبَطَنَّ عَمَلُكَ وَلَتَكُونَنَّ مِنَ ٱلْخَـٰسِرِينَ",
      "en": "Certainly it has been revealed to you and to those [who have been] before you: ‘If you ascribe a partner to Allah your works shall fail and you shall surely be among the losers.",
      "_n": 65
    },
    {
      "ar": "بَلِ ٱللَّهَ فَٱعْبُدْ وَكُن مِّنَ ٱلشَّـٰكِرِينَ",
      "en": "No, worship Allah, and be among the grateful!’",
      "_n": 66
    },
    {
      "ar": "وَمَا قَدَرُوا۟ ٱللَّهَ حَقَّ قَدْرِهِۦ وَٱلْأَرْضُ جَمِيعًا قَبْضَتُهُۥ يَوْمَ ٱلْقِيَـٰمَةِ وَٱلسَّمَـٰوَٰتُ مَطْوِيَّـٰتٌۢ بِيَمِينِهِۦ ۚ سُبْحَـٰنَهُۥ وَتَعَـٰلَىٰ عَمَّا يُشْرِكُونَ",
      "en": "They do not regard Allah with the regard due to Him, yet the entire earth will be in His fist on the Day of Resurrection, and the heavens, scrolled, in His right hand. Immaculate is He and exalted above [having] any partners that they ascribe [to Him].",
      "_n": 67
    },
    {
      "ar": "وَنُفِخَ فِى ٱلصُّورِ فَصَعِقَ مَن فِى ٱلسَّمَـٰوَٰتِ وَمَن فِى ٱلْأَرْضِ إِلَّا مَن شَآءَ ٱللَّهُ ۖ ثُمَّ نُفِخَ فِيهِ أُخْرَىٰ فَإِذَا هُمْ قِيَامٌ يَنظُرُونَ",
      "en": "And the Trumpet will be blown, and whoever is in the heavens will swoon and whoever is on the earth, except whomever Allah wishes. Then it will be blown a second time, behold, they will rise up, looking on!",
      "_n": 68
    },
    {
      "ar": "وَأَشْرَقَتِ ٱلْأَرْضُ بِنُورِ رَبِّهَا وَوُضِعَ ٱلْكِتَـٰبُ وَجِا۟ىٓءَ بِٱلنَّبِيِّـۧنَ وَٱلشُّهَدَآءِ وَقُضِىَ بَيْنَهُم بِٱلْحَقِّ وَهُمْ لَا يُظْلَمُونَ",
      "en": "The earth will glow with the light of her Lord, and the Book will be set up, and the prophets and the martyrs will be brought, and judgment will be made between them with justice, and they will not be wronged.",
      "_n": 69
    },
    {
      "ar": "وَوُفِّيَتْ كُلُّ نَفْسٍ مَّا عَمِلَتْ وَهُوَ أَعْلَمُ بِمَا يَفْعَلُونَ",
      "en": "Every soul will be recompensed fully for what it has done, and He is best aware of what they do.",
      "_n": 70
    },
    {
      "ar": "وَسِيقَ ٱلَّذِينَ كَفَرُوٓا۟ إِلَىٰ جَهَنَّمَ زُمَرًا ۖ حَتَّىٰٓ إِذَا جَآءُوهَا فُتِحَتْ أَبْوَٰبُهَا وَقَالَ لَهُمْ خَزَنَتُهَآ أَلَمْ يَأْتِكُمْ رُسُلٌ مِّنكُمْ يَتْلُونَ عَلَيْكُمْ ءَايَـٰتِ رَبِّكُمْ وَيُنذِرُونَكُمْ لِقَآءَ يَوْمِكُمْ هَـٰذَا ۚ قَالُوا۟ بَلَىٰ وَلَـٰكِنْ حَقَّتْ كَلِمَةُ ٱلْعَذَابِ عَلَى ٱلْكَـٰفِرِينَ",
      "en": "The faithless will be driven to hell in throngs. When they reach it and its gates are opened, its keepers will say to them, ‘Did there not come to you [any] apostles from among yourselves, reciting to you the signs of your Lord and warning you of the encounter of this day of yours?’ They will say, ‘Yes, but the word of punishment became due against the faithless.’",
      "_n": 71
    },
    {
      "ar": "قِيلَ ٱدْخُلُوٓا۟ أَبْوَٰبَ جَهَنَّمَ خَـٰلِدِينَ فِيهَا ۖ فَبِئْسَ مَثْوَى ٱلْمُتَكَبِّرِينَ",
      "en": "It will be said, ‘Enter the gates of hell to remain in it [forever]. Evil is the [ultimate] abode of the arrogant.’",
      "_n": 72
    },
    {
      "ar": "وَسِيقَ ٱلَّذِينَ ٱتَّقَوْا۟ رَبَّهُمْ إِلَى ٱلْجَنَّةِ زُمَرًا ۖ حَتَّىٰٓ إِذَا جَآءُوهَا وَفُتِحَتْ أَبْوَٰبُهَا وَقَالَ لَهُمْ خَزَنَتُهَا سَلَـٰمٌ عَلَيْكُمْ طِبْتُمْ فَٱدْخُلُوهَا خَـٰلِدِينَ",
      "en": "Those who are wary of their Lord will be led to paradise in throngs. When they reach it and its gates are opened, its keepers will say to them, ‘Peace be to you! You are welcome! Enter it to remain [forever].’",
      "_n": 73
    },
    {
      "ar": "وَقَالُوا۟ ٱلْحَمْدُ لِلَّهِ ٱلَّذِى صَدَقَنَا وَعْدَهُۥ وَأَوْرَثَنَا ٱلْأَرْضَ نَتَبَوَّأُ مِنَ ٱلْجَنَّةِ حَيْثُ نَشَآءُ ۖ فَنِعْمَ أَجْرُ ٱلْعَـٰمِلِينَ",
      "en": "They will say, ‘All praise belongs to Allah, who has fulfilled His promise to us and made us inheritors of the earth, that we may settle in paradise wherever we may wish!’ How excellent is the reward of the workers [of righteousness]!",
      "_n": 74
    },
    {
      "ar": "وَتَرَى ٱلْمَلَـٰٓئِكَةَ حَآفِّينَ مِنْ حَوْلِ ٱلْعَرْشِ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ ۖ وَقُضِىَ بَيْنَهُم بِٱلْحَقِّ وَقِيلَ ٱلْحَمْدُ لِلَّهِ رَبِّ ٱلْعَـٰلَمِينَ",
      "en": "And you will see the angels surrounding the Throne, celebrating the praise of their Lord, and judgment will be made between them with justice, and it will be said, ‘All praise belongs to Allah, the Lord of all the worlds!’",
      "_n": 75
    }
  ],
  "_n": 39,
  "_c": 75
}