{
  "ar": "ق",
  "en": "The letter Qaaf",
  "_a": "Qaaf",
  "_l": "Meccan",
  "_v": [
    {
      "ar": "قٓ ۚ وَٱلْقُرْءَانِ ٱلْمَجِيدِ",
      "en": "Qaf. By the glorious Quran.",
      "_n": 1
    },
    {
      "ar": "بَلْ عَجِبُوٓا۟ أَن جَآءَهُم مُّنذِرٌ مِّنْهُمْ فَقَالَ ٱلْكَـٰفِرُونَ هَـٰذَا شَىْءٌ عَجِيبٌ",
      "en": "Indeed they consider it odd that a warner from among themselves should have come to them. So the faithless say, ‘This is an odd thing.’",
      "_n": 2
    },
    {
      "ar": "أَءِذَا مِتْنَا وَكُنَّا تُرَابًا ۖ ذَٰلِكَ رَجْعٌۢ بَعِيدٌ",
      "en": "‘What! When we are dead and have become dust, [shall we be raised again]? That is a far-fetched return!’",
      "_n": 3
    },
    {
      "ar": "قَدْ عَلِمْنَا مَا تَنقُصُ ٱلْأَرْضُ مِنْهُمْ ۖ وَعِندَنَا كِتَـٰبٌ حَفِيظٌۢ",
      "en": "We know what the earth diminishes from them, and with Us is a preserving Book.",
      "_n": 4
    },
    {
      "ar": "بَلْ كَذَّبُوا۟ بِٱلْحَقِّ لَمَّا جَآءَهُمْ فَهُمْ فِىٓ أَمْرٍ مَّرِيجٍ",
      "en": "Indeed, they denied the truth when it came to them; so they are now in a perplexed state of affairs.",
      "_n": 5
    },
    {
      "ar": "أَفَلَمْ يَنظُرُوٓا۟ إِلَى ٱلسَّمَآءِ فَوْقَهُمْ كَيْفَ بَنَيْنَـٰهَا وَزَيَّنَّـٰهَا وَمَا لَهَا مِن فُرُوجٍ",
      "en": "Have they not, then, observed the heaven above them, how We have built it and adorned it, and that there are no cracks in it?",
      "_n": 6
    },
    {
      "ar": "وَٱلْأَرْضَ مَدَدْنَـٰهَا وَأَلْقَيْنَا فِيهَا رَوَٰسِىَ وَأَنۢبَتْنَا فِيهَا مِن كُلِّ زَوْجٍۭ بَهِيجٍ",
      "en": "And We spread out the earth, and cast in it firm mountains, and caused every delightful kind [of vegetation] to grow in it.",
      "_n": 7
    },
    {
      "ar": "تَبْصِرَةً وَذِكْرَىٰ لِكُلِّ عَبْدٍ مُّنِيبٍ",
      "en": "[In this there is] an insight and admonition for every penitent servant.",
      "_n": 8
    },
    {
      "ar": "وَنَزَّلْنَا مِنَ ٱلسَّمَآءِ مَآءً مُّبَـٰرَكًا فَأَنۢبَتْنَا بِهِۦ جَنَّـٰتٍ وَحَبَّ ٱلْحَصِيدِ",
      "en": "We send down from the sky salubrious water, with which We grow gardens and the grain which is harvested,",
      "_n": 9
    },
    {
      "ar": "وَٱلنَّخْلَ بَاسِقَـٰتٍ لَّهَا طَلْعٌ نَّضِيدٌ",
      "en": "and tall date palms with regularly set spathes,",
      "_n": 10
    },
    {
      "ar": "رِّزْقًا لِّلْعِبَادِ ۖ وَأَحْيَيْنَا بِهِۦ بَلْدَةً مَّيْتًا ۚ كَذَٰلِكَ ٱلْخُرُوجُ",
      "en": "as a provision for Our servants, and with it We revive a dead country. Likewise will be the rising [from the dead].",
      "_n": 11
    },
    {
      "ar": "كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَأَصْحَـٰبُ ٱلرَّسِّ وَثَمُودُ",
      "en": "The people of Noah denied before them, and [so did] the people of Rass and Thamud,",
      "_n": 12
    },
    {
      "ar": "وَعَادٌ وَفِرْعَوْنُ وَإِخْوَٰنُ لُوطٍ",
      "en": "and ‘Ad, Pharaoh, and the brethren of Lot,",
      "_n": 13
    },
    {
      "ar": "وَأَصْحَـٰبُ ٱلْأَيْكَةِ وَقَوْمُ تُبَّعٍ ۚ كُلٌّ كَذَّبَ ٱلرُّسُلَ فَحَقَّ وَعِيدِ",
      "en": "and the inhabitants of Aykah and the people of Tubbac. Each [of them] impugned the apostles, and so My threat became due [against them].",
      "_n": 14
    },
    {
      "ar": "أَفَعَيِينَا بِٱلْخَلْقِ ٱلْأَوَّلِ ۚ بَلْ هُمْ فِى لَبْسٍ مِّنْ خَلْقٍ جَدِيدٍ",
      "en": "Have We been exhausted by the first creation? No, they are in doubt about a new creation.",
      "_n": 15
    },
    {
      "ar": "وَلَقَدْ خَلَقْنَا ٱلْإِنسَـٰنَ وَنَعْلَمُ مَا تُوَسْوِسُ بِهِۦ نَفْسُهُۥ ۖ وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ ٱلْوَرِيدِ",
      "en": "Certainly We have created man and We know to what his soul tempts him, and We are nearer to him than his jugular vein.",
      "_n": 16
    },
    {
      "ar": "إِذْ يَتَلَقَّى ٱلْمُتَلَقِّيَانِ عَنِ ٱلْيَمِينِ وَعَنِ ٱلشِّمَالِ قَعِيدٌ",
      "en": "When the twin recorders record [his deeds], seated on the right hand and on the left:",
      "_n": 17
    },
    {
      "ar": "مَّا يَلْفِظُ مِن قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ",
      "en": "he says no word but that there is a ready observer beside him.",
      "_n": 18
    },
    {
      "ar": "وَجَآءَتْ سَكْرَةُ ٱلْمَوْتِ بِٱلْحَقِّ ۖ ذَٰلِكَ مَا كُنتَ مِنْهُ تَحِيدُ",
      "en": "The throes of death bring the truth: ‘This is what you used to shun!’",
      "_n": 19
    },
    {
      "ar": "وَنُفِخَ فِى ٱلصُّورِ ۚ ذَٰلِكَ يَوْمُ ٱلْوَعِيدِ",
      "en": "And the Trumpet will be blown: ‘This is the promised day.’",
      "_n": 20
    },
    {
      "ar": "وَجَآءَتْ كُلُّ نَفْسٍ مَّعَهَا سَآئِقٌ وَشَهِيدٌ",
      "en": "Every soul will come accompanied by [two angels], a driver, and a witness:",
      "_n": 21
    },
    {
      "ar": "لَّقَدْ كُنتَ فِى غَفْلَةٍ مِّنْ هَـٰذَا فَكَشَفْنَا عَنكَ غِطَآءَكَ فَبَصَرُكَ ٱلْيَوْمَ حَدِيدٌ",
      "en": "[he will be told] ‘You were certainly oblivious of this. We have removed your veil from you, and so today your eyesight is acute.’",
      "_n": 22
    },
    {
      "ar": "وَقَالَ قَرِينُهُۥ هَـٰذَا مَا لَدَىَّ عَتِيدٌ",
      "en": "Then his companion [angel] will say, ‘This is what is ready with me [of his record of deeds].’",
      "_n": 23
    },
    {
      "ar": "أَلْقِيَا فِى جَهَنَّمَ كُلَّ كَفَّارٍ عَنِيدٍ",
      "en": "[The two angels accompany him will be told,] ‘Cast every obdurate ingrate into hell,",
      "_n": 24
    },
    {
      "ar": "مَّنَّاعٍ لِّلْخَيْرِ مُعْتَدٍ مُّرِيبٍ",
      "en": "[every] hinderer of good, transgressor, and skeptic,",
      "_n": 25
    },
    {
      "ar": "ٱلَّذِى جَعَلَ مَعَ ٱللَّهِ إِلَـٰهًا ءَاخَرَ فَأَلْقِيَاهُ فِى ٱلْعَذَابِ ٱلشَّدِيدِ",
      "en": "who had set up another god along with Allah and cast him into the severe punishment.’",
      "_n": 26
    },
    {
      "ar": "قَالَ قَرِينُهُۥ رَبَّنَا مَآ أَطْغَيْتُهُۥ وَلَـٰكِن كَانَ فِى ضَلَـٰلٍۭ بَعِيدٍ",
      "en": "His companion [devil] will say, ‘Our Lord! I did not incite him to rebel [against You], but he was [himself] in extreme error.’",
      "_n": 27
    },
    {
      "ar": "قَالَ لَا تَخْتَصِمُوا۟ لَدَىَّ وَقَدْ قَدَّمْتُ إِلَيْكُم بِٱلْوَعِيدِ",
      "en": "He will say, ‘Do not wrangle in My presence, for I had already warned you in advance.",
      "_n": 28
    },
    {
      "ar": "مَا يُبَدَّلُ ٱلْقَوْلُ لَدَىَّ وَمَآ أَنَا۠ بِظَلَّـٰمٍ لِّلْعَبِيدِ",
      "en": "The word [of judgement] is unalterable with Me, and I am not tyrannical to My servants.’",
      "_n": 29
    },
    {
      "ar": "يَوْمَ نَقُولُ لِجَهَنَّمَ هَلِ ٱمْتَلَأْتِ وَتَقُولُ هَلْ مِن مَّزِيدٍ",
      "en": "The day when We shall say to hell, ‘Are you full?’ It will say, ‘Is there any more?’",
      "_n": 30
    },
    {
      "ar": "وَأُزْلِفَتِ ٱلْجَنَّةُ لِلْمُتَّقِينَ غَيْرَ بَعِيدٍ",
      "en": "And paradise will be brought near for the Godwary, it will not be distant [any more]:",
      "_n": 31
    },
    {
      "ar": "هَـٰذَا مَا تُوعَدُونَ لِكُلِّ أَوَّابٍ حَفِيظٍ",
      "en": "‘This is what you were promised. [It is] for every penitent and dutiful [servant]",
      "_n": 32
    },
    {
      "ar": "مَّنْ خَشِىَ ٱلرَّحْمَـٰنَ بِٱلْغَيْبِ وَجَآءَ بِقَلْبٍ مُّنِيبٍ",
      "en": "who fears the All-beneficent in secret and comes with a penitent heart.",
      "_n": 33
    },
    {
      "ar": "ٱدْخُلُوهَا بِسَلَـٰمٍ ۖ ذَٰلِكَ يَوْمُ ٱلْخُلُودِ",
      "en": "Enter it in peace! This is the day of immortality.’",
      "_n": 34
    },
    {
      "ar": "لَهُم مَّا يَشَآءُونَ فِيهَا وَلَدَيْنَا مَزِيدٌ",
      "en": "There they will have whatever they wish, and with Us there is yet more.",
      "_n": 35
    },
    {
      "ar": "وَكَمْ أَهْلَكْنَا قَبْلَهُم مِّن قَرْنٍ هُمْ أَشَدُّ مِنْهُم بَطْشًا فَنَقَّبُوا۟ فِى ٱلْبِلَـٰدِ هَلْ مِن مَّحِيصٍ",
      "en": "How many generations We have destroyed before them, who were stronger than these, insomuch that they ransacked the towns?! So, is there any escape [from Allah’s punishment]?",
      "_n": 36
    },
    {
      "ar": "إِنَّ فِى ذَٰلِكَ لَذِكْرَىٰ لِمَن كَانَ لَهُۥ قَلْبٌ أَوْ أَلْقَى ٱلسَّمْعَ وَهُوَ شَهِيدٌ",
      "en": "There is indeed an admonition in that for one who has a heart, or gives ear, being attentive.",
      "_n": 37
    },
    {
      "ar": "وَلَقَدْ خَلَقْنَا ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ وَمَا بَيْنَهُمَا فِى سِتَّةِ أَيَّامٍ وَمَا مَسَّنَا مِن لُّغُوبٍ",
      "en": "Certainly We created the heavens and the earth, and whatever is between them, in six days, and any fatigue did not touch Us.",
      "_n": 38
    },
    {
      "ar": "فَٱصْبِرْ عَلَىٰ مَا يَقُولُونَ وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ ٱلشَّمْسِ وَقَبْلَ ٱلْغُرُوبِ",
      "en": "So be patient at what they say, and celebrate the praise of your Lord before the rising of the sun and before the sunset,",
      "_n": 39
    },
    {
      "ar": "وَمِنَ ٱلَّيْلِ فَسَبِّحْهُ وَأَدْبَـٰرَ ٱلسُّجُودِ",
      "en": "and glorify Him through part of the night and after the prostrations.",
      "_n": 40
    },
    {
      "ar": "وَٱسْتَمِعْ يَوْمَ يُنَادِ ٱلْمُنَادِ مِن مَّكَانٍ قَرِيبٍ",
      "en": "And be on the alert for the day when the caller calls from a close quarter,",
      "_n": 41
    },
    {
      "ar": "يَوْمَ يَسْمَعُونَ ٱلصَّيْحَةَ بِٱلْحَقِّ ۚ ذَٰلِكَ يَوْمُ ٱلْخُرُوجِ",
      "en": "the day when they hear the Cry in all truth. That is the day of rising [from the dead].",
      "_n": 42
    },
    {
      "ar": "إِنَّا نَحْنُ نُحْىِۦ وَنُمِيتُ وَإِلَيْنَا ٱلْمَصِيرُ",
      "en": "Indeed it is We who give life and bring death, and toward Us is the [final] destination.",
      "_n": 43
    },
    {
      "ar": "يَوْمَ تَشَقَّقُ ٱلْأَرْضُ عَنْهُمْ سِرَاعًا ۚ ذَٰلِكَ حَشْرٌ عَلَيْنَا يَسِيرٌ",
      "en": "The day the earth is split open for [disentombing] them, [they will come out] hastening. That mustering is easy for Us [to carry out].",
      "_n": 44
    },
    {
      "ar": "نَّحْنُ أَعْلَمُ بِمَا يَقُولُونَ ۖ وَمَآ أَنتَ عَلَيْهِم بِجَبَّارٍ ۖ فَذَكِّرْ بِٱلْقُرْءَانِ مَن يَخَافُ وَعِيدِ",
      "en": "We know well what they say, and you are not there to compel them. So admonish by the Quran those who fear My threat.",
      "_n": 45
    }
  ],
  "_n": 50,
  "_c": 45
}