{
  "ar": "الحديد",
  "en": "The Iron",
  "_a": "Al-Hadid",
  "_l": "Medinan",
  "_v": [
    {
      "ar": "سَبَّحَ لِلَّهِ مَا فِى ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۖ وَهُوَ ٱلْعَزِيزُ ٱلْحَكِيمُ",
      "en": "Whatever there is in the heavens and [whatever there is on] the earth glorifies Allah and He is the All-mighty, the All-wise.",
      "_n": 1
    },
    {
      "ar": "لَهُۥ مُلْكُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۖ يُحْىِۦ وَيُمِيتُ ۖ وَهُوَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ",
      "en": "To Him belongs the kingdom of the heavens and the earth: He gives life and brings death, and He has power over all things.",
      "_n": 2
    },
    {
      "ar": "هُوَ ٱلْأَوَّلُ وَٱلْـَٔاخِرُ وَٱلظَّـٰهِرُ وَٱلْبَاطِنُ ۖ وَهُوَ بِكُلِّ شَىْءٍ عَلِيمٌ",
      "en": "He is the First and the Last, the Manifest and the Hidden, and He has knowledge of all things.",
      "_n": 3
    },
    {
      "ar": "هُوَ ٱلَّذِى خَلَقَ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ فِى سِتَّةِ أَيَّامٍ ثُمَّ ٱسْتَوَىٰ عَلَى ٱلْعَرْشِ ۚ يَعْلَمُ مَا يَلِجُ فِى ٱلْأَرْضِ وَمَا يَخْرُجُ مِنْهَا وَمَا يَنزِلُ مِنَ ٱلسَّمَآءِ وَمَا يَعْرُجُ فِيهَا ۖ وَهُوَ مَعَكُمْ أَيْنَ مَا كُنتُمْ ۚ وَٱللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ",
      "en": "It is He who created the heavens and the earth in six days; then settled on the Throne. He knows whatever enters the earth and whatever emerges from it and whatever descends from the sky and whatever ascends to it, and He is with you wherever you may be, and Allah watches what you do.",
      "_n": 4
    },
    {
      "ar": "لَّهُۥ مُلْكُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۚ وَإِلَى ٱللَّهِ تُرْجَعُ ٱلْأُمُورُ",
      "en": "To Him belongs the kingdom of the heavens and the earth, and to Allah all matters are returned.",
      "_n": 5
    },
    {
      "ar": "يُولِجُ ٱلَّيْلَ فِى ٱلنَّهَارِ وَيُولِجُ ٱلنَّهَارَ فِى ٱلَّيْلِ ۚ وَهُوَ عَلِيمٌۢ بِذَاتِ ٱلصُّدُورِ",
      "en": "He makes the night pass into the day and makes the day pass into the night, and He knows best what is in the breasts.",
      "_n": 6
    },
    {
      "ar": "ءَامِنُوا۟ بِٱللَّهِ وَرَسُولِهِۦ وَأَنفِقُوا۟ مِمَّا جَعَلَكُم مُّسْتَخْلَفِينَ فِيهِ ۖ فَٱلَّذِينَ ءَامَنُوا۟ مِنكُمْ وَأَنفَقُوا۟ لَهُمْ أَجْرٌ كَبِيرٌ",
      "en": "Have faith in Allah and His Apostle, and spend out of that of which He has made you heirs. There is a great reward for those of you who have faith and spend [in Allah’s way].",
      "_n": 7
    },
    {
      "ar": "وَمَا لَكُمْ لَا تُؤْمِنُونَ بِٱللَّهِ ۙ وَٱلرَّسُولُ يَدْعُوكُمْ لِتُؤْمِنُوا۟ بِرَبِّكُمْ وَقَدْ أَخَذَ مِيثَـٰقَكُمْ إِن كُنتُم مُّؤْمِنِينَ",
      "en": "Why should you not have faith in Allah when the Apostle invites you to have faith in your Lord, and He has certainly made a covenant with you, if you are [genuinely] faithful?",
      "_n": 8
    },
    {
      "ar": "هُوَ ٱلَّذِى يُنَزِّلُ عَلَىٰ عَبْدِهِۦٓ ءَايَـٰتٍۭ بَيِّنَـٰتٍ لِّيُخْرِجَكُم مِّنَ ٱلظُّلُمَـٰتِ إِلَى ٱلنُّورِ ۚ وَإِنَّ ٱللَّهَ بِكُمْ لَرَءُوفٌ رَّحِيمٌ",
      "en": "It is He who sends down manifest signs to His servant that He may bring you out of darkness into light, and indeed Allah is most kind and merciful to you.",
      "_n": 9
    },
    {
      "ar": "وَمَا لَكُمْ أَلَّا تُنفِقُوا۟ فِى سَبِيلِ ٱللَّهِ وَلِلَّهِ مِيرَٰثُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۚ لَا يَسْتَوِى مِنكُم مَّنْ أَنفَقَ مِن قَبْلِ ٱلْفَتْحِ وَقَـٰتَلَ ۚ أُو۟لَـٰٓئِكَ أَعْظَمُ دَرَجَةً مِّنَ ٱلَّذِينَ أَنفَقُوا۟ مِنۢ بَعْدُ وَقَـٰتَلُوا۟ ۚ وَكُلًّا وَعَدَ ٱللَّهُ ٱلْحُسْنَىٰ ۚ وَٱللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ",
      "en": "Why should you not spend in the way of Allah, when to Allah belongs the heritage of the heavens and the earth? Those of you who spent [their means] and fought before the victory are not equal [to others]. They are greater in rank than those who have spent and fought afterwards. Yet Allah has promised the best reward to each and Allah is well aware of what you do.",
      "_n": 10
    },
    {
      "ar": "مَّن ذَا ٱلَّذِى يُقْرِضُ ٱللَّهَ قَرْضًا حَسَنًا فَيُضَـٰعِفَهُۥ لَهُۥ وَلَهُۥٓ أَجْرٌ كَرِيمٌ",
      "en": "Who is it that will lend Allah a good loan, that He may multiply it for him and [that] there may be a noble reward for him?",
      "_n": 11
    },
    {
      "ar": "يَوْمَ تَرَى ٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَـٰتِ يَسْعَىٰ نُورُهُم بَيْنَ أَيْدِيهِمْ وَبِأَيْمَـٰنِهِم بُشْرَىٰكُمُ ٱلْيَوْمَ جَنَّـٰتٌ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَا ۚ ذَٰلِكَ هُوَ ٱلْفَوْزُ ٱلْعَظِيمُ",
      "en": "The day you will see the faithful, men and women, with their light moving swiftly in front of them and on their right, [and they are greeted with the words:] ‘There is good news for you today! Gardens with streams running in them, to remain in them [forever]. That is the great success.’",
      "_n": 12
    },
    {
      "ar": "يَوْمَ يَقُولُ ٱلْمُنَـٰفِقُونَ وَٱلْمُنَـٰفِقَـٰتُ لِلَّذِينَ ءَامَنُوا۟ ٱنظُرُونَا نَقْتَبِسْ مِن نُّورِكُمْ قِيلَ ٱرْجِعُوا۟ وَرَآءَكُمْ فَٱلْتَمِسُوا۟ نُورًا فَضُرِبَ بَيْنَهُم بِسُورٍ لَّهُۥ بَابٌۢ بَاطِنُهُۥ فِيهِ ٱلرَّحْمَةُ وَظَـٰهِرُهُۥ مِن قِبَلِهِ ٱلْعَذَابُ",
      "en": "The day the hypocrites, men and women, will say to the faithful, ‘Please wait, that we may glean something from your light!’ They will be told: ‘Go back and grope for light!’ Then there will be set up between them a wall with a gate, with mercy within and punishment without.",
      "_n": 13
    },
    {
      "ar": "يُنَادُونَهُمْ أَلَمْ نَكُن مَّعَكُمْ ۖ قَالُوا۟ بَلَىٰ وَلَـٰكِنَّكُمْ فَتَنتُمْ أَنفُسَكُمْ وَتَرَبَّصْتُمْ وَٱرْتَبْتُمْ وَغَرَّتْكُمُ ٱلْأَمَانِىُّ حَتَّىٰ جَآءَ أَمْرُ ٱللَّهِ وَغَرَّكُم بِٱللَّهِ ٱلْغَرُورُ",
      "en": "They will call out to them, ‘Did we not use to be with you?’ They will say, ‘Yes! But you cast yourselves into perdition. You awaited and were skeptical, and [false] hopes deceived you until the edict of Allah came, and the Deceiver deceived you concerning Allah.",
      "_n": 14
    },
    {
      "ar": "فَٱلْيَوْمَ لَا يُؤْخَذُ مِنكُمْ فِدْيَةٌ وَلَا مِنَ ٱلَّذِينَ كَفَرُوا۟ ۚ مَأْوَىٰكُمُ ٱلنَّارُ ۖ هِىَ مَوْلَىٰكُمْ ۖ وَبِئْسَ ٱلْمَصِيرُ",
      "en": "So today no ransom shall be taken from you or the faithless. The Fire will be your abode: it is your [ultimate] refuge and an evil destination.’",
      "_n": 15
    },
    {
      "ar": "أَلَمْ يَأْنِ لِلَّذِينَ ءَامَنُوٓا۟ أَن تَخْشَعَ قُلُوبُهُمْ لِذِكْرِ ٱللَّهِ وَمَا نَزَلَ مِنَ ٱلْحَقِّ وَلَا يَكُونُوا۟ كَٱلَّذِينَ أُوتُوا۟ ٱلْكِتَـٰبَ مِن قَبْلُ فَطَالَ عَلَيْهِمُ ٱلْأَمَدُ فَقَسَتْ قُلُوبُهُمْ ۖ وَكَثِيرٌ مِّنْهُمْ فَـٰسِقُونَ",
      "en": "Is it not time yet for those who have faith that their hearts should be humbled for Allah’s remembrance and toward the truth which has come down [to them], and to be not like those who were given the Book before? Time took its toll on them and so their hearts were hardened, and many of them are transgressors.",
      "_n": 16
    },
    {
      "ar": "ٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ يُحْىِ ٱلْأَرْضَ بَعْدَ مَوْتِهَا ۚ قَدْ بَيَّنَّا لَكُمُ ٱلْـَٔايَـٰتِ لَعَلَّكُمْ تَعْقِلُونَ",
      "en": "Know that Allah revives the earth after its death. We have certainly made the signs clear for you, so that you may exercise your reason.",
      "_n": 17
    },
    {
      "ar": "إِنَّ ٱلْمُصَّدِّقِينَ وَٱلْمُصَّدِّقَـٰتِ وَأَقْرَضُوا۟ ٱللَّهَ قَرْضًا حَسَنًا يُضَـٰعَفُ لَهُمْ وَلَهُمْ أَجْرٌ كَرِيمٌ",
      "en": "Indeed the charitable men and women and those who lend Allah a good loan—it shall be multiplied for them, and there will be a noble reward for them.",
      "_n": 18
    },
    {
      "ar": "وَٱلَّذِينَ ءَامَنُوا۟ بِٱللَّهِ وَرُسُلِهِۦٓ أُو۟لَـٰٓئِكَ هُمُ ٱلصِّدِّيقُونَ ۖ وَٱلشُّهَدَآءُ عِندَ رَبِّهِمْ لَهُمْ أَجْرُهُمْ وَنُورُهُمْ ۖ وَٱلَّذِينَ كَفَرُوا۟ وَكَذَّبُوا۟ بِـَٔايَـٰتِنَآ أُو۟لَـٰٓئِكَ أَصْحَـٰبُ ٱلْجَحِيمِ",
      "en": "Those who have faith in Allah and His apostles—it is they who are the truthful and witnesses with their Lord; they shall have their reward and their light. But as for those who are faithless and deny Our signs, they shall be the inmates of hell.",
      "_n": 19
    },
    {
      "ar": "ٱعْلَمُوٓا۟ أَنَّمَا ٱلْحَيَوٰةُ ٱلدُّنْيَا لَعِبٌ وَلَهْوٌ وَزِينَةٌ وَتَفَاخُرٌۢ بَيْنَكُمْ وَتَكَاثُرٌ فِى ٱلْأَمْوَٰلِ وَٱلْأَوْلَـٰدِ ۖ كَمَثَلِ غَيْثٍ أَعْجَبَ ٱلْكُفَّارَ نَبَاتُهُۥ ثُمَّ يَهِيجُ فَتَرَىٰهُ مُصْفَرًّا ثُمَّ يَكُونُ حُطَـٰمًا ۖ وَفِى ٱلْـَٔاخِرَةِ عَذَابٌ شَدِيدٌ وَمَغْفِرَةٌ مِّنَ ٱللَّهِ وَرِضْوَٰنٌ ۚ وَمَا ٱلْحَيَوٰةُ ٱلدُّنْيَآ إِلَّا مَتَـٰعُ ٱلْغُرُورِ",
      "en": "Know that the life of this world is mere diversion and play, glamour and mutual vainglory among you and rivalry for wealth and children—like rain, whose growth impresses the farmer. Then it withers and you see it turn yellow, then it becomes chaff. Whereas in the Hereafter there is forgiveness from Allah and His approval and a severe punishment. The life of this world is nothing but the wares of delusion.",
      "_n": 20
    },
    {
      "ar": "سَابِقُوٓا۟ إِلَىٰ مَغْفِرَةٍ مِّن رَّبِّكُمْ وَجَنَّةٍ عَرْضُهَا كَعَرْضِ ٱلسَّمَآءِ وَٱلْأَرْضِ أُعِدَّتْ لِلَّذِينَ ءَامَنُوا۟ بِٱللَّهِ وَرُسُلِهِۦ ۚ ذَٰلِكَ فَضْلُ ٱللَّهِ يُؤْتِيهِ مَن يَشَآءُ ۚ وَٱللَّهُ ذُو ٱلْفَضْلِ ٱلْعَظِيمِ",
      "en": "Take the lead towards forgiveness from your Lord and a paradise as vast as the heavens and the earth, prepared for those who have faith in Allah and His apostles. That is Allah’s grace, which He grants to whomever He wishes, and Allah is dispenser of a great grace.",
      "_n": 21
    },
    {
      "ar": "مَآ أَصَابَ مِن مُّصِيبَةٍ فِى ٱلْأَرْضِ وَلَا فِىٓ أَنفُسِكُمْ إِلَّا فِى كِتَـٰبٍ مِّن قَبْلِ أَن نَّبْرَأَهَآ ۚ إِنَّ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٌ",
      "en": "No affliction visits the land or yourselves but it is in a Book before We bring it about—that is indeed easy for Allah—",
      "_n": 22
    },
    {
      "ar": "لِّكَيْلَا تَأْسَوْا۟ عَلَىٰ مَا فَاتَكُمْ وَلَا تَفْرَحُوا۟ بِمَآ ءَاتَىٰكُمْ ۗ وَٱللَّهُ لَا يُحِبُّ كُلَّ مُخْتَالٍ فَخُورٍ",
      "en": "so that you may not grieve for what escapes you, nor boast for what comes your way, and Allah does not like any swaggering braggart.",
      "_n": 23
    },
    {
      "ar": "ٱلَّذِينَ يَبْخَلُونَ وَيَأْمُرُونَ ٱلنَّاسَ بِٱلْبُخْلِ ۗ وَمَن يَتَوَلَّ فَإِنَّ ٱللَّهَ هُوَ ٱلْغَنِىُّ ٱلْحَمِيدُ",
      "en": "Such as are [themselves] stingy and bid [other] people to be stingy. And whoever refuses to comply [should know that] indeed Allah is the All-sufficient, the All-laudable.",
      "_n": 24
    },
    {
      "ar": "لَقَدْ أَرْسَلْنَا رُسُلَنَا بِٱلْبَيِّنَـٰتِ وَأَنزَلْنَا مَعَهُمُ ٱلْكِتَـٰبَ وَٱلْمِيزَانَ لِيَقُومَ ٱلنَّاسُ بِٱلْقِسْطِ ۖ وَأَنزَلْنَا ٱلْحَدِيدَ فِيهِ بَأْسٌ شَدِيدٌ وَمَنَـٰفِعُ لِلنَّاسِ وَلِيَعْلَمَ ٱللَّهُ مَن يَنصُرُهُۥ وَرُسُلَهُۥ بِٱلْغَيْبِ ۚ إِنَّ ٱللَّهَ قَوِىٌّ عَزِيزٌ",
      "en": "Certainly We sent Our apostles with manifest proofs, and We sent down with them the Book and the Balance, so that mankind may maintain justice; and We sent down iron, in which there is great might and uses for mankind, and so that Allah may know those who help Him and His apostles [with faith] in the Unseen. Indeed Allah is all-strong, all-mighty.",
      "_n": 25
    },
    {
      "ar": "وَلَقَدْ أَرْسَلْنَا نُوحًا وَإِبْرَٰهِيمَ وَجَعَلْنَا فِى ذُرِّيَّتِهِمَا ٱلنُّبُوَّةَ وَٱلْكِتَـٰبَ ۖ فَمِنْهُم مُّهْتَدٍ ۖ وَكَثِيرٌ مِّنْهُمْ فَـٰسِقُونَ",
      "en": "Certainly We sent Noah and Abraham and We ordained among their descendants prophethood and the Book. Some of them are [rightly] guided, and many of them are transgressors.",
      "_n": 26
    },
    {
      "ar": "ثُمَّ قَفَّيْنَا عَلَىٰٓ ءَاثَـٰرِهِم بِرُسُلِنَا وَقَفَّيْنَا بِعِيسَى ٱبْنِ مَرْيَمَ وَءَاتَيْنَـٰهُ ٱلْإِنجِيلَ وَجَعَلْنَا فِى قُلُوبِ ٱلَّذِينَ ٱتَّبَعُوهُ رَأْفَةً وَرَحْمَةً وَرَهْبَانِيَّةً ٱبْتَدَعُوهَا مَا كَتَبْنَـٰهَا عَلَيْهِمْ إِلَّا ٱبْتِغَآءَ رِضْوَٰنِ ٱللَّهِ فَمَا رَعَوْهَا حَقَّ رِعَايَتِهَا ۖ فَـَٔاتَيْنَا ٱلَّذِينَ ءَامَنُوا۟ مِنْهُمْ أَجْرَهُمْ ۖ وَكَثِيرٌ مِّنْهُمْ فَـٰسِقُونَ",
      "en": "Then We followed them up with Our apostles and We followed [them] with Jesus son of Mary, and We gave him the Evangel, and We put kindness and mercy into the hearts of those who followed him. But as for monasticism, they innovated it—We had not prescribed it for them—only seeking Allah’s pleasure. Yet they did not observe it with due observance. So We gave to the faithful among them their [due] reward, but many of them are transgressors.",
      "_n": 27
    },
    {
      "ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱتَّقُوا۟ ٱللَّهَ وَءَامِنُوا۟ بِرَسُولِهِۦ يُؤْتِكُمْ كِفْلَيْنِ مِن رَّحْمَتِهِۦ وَيَجْعَل لَّكُمْ نُورًا تَمْشُونَ بِهِۦ وَيَغْفِرْ لَكُمْ ۚ وَٱللَّهُ غَفُورٌ رَّحِيمٌ",
      "en": "O you who have faith! Be wary of Allah and have faith in His Apostle. He will grant you a double share of His mercy and a light to walk by, and He will forgive you, and Allah is all-forgiving, all-merciful;",
      "_n": 28
    },
    {
      "ar": "لِّئَلَّا يَعْلَمَ أَهْلُ ٱلْكِتَـٰبِ أَلَّا يَقْدِرُونَ عَلَىٰ شَىْءٍ مِّن فَضْلِ ٱللَّهِ ۙ وَأَنَّ ٱلْفَضْلَ بِيَدِ ٱللَّهِ يُؤْتِيهِ مَن يَشَآءُ ۚ وَٱللَّهُ ذُو ٱلْفَضْلِ ٱلْعَظِيمِ",
      "en": "so that the People of the Book may know that they do not control Allah grace in any wise and that in Allah’s hand is all grace, which He grants to whomever He wishes and Allah is dispenser of a mighty grace.",
      "_n": 29
    }
  ],
  "_n": 57,
  "_c": 29
}