{
  "ar": "المجادلة",
  "en": "The Pleading Woman",
  "_a": "Al-Mujaadila",
  "_l": "Medinan",
  "_v": [
    {
      "ar": "قَدْ سَمِعَ ٱللَّهُ قَوْلَ ٱلَّتِى تُجَـٰدِلُكَ فِى زَوْجِهَا وَتَشْتَكِىٓ إِلَى ٱللَّهِ وَٱللَّهُ يَسْمَعُ تَحَاوُرَكُمَآ ۚ إِنَّ ٱللَّهَ سَمِيعٌۢ بَصِيرٌ",
      "en": "Allah has certainly heard the speech of her who pleads with you about her husband and complains to Allah. Allah hears the conversation between the two of you. Indeed Allah is all-hearing, all-seeing.",
      "_n": 1
    },
    {
      "ar": "ٱلَّذِينَ يُظَـٰهِرُونَ مِنكُم مِّن نِّسَآئِهِم مَّا هُنَّ أُمَّهَـٰتِهِمْ ۖ إِنْ أُمَّهَـٰتُهُمْ إِلَّا ٱلَّـٰٓـِٔى وَلَدْنَهُمْ ۚ وَإِنَّهُمْ لَيَقُولُونَ مُنكَرًا مِّنَ ٱلْقَوْلِ وَزُورًا ۚ وَإِنَّ ٱللَّهَ لَعَفُوٌّ غَفُورٌ",
      "en": "As for those of you who repudiate their wives by zihar, they are not their mothers; their mothers are only those who bore them, and indeed they utter an outrage and a lie. Indeed Allah is all-excusing, all-forgiving.",
      "_n": 2
    },
    {
      "ar": "وَٱلَّذِينَ يُظَـٰهِرُونَ مِن نِّسَآئِهِمْ ثُمَّ يَعُودُونَ لِمَا قَالُوا۟ فَتَحْرِيرُ رَقَبَةٍ مِّن قَبْلِ أَن يَتَمَآسَّا ۚ ذَٰلِكُمْ تُوعَظُونَ بِهِۦ ۚ وَٱللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ",
      "en": "Those who repudiate their wives by ³ih¡r and then retract what they have said, shall set free a slave before they may touch each other. This you are advised [to carry out], and Allah is well aware of what you do.",
      "_n": 3
    },
    {
      "ar": "فَمَن لَّمْ يَجِدْ فَصِيَامُ شَهْرَيْنِ مُتَتَابِعَيْنِ مِن قَبْلِ أَن يَتَمَآسَّا ۖ فَمَن لَّمْ يَسْتَطِعْ فَإِطْعَامُ سِتِّينَ مِسْكِينًا ۚ ذَٰلِكَ لِتُؤْمِنُوا۟ بِٱللَّهِ وَرَسُولِهِۦ ۚ وَتِلْكَ حُدُودُ ٱللَّهِ ۗ وَلِلْكَـٰفِرِينَ عَذَابٌ أَلِيمٌ",
      "en": "He who cannot afford [to free a slave] shall fast for two successive months before they may touch each other. If he cannot [do so], he shall feed sixty needy persons. This, that you may have faith in Allah and His Apostle. These are Allah’s bounds, and there is a painful punishment for the faithless.",
      "_n": 4
    },
    {
      "ar": "إِنَّ ٱلَّذِينَ يُحَآدُّونَ ٱللَّهَ وَرَسُولَهُۥ كُبِتُوا۟ كَمَا كُبِتَ ٱلَّذِينَ مِن قَبْلِهِمْ ۚ وَقَدْ أَنزَلْنَآ ءَايَـٰتٍۭ بَيِّنَـٰتٍ ۚ وَلِلْكَـٰفِرِينَ عَذَابٌ مُّهِينٌ",
      "en": "Indeed those who oppose Allah and His Apostle will be subdued just as those who passed before them were subdued. We have certainly sent down manifest signs, and there is a humiliating punishment for the faithless.",
      "_n": 5
    },
    {
      "ar": "يَوْمَ يَبْعَثُهُمُ ٱللَّهُ جَمِيعًا فَيُنَبِّئُهُم بِمَا عَمِلُوٓا۟ ۚ أَحْصَىٰهُ ٱللَّهُ وَنَسُوهُ ۚ وَٱللَّهُ عَلَىٰ كُلِّ شَىْءٍ شَهِيدٌ",
      "en": "The day when Allah will raise them all together, He will inform them about what they have done. Allah has kept account of it, while they have forgotten, and Allah is witness to all things.",
      "_n": 6
    },
    {
      "ar": "أَلَمْ تَرَ أَنَّ ٱللَّهَ يَعْلَمُ مَا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۖ مَا يَكُونُ مِن نَّجْوَىٰ ثَلَـٰثَةٍ إِلَّا هُوَ رَابِعُهُمْ وَلَا خَمْسَةٍ إِلَّا هُوَ سَادِسُهُمْ وَلَآ أَدْنَىٰ مِن ذَٰلِكَ وَلَآ أَكْثَرَ إِلَّا هُوَ مَعَهُمْ أَيْنَ مَا كَانُوا۟ ۖ ثُمَّ يُنَبِّئُهُم بِمَا عَمِلُوا۟ يَوْمَ ٱلْقِيَـٰمَةِ ۚ إِنَّ ٱللَّهَ بِكُلِّ شَىْءٍ عَلِيمٌ",
      "en": "Have you not regarded that Allah knows whatever there is in the heavens and whatever there is in the earth? There dost not takes place any secret talk among three, but He is their fourth [companion], nor among five but He is their sixth, nor when they are less than that or more but He is with them wherever they may be. Then He will inform them about what they have done on the Day of Resurrection. Indeed Allah has knowledge of all things.",
      "_n": 7
    },
    {
      "ar": "أَلَمْ تَرَ إِلَى ٱلَّذِينَ نُهُوا۟ عَنِ ٱلنَّجْوَىٰ ثُمَّ يَعُودُونَ لِمَا نُهُوا۟ عَنْهُ وَيَتَنَـٰجَوْنَ بِٱلْإِثْمِ وَٱلْعُدْوَٰنِ وَمَعْصِيَتِ ٱلرَّسُولِ وَإِذَا جَآءُوكَ حَيَّوْكَ بِمَا لَمْ يُحَيِّكَ بِهِ ٱللَّهُ وَيَقُولُونَ فِىٓ أَنفُسِهِمْ لَوْلَا يُعَذِّبُنَا ٱللَّهُ بِمَا نَقُولُ ۚ حَسْبُهُمْ جَهَنَّمُ يَصْلَوْنَهَا ۖ فَبِئْسَ ٱلْمَصِيرُ",
      "en": "Have you not regarded those who were forbidden from secret talks but again resumed what they had been forbidden from, and hold secret talks [imbued] with sin and transgression and disobedience to the Apostle? And when they come to you they greet you with words with which Allah never greeted you, and they say to themselves, ‘Why does not Allah punish us for what we say?!’ Let hell suffice them: they shall enter it, and it is an evil destination!",
      "_n": 8
    },
    {
      "ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِذَا تَنَـٰجَيْتُمْ فَلَا تَتَنَـٰجَوْا۟ بِٱلْإِثْمِ وَٱلْعُدْوَٰنِ وَمَعْصِيَتِ ٱلرَّسُولِ وَتَنَـٰجَوْا۟ بِٱلْبِرِّ وَٱلتَّقْوَىٰ ۖ وَٱتَّقُوا۟ ٱللَّهَ ٱلَّذِىٓ إِلَيْهِ تُحْشَرُونَ",
      "en": "O you who have faith! When you converse secretly, do not hold private conversations [imbued] with sin and aggression and disobedience to the Apostle, but converse in [a spirit of] piety and Godfearing, and be wary of Allah toward whom you will be gathered.",
      "_n": 9
    },
    {
      "ar": "إِنَّمَا ٱلنَّجْوَىٰ مِنَ ٱلشَّيْطَـٰنِ لِيَحْزُنَ ٱلَّذِينَ ءَامَنُوا۟ وَلَيْسَ بِضَآرِّهِمْ شَيْـًٔا إِلَّا بِإِذْنِ ٱللَّهِ ۚ وَعَلَى ٱللَّهِ فَلْيَتَوَكَّلِ ٱلْمُؤْمِنُونَ",
      "en": "Indeed [malicious] secret talks are from Satan, that he may upset the faithful, but he cannot harm them in any way except by Allah’s leave, and in Allah let all the faithful put their trust.",
      "_n": 10
    },
    {
      "ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِذَا قِيلَ لَكُمْ تَفَسَّحُوا۟ فِى ٱلْمَجَـٰلِسِ فَٱفْسَحُوا۟ يَفْسَحِ ٱللَّهُ لَكُمْ ۖ وَإِذَا قِيلَ ٱنشُزُوا۟ فَٱنشُزُوا۟ يَرْفَعِ ٱللَّهُ ٱلَّذِينَ ءَامَنُوا۟ مِنكُمْ وَٱلَّذِينَ أُوتُوا۟ ٱلْعِلْمَ دَرَجَـٰتٍ ۚ وَٱللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ",
      "en": "O you who have faith! When you are told, ‘Make room,’ in sittings, then do make room; Allah will make room for you. And when you are told, ‘Rise up!’ Do rise up. Allah will raise in rank those of you who have faith and those who have been given knowledge, and Allah is well aware of what you do.",
      "_n": 11
    },
    {
      "ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِذَا نَـٰجَيْتُمُ ٱلرَّسُولَ فَقَدِّمُوا۟ بَيْنَ يَدَىْ نَجْوَىٰكُمْ صَدَقَةً ۚ ذَٰلِكَ خَيْرٌ لَّكُمْ وَأَطْهَرُ ۚ فَإِن لَّمْ تَجِدُوا۟ فَإِنَّ ٱللَّهَ غَفُورٌ رَّحِيمٌ",
      "en": "O you who have faith! When you converse privately with the Apostle, offer a charity before your private talk. That is better for you and purer. But if you cannot afford [to make the offering], then Allah is indeed all-forgiving, all-merciful.",
      "_n": 12
    },
    {
      "ar": "ءَأَشْفَقْتُمْ أَن تُقَدِّمُوا۟ بَيْنَ يَدَىْ نَجْوَىٰكُمْ صَدَقَـٰتٍ ۚ فَإِذْ لَمْ تَفْعَلُوا۟ وَتَابَ ٱللَّهُ عَلَيْكُمْ فَأَقِيمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ وَأَطِيعُوا۟ ٱللَّهَ وَرَسُولَهُۥ ۚ وَٱللَّهُ خَبِيرٌۢ بِمَا تَعْمَلُونَ",
      "en": "Were you dismayed by having to offer charities before your private talks? Since you did not do it, and Allah has excused you [for not be able to comply], now maintain the prayer and pay the zakat, and obey Allah and His Apostle. Allah is well aware of what you do.",
      "_n": 13
    },
    {
      "ar": "أَلَمْ تَرَ إِلَى ٱلَّذِينَ تَوَلَّوْا۟ قَوْمًا غَضِبَ ٱللَّهُ عَلَيْهِم مَّا هُم مِّنكُمْ وَلَا مِنْهُمْ وَيَحْلِفُونَ عَلَى ٱلْكَذِبِ وَهُمْ يَعْلَمُونَ",
      "en": "Have you not regarded those who befriend a people at whom Allah is wrathful? They neither belong to you, nor to them, and they swear false oaths [that they are with you] and they know.",
      "_n": 14
    },
    {
      "ar": "أَعَدَّ ٱللَّهُ لَهُمْ عَذَابًا شَدِيدًا ۖ إِنَّهُمْ سَآءَ مَا كَانُوا۟ يَعْمَلُونَ",
      "en": "Allah has prepared a severe punishment for them. Evil indeed is what they used to do.",
      "_n": 15
    },
    {
      "ar": "ٱتَّخَذُوٓا۟ أَيْمَـٰنَهُمْ جُنَّةً فَصَدُّوا۟ عَن سَبِيلِ ٱللَّهِ فَلَهُمْ عَذَابٌ مُّهِينٌ",
      "en": "They make a shield of their oaths and bar [people] from the way of Allah; so there is a humiliating punishment for them.",
      "_n": 16
    },
    {
      "ar": "لَّن تُغْنِىَ عَنْهُمْ أَمْوَٰلُهُمْ وَلَآ أَوْلَـٰدُهُم مِّنَ ٱللَّهِ شَيْـًٔا ۚ أُو۟لَـٰٓئِكَ أَصْحَـٰبُ ٱلنَّارِ ۖ هُمْ فِيهَا خَـٰلِدُونَ",
      "en": "Their possessions and children will not avail them in any way against Allah. They shall be the inmates of the Fire and they shall remain in it [forever].",
      "_n": 17
    },
    {
      "ar": "يَوْمَ يَبْعَثُهُمُ ٱللَّهُ جَمِيعًا فَيَحْلِفُونَ لَهُۥ كَمَا يَحْلِفُونَ لَكُمْ ۖ وَيَحْسَبُونَ أَنَّهُمْ عَلَىٰ شَىْءٍ ۚ أَلَآ إِنَّهُمْ هُمُ ٱلْكَـٰذِبُونَ",
      "en": "The day when Allah will raise them all together, they will swear to Him, just like they swear to you [now], supposing that they stand on something. Look! They are indeed liars!",
      "_n": 18
    },
    {
      "ar": "ٱسْتَحْوَذَ عَلَيْهِمُ ٱلشَّيْطَـٰنُ فَأَنسَىٰهُمْ ذِكْرَ ٱللَّهِ ۚ أُو۟لَـٰٓئِكَ حِزْبُ ٱلشَّيْطَـٰنِ ۚ أَلَآ إِنَّ حِزْبَ ٱلشَّيْطَـٰنِ هُمُ ٱلْخَـٰسِرُونَ",
      "en": "Satan has prevailed upon them, so he has caused them to forget the remembrance of Allah. They are Satan’s confederates. Look! Indeed, it is Satan’s confederates who are the losers!",
      "_n": 19
    },
    {
      "ar": "إِنَّ ٱلَّذِينَ يُحَآدُّونَ ٱللَّهَ وَرَسُولَهُۥٓ أُو۟لَـٰٓئِكَ فِى ٱلْأَذَلِّينَ",
      "en": "Indeed those who oppose Allah and His Apostle—they will be among the most abased.",
      "_n": 20
    },
    {
      "ar": "كَتَبَ ٱللَّهُ لَأَغْلِبَنَّ أَنَا۠ وَرُسُلِىٓ ۚ إِنَّ ٱللَّهَ قَوِىٌّ عَزِيزٌ",
      "en": "Allah has ordained: ‘I shall surely prevail, I and My apostles.’ Indeed Allah is all-strong, all-mighty.",
      "_n": 21
    },
    {
      "ar": "لَّا تَجِدُ قَوْمًا يُؤْمِنُونَ بِٱللَّهِ وَٱلْيَوْمِ ٱلْـَٔاخِرِ يُوَآدُّونَ مَنْ حَآدَّ ٱللَّهَ وَرَسُولَهُۥ وَلَوْ كَانُوٓا۟ ءَابَآءَهُمْ أَوْ أَبْنَآءَهُمْ أَوْ إِخْوَٰنَهُمْ أَوْ عَشِيرَتَهُمْ ۚ أُو۟لَـٰٓئِكَ كَتَبَ فِى قُلُوبِهِمُ ٱلْإِيمَـٰنَ وَأَيَّدَهُم بِرُوحٍ مِّنْهُ ۖ وَيُدْخِلُهُمْ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَا ۚ رَضِىَ ٱللَّهُ عَنْهُمْ وَرَضُوا۟ عَنْهُ ۚ أُو۟لَـٰٓئِكَ حِزْبُ ٱللَّهِ ۚ أَلَآ إِنَّ حِزْبَ ٱللَّهِ هُمُ ٱلْمُفْلِحُونَ",
      "en": "You will not find a people believing in Allah and the Last Day endearing those who oppose Allah and His Apostle even though they were their own parents, or children, or brothers, or kinsfolk. [For] such, He has written faith into their hearts and strengthened them with a spirit from Him. He will admit them into gardens with streams running in them, to remain in them [forever], Allah is pleased with them, and they are pleased with Him. They are Allah’s confederates. Look! The confederates of Allah are indeed felicitous!",
      "_n": 22
    }
  ],
  "_n": 58,
  "_c": 22
}