{
  "ar": "المنافقون",
  "en": "The Hypocrites",
  "_a": "Al-Munaafiqoon",
  "_l": "Medinan",
  "_v": [
    {
      "ar": "إِذَا جَآءَكَ ٱلْمُنَـٰفِقُونَ قَالُوا۟ نَشْهَدُ إِنَّكَ لَرَسُولُ ٱللَّهِ ۗ وَٱللَّهُ يَعْلَمُ إِنَّكَ لَرَسُولُهُۥ وَٱللَّهُ يَشْهَدُ إِنَّ ٱلْمُنَـٰفِقِينَ لَكَـٰذِبُونَ",
      "en": "When the hypocrites come to you they say, ‘We bear witness that you are indeed the apostle of Allah.’ Allah knows that you are indeed His Apostle, and Allah bears witness that the hypocrites are indeed liars.",
      "_n": 1
    },
    {
      "ar": "ٱتَّخَذُوٓا۟ أَيْمَـٰنَهُمْ جُنَّةً فَصَدُّوا۟ عَن سَبِيلِ ٱللَّهِ ۚ إِنَّهُمْ سَآءَ مَا كَانُوا۟ يَعْمَلُونَ",
      "en": "They make a shield of their oaths, and bar from the way of Allah. Evil indeed is what they used to do.",
      "_n": 2
    },
    {
      "ar": "ذَٰلِكَ بِأَنَّهُمْ ءَامَنُوا۟ ثُمَّ كَفَرُوا۟ فَطُبِعَ عَلَىٰ قُلُوبِهِمْ فَهُمْ لَا يَفْقَهُونَ",
      "en": "That is because they believed and then disbelieved, so their hearts were sealed. Hence, they do not understand.",
      "_n": 3
    },
    {
      "ar": "وَإِذَا رَأَيْتَهُمْ تُعْجِبُكَ أَجْسَامُهُمْ ۖ وَإِن يَقُولُوا۟ تَسْمَعْ لِقَوْلِهِمْ ۖ كَأَنَّهُمْ خُشُبٌ مُّسَنَّدَةٌ ۖ يَحْسَبُونَ كُلَّ صَيْحَةٍ عَلَيْهِمْ ۚ هُمُ ٱلْعَدُوُّ فَٱحْذَرْهُمْ ۚ قَـٰتَلَهُمُ ٱللَّهُ ۖ أَنَّىٰ يُؤْفَكُونَ",
      "en": "When you see them, their bodies impress you, and if they speak, you listen to their speech. Yet they are like dry logs set reclining [against a wall]. They suppose every cry is directed against them. They are the enemy, so beware of them. May Allah assail them, where do they stray?!",
      "_n": 4
    },
    {
      "ar": "وَإِذَا قِيلَ لَهُمْ تَعَالَوْا۟ يَسْتَغْفِرْ لَكُمْ رَسُولُ ٱللَّهِ لَوَّوْا۟ رُءُوسَهُمْ وَرَأَيْتَهُمْ يَصُدُّونَ وَهُم مُّسْتَكْبِرُونَ",
      "en": "When they are told, ‘Come, that Allah’s Apostle may plead for forgiveness for you,’ they twist their heads, and you see them turn away disdainfully.",
      "_n": 5
    },
    {
      "ar": "سَوَآءٌ عَلَيْهِمْ أَسْتَغْفَرْتَ لَهُمْ أَمْ لَمْ تَسْتَغْفِرْ لَهُمْ لَن يَغْفِرَ ٱللَّهُ لَهُمْ ۚ إِنَّ ٱللَّهَ لَا يَهْدِى ٱلْقَوْمَ ٱلْفَـٰسِقِينَ",
      "en": "It is the same for them whether you plead for forgiveness for them, or do not plead for forgiveness for them: Allah will never forgive them. Indeed Allah does not guide the transgressing lot.",
      "_n": 6
    },
    {
      "ar": "هُمُ ٱلَّذِينَ يَقُولُونَ لَا تُنفِقُوا۟ عَلَىٰ مَنْ عِندَ رَسُولِ ٱللَّهِ حَتَّىٰ يَنفَضُّوا۟ ۗ وَلِلَّهِ خَزَآئِنُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ وَلَـٰكِنَّ ٱلْمُنَـٰفِقِينَ لَا يَفْقَهُونَ",
      "en": "They are the ones who say, ‘Do not spend on those who are with the Apostle of Allah until they scatter off [from around him].’ Yet to Allah belong the treasuries of the heavens and the earth, but the hypocrites do not understand.",
      "_n": 7
    },
    {
      "ar": "يَقُولُونَ لَئِن رَّجَعْنَآ إِلَى ٱلْمَدِينَةِ لَيُخْرِجَنَّ ٱلْأَعَزُّ مِنْهَا ٱلْأَذَلَّ ۚ وَلِلَّهِ ٱلْعِزَّةُ وَلِرَسُولِهِۦ وَلِلْمُؤْمِنِينَ وَلَـٰكِنَّ ٱلْمُنَـٰفِقِينَ لَا يَعْلَمُونَ",
      "en": "They say, ‘When we return to the city, the mighty will surely expel the weak from it.’ Yet all might belongs to Allah and His Apostle and the faithful, but the hypocrites do not know.",
      "_n": 8
    },
    {
      "ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تُلْهِكُمْ أَمْوَٰلُكُمْ وَلَآ أَوْلَـٰدُكُمْ عَن ذِكْرِ ٱللَّهِ ۚ وَمَن يَفْعَلْ ذَٰلِكَ فَأُو۟لَـٰٓئِكَ هُمُ ٱلْخَـٰسِرُونَ",
      "en": "O you who have faith! Do not let your possessions and children distract you from the remembrance of Allah, and whoever does that—it is they who are the losers.",
      "_n": 9
    },
    {
      "ar": "وَأَنفِقُوا۟ مِن مَّا رَزَقْنَـٰكُم مِّن قَبْلِ أَن يَأْتِىَ أَحَدَكُمُ ٱلْمَوْتُ فَيَقُولَ رَبِّ لَوْلَآ أَخَّرْتَنِىٓ إِلَىٰٓ أَجَلٍ قَرِيبٍ فَأَصَّدَّقَ وَأَكُن مِّنَ ٱلصَّـٰلِحِينَ",
      "en": "Spend out of what We have provided you before death comes to any of you, whereat he might say, ‘My Lord, why did You not respite me for a short time so that I could give charity and become one of the righteous!’",
      "_n": 10
    },
    {
      "ar": "وَلَن يُؤَخِّرَ ٱللَّهُ نَفْسًا إِذَا جَآءَ أَجَلُهَا ۚ وَٱللَّهُ خَبِيرٌۢ بِمَا تَعْمَلُونَ",
      "en": "But Allah will never respite anyone when his time has come, and Allah is well aware of what you do.",
      "_n": 11
    }
  ],
  "_n": 63,
  "_c": 11
}