{
  "ar": "الطلاق",
  "en": "Divorce",
  "_a": "At-Talaaq",
  "_l": "Medinan",
  "_v": [
    {
      "ar": "يَـٰٓأَيُّهَا ٱلنَّبِىُّ إِذَا طَلَّقْتُمُ ٱلنِّسَآءَ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ وَأَحْصُوا۟ ٱلْعِدَّةَ ۖ وَٱتَّقُوا۟ ٱللَّهَ رَبَّكُمْ ۖ لَا تُخْرِجُوهُنَّ مِنۢ بُيُوتِهِنَّ وَلَا يَخْرُجْنَ إِلَّآ أَن يَأْتِينَ بِفَـٰحِشَةٍ مُّبَيِّنَةٍ ۚ وَتِلْكَ حُدُودُ ٱللَّهِ ۚ وَمَن يَتَعَدَّ حُدُودَ ٱللَّهِ فَقَدْ ظَلَمَ نَفْسَهُۥ ۚ لَا تَدْرِى لَعَلَّ ٱللَّهَ يُحْدِثُ بَعْدَ ذَٰلِكَ أَمْرًا",
      "en": "O Prophet! When you divorce women, divorce them at [the conclusion of] their term and calculate the term, and be wary of Allah, your Lord. Do not turn them out from their homes, nor shall they go out, unless they commit a gross indecency. These are Allah’s bounds, and whoever transgresses the bounds of Allah certainly wrongs himself. You never know maybe Allah will bring off something new later on.",
      "_n": 1
    },
    {
      "ar": "فَإِذَا بَلَغْنَ أَجَلَهُنَّ فَأَمْسِكُوهُنَّ بِمَعْرُوفٍ أَوْ فَارِقُوهُنَّ بِمَعْرُوفٍ وَأَشْهِدُوا۟ ذَوَىْ عَدْلٍ مِّنكُمْ وَأَقِيمُوا۟ ٱلشَّهَـٰدَةَ لِلَّهِ ۚ ذَٰلِكُمْ يُوعَظُ بِهِۦ مَن كَانَ يُؤْمِنُ بِٱللَّهِ وَٱلْيَوْمِ ٱلْـَٔاخِرِ ۚ وَمَن يَتَّقِ ٱللَّهَ يَجْعَل لَّهُۥ مَخْرَجًا",
      "en": "Then, when they have completed their term, either retain them honourably or separate from them honourably, and take the witness of two honest men from among yourselves, and bear witness for the sake of Allah. Whoever believes in Allah and the Last Day is advised to [comply with] this. Whoever is wary of Allah, He shall make for him a way out [of the adversities of the world and the Hereafter]",
      "_n": 2
    },
    {
      "ar": "وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ ۚ وَمَن يَتَوَكَّلْ عَلَى ٱللَّهِ فَهُوَ حَسْبُهُۥٓ ۚ إِنَّ ٱللَّهَ بَـٰلِغُ أَمْرِهِۦ ۚ قَدْ جَعَلَ ٱللَّهُ لِكُلِّ شَىْءٍ قَدْرًا",
      "en": "and provide for him from whence he does not count upon. And whoever puts his trust in Allah, He will suffice him. Indeed Allah carries through His commands. Certainly, Allah has ordained a measure [and extent] for everything.",
      "_n": 3
    },
    {
      "ar": "وَٱلَّـٰٓـِٔى يَئِسْنَ مِنَ ٱلْمَحِيضِ مِن نِّسَآئِكُمْ إِنِ ٱرْتَبْتُمْ فَعِدَّتُهُنَّ ثَلَـٰثَةُ أَشْهُرٍ وَٱلَّـٰٓـِٔى لَمْ يَحِضْنَ ۚ وَأُو۟لَـٰتُ ٱلْأَحْمَالِ أَجَلُهُنَّ أَن يَضَعْنَ حَمْلَهُنَّ ۚ وَمَن يَتَّقِ ٱللَّهَ يَجْعَل لَّهُۥ مِنْ أَمْرِهِۦ يُسْرًا",
      "en": "As for those of your wives who have ceased having menses—[or] if you have any doubts [concerning its cause, whether it’s is age or something else]—their term [of waiting] and of those who have not yet had menses, shall be three months. As for those who are pregnant, their term shall be until they deliver. And whoever is wary of Allah, He shall grant him ease in his affairs.",
      "_n": 4
    },
    {
      "ar": "ذَٰلِكَ أَمْرُ ٱللَّهِ أَنزَلَهُۥٓ إِلَيْكُمْ ۚ وَمَن يَتَّقِ ٱللَّهَ يُكَفِّرْ عَنْهُ سَيِّـَٔاتِهِۦ وَيُعْظِمْ لَهُۥٓ أَجْرًا",
      "en": "That is Allah’s ordinance, which He has sent down to you, and whoever is wary of Allah, He shall absolve him of his misdeeds and give him a great reward.",
      "_n": 5
    },
    {
      "ar": "أَسْكِنُوهُنَّ مِنْ حَيْثُ سَكَنتُم مِّن وُجْدِكُمْ وَلَا تُضَآرُّوهُنَّ لِتُضَيِّقُوا۟ عَلَيْهِنَّ ۚ وَإِن كُنَّ أُو۟لَـٰتِ حَمْلٍ فَأَنفِقُوا۟ عَلَيْهِنَّ حَتَّىٰ يَضَعْنَ حَمْلَهُنَّ ۚ فَإِنْ أَرْضَعْنَ لَكُمْ فَـَٔاتُوهُنَّ أُجُورَهُنَّ ۖ وَأْتَمِرُوا۟ بَيْنَكُم بِمَعْرُوفٍ ۖ وَإِن تَعَاسَرْتُمْ فَسَتُرْضِعُ لَهُۥٓ أُخْرَىٰ",
      "en": "House them where you live, in accordance with your means, and do not harass them to put them in straits, and should they be pregnant, maintain them until they deliver. Then, if they suckle [the baby] for you, give them their wages and consult together honourably. But if you make things difficult for each other, then another woman will suckle [the baby] for him.",
      "_n": 6
    },
    {
      "ar": "لِيُنفِقْ ذُو سَعَةٍ مِّن سَعَتِهِۦ ۖ وَمَن قُدِرَ عَلَيْهِ رِزْقُهُۥ فَلْيُنفِقْ مِمَّآ ءَاتَىٰهُ ٱللَّهُ ۚ لَا يُكَلِّفُ ٱللَّهُ نَفْسًا إِلَّا مَآ ءَاتَىٰهَا ۚ سَيَجْعَلُ ٱللَّهُ بَعْدَ عُسْرٍ يُسْرًا",
      "en": "Let the affluent man spend out of his affluence, and let he whose provision has been tightened spend out of what Allah has given him. Allah does not task any soul except [according to] what He has given it. Allah will bring about ease after hardship.",
      "_n": 7
    },
    {
      "ar": "وَكَأَيِّن مِّن قَرْيَةٍ عَتَتْ عَنْ أَمْرِ رَبِّهَا وَرُسُلِهِۦ فَحَاسَبْنَـٰهَا حِسَابًا شَدِيدًا وَعَذَّبْنَـٰهَا عَذَابًا نُّكْرًا",
      "en": "How many a town defied the command of its Lord and His apostles, then We called it to a severe account and punished it with a dire punishment.",
      "_n": 8
    },
    {
      "ar": "فَذَاقَتْ وَبَالَ أَمْرِهَا وَكَانَ عَـٰقِبَةُ أَمْرِهَا خُسْرًا",
      "en": "So it tasted the evil consequences of its conduct, and the outcome of its conduct was ruin.",
      "_n": 9
    },
    {
      "ar": "أَعَدَّ ٱللَّهُ لَهُمْ عَذَابًا شَدِيدًا ۖ فَٱتَّقُوا۟ ٱللَّهَ يَـٰٓأُو۟لِى ٱلْأَلْبَـٰبِ ٱلَّذِينَ ءَامَنُوا۟ ۚ قَدْ أَنزَلَ ٱللَّهُ إِلَيْكُمْ ذِكْرًا",
      "en": "Allah has prepared for them a severe punishment. So be wary of Allah, O you who possess intellect and have faith! Allah has already sent down to you a reminder,",
      "_n": 10
    },
    {
      "ar": "رَّسُولًا يَتْلُوا۟ عَلَيْكُمْ ءَايَـٰتِ ٱللَّهِ مُبَيِّنَـٰتٍ لِّيُخْرِجَ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ مِنَ ٱلظُّلُمَـٰتِ إِلَى ٱلنُّورِ ۚ وَمَن يُؤْمِنۢ بِٱللَّهِ وَيَعْمَلْ صَـٰلِحًا يُدْخِلْهُ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَآ أَبَدًا ۖ قَدْ أَحْسَنَ ٱللَّهُ لَهُۥ رِزْقًا",
      "en": "an apostle reciting to you the manifest signs of Allah that He may bring out those who have faith and do righteous deeds from darkness into light. And whoever has faith in Allah and does righteous deeds, He shall admit him into gardens with streams running in them, to remain in them forever. Allah has certainly granted him an excellent provision.",
      "_n": 11
    },
    {
      "ar": "ٱللَّهُ ٱلَّذِى خَلَقَ سَبْعَ سَمَـٰوَٰتٍ وَمِنَ ٱلْأَرْضِ مِثْلَهُنَّ يَتَنَزَّلُ ٱلْأَمْرُ بَيْنَهُنَّ لِتَعْلَمُوٓا۟ أَنَّ ٱللَّهَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ وَأَنَّ ٱللَّهَ قَدْ أَحَاطَ بِكُلِّ شَىْءٍ عِلْمًۢا",
      "en": "It is Allah who has created seven heavens, and of the earth [a number] similar to them. The command gradually descends through them, that you may know that Allah has power over all things, and that Allah comprehends all things in knowledge.",
      "_n": 12
    }
  ],
  "_n": 65,
  "_c": 12
}